pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// bl602_demo_at_text_0009.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 23090390: Register Eq_2 mbedtls_x509_crt_parse(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack word32 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tls_create_config_client_common
//      altcp_tls_create_config_client_2wayauth
Eq_2 mbedtls_x509_crt_parse(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgB8, word32 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg010C, Eq_2 dwArg0138, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s2_119;
	Eq_2 s0_143;
	if (a0 != 0x00)
	{
		Eq_2 s1_133 = a1;
		if (a1 != 0x00)
		{
			s7 = a0;
			s3 = a2;
			if (a2 != 0x00)
			{
				a5 = CONVERT(Mem29[a1 + a2 + -1:byte], byte, word32);
				if (a5 == 0x00)
				{
					s5.u0 = 0x230C8000;
					word32 a1_658;
					if (strstr(ra, a1, 0x230C8550, out a1_658, out a3, out a4, out a5) != 0x00)
					{
						Eq_2 s4_129 = 0x00;
						s0_143.u0 = 0x00;
						word32 s8_160 = 0x00;
						word32 s9_118 = 0x230C8000;
						s10.u0 = ~0x0100047F;
						s6.u0 = ~0x0100007F;
						s11.u0 = 0xFD000780;
						s2_119 = s2;
						while (true)
						{
							a5.u0 = 0x01;
							if (s3 <= 0x01)
								break;
							Eq_2 a0_90;
							Eq_2 a2_91;
							Eq_2 a3_92;
							Eq_2 a1_101;
							word32 s2_661;
							word32 s1_660;
							word32 a5_659;
							ra = mbedtls_pem_read_buffer(mbedtls_pem_init(ra, fp + -76, out a5_659), s0_143, fp + -76, (byte) s5.u0 + 0x0550, s9_118 + 1388, s1_133, fp + -80, s2_119, mstatus, dwArg24, dwArg78, dwArgB8, dwArgF8, out s0_143, out s1_660, out a0_90, out a1_101, out a2_91, out a3_92, out a4, out a5, out s2_661, out s3, out s4_129, out s5, out s6, out s7, out s8_160, out s9_118, out s10, out s11);
							s2_119 = a0_90;
							if (a0_90 != 0x00)
							{
								if (a0_90 == s10)
									goto l23090478;
								if (a0_90 == s6)
									break;
								up32 a5_126;
								word32 a3_666;
								Eq_2 s1_128 = mbedtls_pem_free(fp + -76, a2_91, a5, mstatus, dwArgF8, dwArg0138, out a3_666, out a4, out a5_126, out s4_129);
								0x00 = (int8) dwArg94;
								s3 -= a5_126;
								s1_133 = (word32) s1_128 + a5_126;
								goto l2309045A;
							}
							0x00 = (int8) dwArg94;
							Eq_2 a0_139;
							Eq_2 a2_151;
							Eq_2 a5_152;
							word32 s2_664;
							word32 a1_662;
							word32 a4_663;
							ra = mbedtls_x509_crt_parse_der(ra, dwArg34, s7, a1_101, a2_91, a3_92, a4, a5, s5, s6, s7, s10, s11, mstatus, dwLoc4C, dwLoc48, s8, s6, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg74, dwArg78, dwArg98, dwArgB8, dwArgF4, out s0_143, out a0_139, out a1_662, out a2_151, out a4_663, out a5_152, out s2_664, out s3, out s5, out s6, out s7, out s8_160, out s9_118, out s10, out s11, out mstatus);
							s2_119 = a0_139;
							word32 a3_665;
							s1_133 = mbedtls_pem_free(fp + -76, a2_151, a5_152, mstatus, dwArgF8, dwArg0138, out a3_665, out a4, out a5, out s4_129);
							if (a0_139 != 0x00)
							{
								if (a0_139 == s11)
								{
l23090478:
									s0_143 = s2_119;
									goto l230903E2;
								}
l2309045A:
								if (s0_143 == 0x00)
									s0_143 = s2_119;
								s4_129 = (word32) s4_129 + 1;
								continue;
							}
							s8_160 = 0x01;
						}
						if (s8_160 == 0x00)
						{
							if (s0_143 == 0x00)
								s0_143.u0 = ~0x0200077F;
						}
						else
							s0_143 = s4_129;
l230903E2:
						0x00 = (int8) dwArg010C;
						s0Out = dwArgCC;
						s1Out = dwLoc4C;
						a0Out = s0_143;
						a2Out = dwArg01A8;
						a3Out = s2;
						a4Out = a4;
						a5Out = a5;
						s2Out = s2_119;
						s3Out = s3;
						s4Out = dwArg0168;
						s5Out = s5;
						s6Out = s6;
						s7Out = s7;
						s8Out = dwArg0148;
						s10Out = s10;
						s11Out = s11;
						mstatusOut = mstatus;
						return dwLoc08;
					}
				}
			}
			word32 s9_657;
			Eq_2 a0_222;
			word32 s0_653;
			word32 a1_654;
			word32 a2_655;
			word32 s8_656;
			mbedtls_x509_crt_parse_der(ra, s0, a0, a1, a2, a3, a4, a5, s5, s6, a0, s10, s11, mstatus, dwLoc4C, dwLoc48, s8, s6, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg74, dwArg78, dwArg98, dwArgB8, dwArgF4, out s0_653, out a0_222, out a1_654, out a2_655, out a4, out a5, out s2_119, out s3, out s5, out s6, out s7, out s8_656, out s9_657, out s10, out s11, out mstatus);
			s0_143 = a0_222;
			goto l230903E2;
		}
	}
	s0_143.u0 = ~0x020007FF;
	s2_119 = s2;
	goto l230903E2;
}

