pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 230904A4: Register Eq_2 mycalloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out (ptr32 Eq_496323) s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_496327) a4Out, Register out Eq_496328 a5Out, Register out Eq_496329 s2Out, Register out (ptr32 Eq_496330) s3Out, Register out Eq_496331 s4Out, Register out Eq_496332 s8Out)
// Called from:
//      rsa_alloc_wrap
//      eckey_alloc_wrap
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_ssl_conf_own_cert
//      mbedtls_ssl_set_hostname
//      mbedtls_ssl_setup
//      mbedtls_ssl_write_record
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_parse_certificate
//      mbedtls_x509_crt_parse_der
//      mbedtls_asn1_get_sequence_of
//      mbedtls_mpi_grow
//      mbedtls_mpi_shrink
//      gcm_ctx_alloc
//      aes_ctx_alloc
//      ecp_normalize_jac_many
//      mbedtls_ecp_mul
//      mbedtls_md_setup
//      md5_ctx_alloc
//      sha1_ctx_alloc
//      sha224_ctx_alloc
//      mbedtls_pem_read_buffer
//      mbedtls_x509_get_name
Eq_2 mycalloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s0Out, struct Eq_496323 & s1Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_496327 & a4Out, union Eq_496328 & a5Out, union Eq_496329 & s2Out, struct Eq_490569 & s3Out, union Eq_496331 & s4Out, union Eq_496332 & s8Out)
{
	word32 a2_5 = a0 + a1;
	Eq_2 a0_18;
	struct Eq_496323 * s1_26;
	Eq_496329 s2_27;
	struct Eq_490569 * s3_28;
	Eq_496331 s4_29;
	word32 a1_69;
	word32 a2_70;
	word32 a3_71;
	word32 a4_72;
	word32 a5_73;
	word32 a6_74;
	word32 s8_75;
	pvPortMalloc(ra, s1, a2_5, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_26, out a0_18, out a1_69, out a2_70, out a3_71, out a4_72, out a5_73, out a6_74, out s2_27, out s3_28, out s4_29, out s8_75);
	ptr32 a1_37;
	ptr32 a2_38;
	ptr32 a3_39;
	struct Eq_496327 * a4_40;
	Eq_496328 a5_41;
	word32 t1_76;
	word32 a0_77;
	Eq_2 ra_42 = memset(ra, a0_18, 0x00, a2_5, out t1_76, out a0_77, out a1_37, out a2_38, out a3_39, out a4_40, out a5_41);
	s0Out = a0_18;
	s1Out = s1_26;
	a1Out = a1_37;
	a2Out = a2_38;
	a3Out = a3_39;
	a4Out = a4_40;
	a5Out = a5_41;
	s2Out = s2_27;
	s3Out = s3_28;
	s4Out = s4_29;
	s8Out = dwLoc1C;
	return ra_42;
}

// 230904CA: Register int32 aes_gen_tables(Stack Eq_2 dwArg0148, Register out Eq_525912 a0Out, Register out (ptr32 byte) a1Out, Register out (ptr32 Eq_525914) a3Out, Register out Eq_525915 a4Out)
// Called from:
//      mbedtls_aes_setkey_enc
int32 aes_gen_tables(Eq_2 dwArg0148, union Eq_525912 & a0Out, byte & a1Out, struct Eq_525914 & a3Out, union Eq_525915 & a4Out)
{
	ptr32 a2_19 = fp + -2080;
	ptr32 * a5_20 = (ptr32 *) 0x01;
	int32 a3_21;
	for (a3_21 = 0x00; a3_21 != 0x0100; ++a3_21)
	{
		((a5_20 << 0x02) + (fp + 0x00FFEFE0))->dw0C00 = a3_21;
		*a5_20 = a2_19;
		ui32 a1_34 = a5_20 & 0x0080;
		ui32 a4_35 = a5_20 << 0x01;
		if (a1_34 != 0x00)
			a1_34 = 0x1B;
		a5_20 = (a5_20 ^ a4_35 ^ a1_34) & 0x00FF;
		a2_19 += 0x04;
	}
	word32 a4_50;
	word32 * a5_52 = (word32 *) 0x01;
	for (a4_50 = 1107417060; a4_50 != 1107417100; a4_50 += 0x04)
	{
		*a5_52 = a4_50;
		ui32 a3_56 = a5_52 << 0x01;
		ui32 a5_57 = a5_52 & 0x0080;
		if (a5_57 != 0x00)
			a5_57 = 0x1B;
		a5_52 = (a5_57 ^ a3_56) & 0x00FF;
	}
	g_a4201C6E4[0] = 99;
	g_b4201D86F = 0x00;
	int32 * t1_76 = fp + -0x0420 + 4;
	struct Eq_525988 * a7_117 = (struct Eq_525988 *) 0x01;
	byte * a1_148 = g_a4201C6E4;
	byte * a2_187 = g_a4201D80C;
	do
	{
		int32 t5_93 = ((0x00FF - *t1_76 << 2) + (fp + 0x00FFEFE0))->dwFFFFF800;
		ui32 a5_97 = t5_93 << 0x01 | t5_93 >> 0x07;
		ui32 a0_101 = (a5_97 & 0x00FF) << 0x01 | (a5_97 & 0x00FF) >> 0x07;
		ui32 a3_105 = (a0_101 & 0x00FF) << 0x01 | (a0_101 & 0x00FF) >> 0x07;
		ui32 a5_114 = ((a3_105 & 0x00FF) >> 0x07 | (a3_105 & 0x00FF) << 0x01) & 0x00FF ^ t5_93 ^ a5_97 & 0x00FF ^ a0_101 & 0x00FF ^ a3_105 & 0x00FF;
		a7_117[1107412708] = (struct Eq_525988) (byte) (a5_114 ^ 99);
		(a5_114 ^ 99)->b4201D80C = (byte) a7_117;
		++t1_76;
		++a7_117;
	} while (a7_117 != (struct Eq_525988 *) 0x0100);
	struct Eq_525914 * a3_137 = null;
	do
	{
		int32 s5_189;
		ui32 s4_190;
		ui32 a4_150 = (word32) *a1_148;
		ui32 s4_156 = a4_150 << 0x01 ^ (int32) ((byte) a4_150) >> 31 & 0x1B;
		ptr32 * a5_164 = a4_150 << 0x08 ^ a4_150 << 0x10 ^ s4_156 & 0x00FF ^ (a4_150 ^ s4_156 & 0x00FF) << 24;
		*a5_164 = a3_137 + 0x108071F9;
		a3_137[0x108072F9] = (struct Eq_525914) (a5_164 << 0x08 | a5_164 >> 0x18);
		a3_137[276853753] = (struct Eq_525914) (a5_164 << 0x10 | a5_164 >> 0x10);
		a3_137[0x108074F9] = (struct Eq_525914) (a5_164 << 24 | a5_164 >> 0x08);
		ui32 a5_188 = (word32) *a2_187;
		if (a5_188 != 0x00)
		{
			int32 a4_197 = ((a5_188 << 0x02) + (fp + 0x00FFEFE0))->dwFFFFFC00;
			s5_189 = (((dwLoc03E8 + a4_197 | 0x00FF) << 2) + (fp + 0x00FFEFE0))->dwFFFFF800;
			s4_190 = (((a4_197 + dwLoc03FC | 0x00FF) << 2) + (fp + 0x00FFEFE0))->dwFFFFF800 << 8;
		}
		else
		{
			s5_189 = 0x00;
			s4_190 = 0x00;
		}
		ui32 s4_218 = s4_190 ^ s5_189;
		ui32 a4_219 = 0x00;
		if (a5_188 != 0x00)
			a4_219 = (((((a5_188 << 0x02) + (fp + 0x00FFEFE0))->dwFFFFFC00 + dwLoc03EC | 0x00FF) << 2) + (fp + 0x00FFEFE0))->dwFFFFF800 << 16;
		ui32 s4_242 = s4_218 ^ a4_219;
		ui32 a4_243 = 0x00;
		if (a5_188 != 0x00)
			a4_243 = (((((a5_188 << 2) + (fp + 0x00FFEFE0))->dwFFFFFC00 + dwLoc03F4 | 0x00FF) << 2) + (fp + 0x00FFEFE0))->dwFFFFF800 << 0x18;
		word32 * a5_267 = s4_242 ^ a4_243;
		*a5_267 = a3_137 + 0x10807643;
		a3_137[0x10807743] = (struct Eq_525914) (a5_267 << 0x08 | a5_267 >> 0x18);
		a3_137[0x10807843] = (struct Eq_525914) (a5_267 << 0x10 | a5_267 >> 0x10);
		a3_137[276855107] = (struct Eq_525914) (a5_267 << 24 | a5_267 >> 0x08);
		++a3_137;
		++a1_148;
		++a2_187;
	} while (a3_137 != (struct Eq_525914 *) 0x0400);
	0x00 = (int8) dwArg0148;
	a0Out.u0 = 0x00FF;
	a1Out = a1_148;
	a3Out = a3_137;
	a4Out = a5_267 >> 0x08;
	return dwLoc03FC;
}

// 230907BE: Register Eq_2 mbedtls_aes_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      block_cipher_df
//      mbedtls_ctr_drbg_seed
//      mbedtls_aes_setkey_dec
//      aes_ctx_alloc
//      pem_aes_decrypt
Eq_2 mbedtls_aes_init(Eq_2 ra, Eq_2 a0, ptr32 & a1Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a1_8;
	ptr32 a4_11;
	ptr32 a5_12;
	word32 t1_19;
	word32 a0_20;
	word32 a2_21;
	word32 a3_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 0x0118, out t1_19, out a0_20, out a1_8, out a2_21, out a3_22, out a4_11, out a5_12);
	a1Out = a1_8;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

// 230907C8: Register word32 mbedtls_aes_free(Register Eq_2 a0)
// Called from:
//      block_cipher_df
//      mbedtls_aes_setkey_dec
//      aes_ctx_free
//      pem_aes_decrypt
word32 mbedtls_aes_free(Eq_2 a0)
{
	a0_5 = a0;
	if (a0 != 0x00)
	{
		while (true)
		{
			Eq_2 a0_5;
			if (a0_5 == (word32) a0 + 0x0118)
				break;
			*a0_5 = 0x00;
			a0_5 = (word32) a0_5 + 1;
		}
	}
	return (word32) a0 + 0x0118;
}

// 230907DC: Register (ptr32 Eq_492553) mbedtls_aes_setkey_enc(Register (ptr32 Eq_492553) a0, Register (ptr32 Eq_492554) a1, Register Eq_492555 a2, Register (ptr32 Eq_492556) a4, Register Eq_492534 a5, Stack (ptr32 Eq_492553) dwArg44, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_492553) a0Out, Register out (ptr32 Eq_492554) a1Out, Register out (ptr32 Eq_492562) a3Out, Register out (ptr32 Eq_492556) a4Out, Register out ptr32 s4Out)
// Called from:
//      block_cipher_df
//      ctr_drbg_update_internal
//      mbedtls_ctr_drbg_seed
//      mbedtls_aes_setkey_dec
//      aes_setkey_enc_wrap
struct Eq_492553 * mbedtls_aes_setkey_enc(struct Eq_492553 * a0, struct Eq_492554 * a1, Eq_492555 a2, struct Eq_492556 * a4, Eq_492534 a5, struct Eq_492553 * dwArg44, Eq_2 dwArg0128, struct Eq_492553 & a0Out, struct Eq_492554 & a1Out, struct Eq_492562 & a3Out, struct Eq_492556 & a4Out, ptr32 & s4Out)
{
	struct Eq_492553 * s0_14 = a0;
	if (a5 == 0x00)
	{
		*(union Eq_2 *) 0x01 = aes_gen_tables(dwArg0128, out a0, out a1, out a3, out a4);
		s0_14 = dwArg44;
	}
	struct Eq_492553 ** a5_48;
	if (a2 != 0x00C0)
	{
		if (a2 != 0x0100)
		{
			a0 = (struct Eq_492553 *) ~0x1F;
			if (a2 != 0x0080)
				goto l230908C6;
			a5_48 = (struct Eq_492553 **) 0x0A;
		}
		else
			a5_48 = (struct Eq_492553 **) 0x0E;
	}
	else
		a5_48 = (struct Eq_492553 **) 0x0C;
	*a5_48 = (struct Eq_492553 **) s0_14;
	struct Eq_526337 * a5_61 = (char *) &s0_14->ptr0000 + 8;
	a5_61[1] = (struct Eq_526337) s0_14;
	struct Eq_526337 * a3_63 = a5_61;
	struct Eq_492554 * a2_66 = a1 + ((a2 >> 5) << 2) / 4;
	while (a2_66 != a1)
	{
		++a1;
		ui32 a0_80 = (word32) a1->bFFFFFFFF;
		++a3_63;
		a4 = (word32) a1->b0001 << 8 | (word32) a1->b0002 << 16 | (word32) a1->b0000 | a0_80 << 24;
		a3_63[0x03FF] = (struct Eq_526337) a4;
		a0 = a0_80 << 24;
	}
	s0_14 = a4->ptr0000;
	a3 = (struct Eq_492562 *) 0x0C;
	if (a4 != (struct Eq_492556 *) 0x0C)
	{
		a3 = (struct Eq_492562 *) 0x0E;
		if (a4 != (struct Eq_492556 *) 0x0E)
		{
			a3 = (struct Eq_492562 *) 0x0A;
			a0 = null;
			if (a4 != (struct Eq_492556 *) 0x0A)
				goto l230908C6;
			a1 = (struct Eq_492554 *) g_a4201D7E4;
			s0_14 = (struct Eq_492553 *) ((char *) &s0_14->ptr0000 + 0x00A8);
			do
			{
				struct Eq_526388 * a5_236 = a0->ptr0000;
				ptr32 * a4_261 = (word32) g_a4201C6E4[0] ^ (a0 ^ a1->b0000) ^ (word32) g_a4201C6E4[0] << 16 ^ (word32) g_b4201C6EE << 24 ^ (word32) g_a4201C6E4[0] << 8;
				int32 a0_262 = a5_236->dw0004;
				*a4_261 = &a5_236->ptr0010;
				struct Eq_526428 * a4_264 = a4_261 ^ a0_262;
				a0 = a5_236->ptr0008;
				a4_264->ptr0004 = &a5_236->ptr0010;
				struct Eq_526437 * a4_267 = a4_264 ^ a0;
				a4_267->ptr0008 = &a5_236->ptr0010;
				(a4_267 ^ 0x0A)->ptr000C = &a5_236->ptr0010;
				++a1;
				a4 = a4_267 ^ 0x0A;
			} while (&a5_236->ptr0010 != (char *) (&s0_14->ptr0000) + 0x00A8);
		}
		else
		{
			int32 * a0_146 = g_a4201D7E4;
			s0_14 = (struct Eq_492553 *) ((char *) &s0_14->ptr0000 + 232);
			do
			{
				struct Eq_526472 * a5_155 = a3->ptr0000;
				int32 a6_162 = a5_155->dw0010;
				ptr32 * a4_181 = (word32) (a1 >> 0x08 & 0x00FF)->b4201C6E4 ^ (a3 ^ *a0_146) ^ (word32) (a1 >> 0x18)->b4201C6E4 << 16 ^ (word32) (a1 & 0x00FF)->b4201C6E4 << 24 ^ (word32) (a1 >> 0x10 & 0x00FF)->b4201C6E4 << 8;
				int32 a3_182 = a5_155->dw0004;
				*a4_181 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_526532 * a4_184 = a4_181 ^ a3_182;
				int32 a3_185 = a5_155->dw0008;
				a4_184->ptr0004 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_526542 * a4_187 = a4_184 ^ a3_185;
				int32 a3_188 = a5_155->dw000C;
				a4_187->ptr0008 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_526552 * a4_190 = a4_187 ^ a3_188;
				a4_190->ptr000C = (char *) &a5_155->ptr0018 + 8;
				struct Eq_526558 * a4_212 = (word32) (a4_190 >> 16 & 0x00FF)->b4201C6E4 << 16 ^ ((((word32) (a4_190 & 0x00FF)->b4201C6E4 ^ a6_162) ^ (word32) (a4_190 >> 0x18)->b4201C6E4 << 24) ^ (word32) (a4_190 >> 0x08 & 0x00FF)->b4201C6E4 << 8);
				int32 a3_213 = a5_155->dw0014;
				a4_212->ptr0010 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_526605 * a4_215 = a4_212 ^ a3_213;
				a3 = a5_155->ptr0018;
				a4_215->ptr0014 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_526614 * a4_218 = a4_215 ^ a3;
				a4_218->ptr0018 = (char *) &a5_155->ptr0018 + 8;
				a4 = a4_218 ^ a1;
				a4->ptr001C = (char *) &a5_155->ptr0018 + 8;
				++a0_146;
			} while ((char *) &a5_155->ptr0018 + 8 != (char *) (&s0_14->ptr0000) + 232);
		}
	}
	else
	{
		a1 = (struct Eq_492554 *) g_a4201D7E4;
		s0_14 = (struct Eq_492553 *) ((char *) &s0_14->ptr0000 + 200);
		do
		{
			struct Eq_526388 * a5_101 = a0->ptr0000;
			ptr32 * a4_126 = (word32) g_a4201C6E4[0] ^ (a0 ^ a1->b0000) ^ (word32) g_a4201C6E4[0] << 16 ^ (word32) g_b4201C6F0 << 24 ^ (word32) g_a4201C6E4[0] << 8;
			int32 a0_127 = a5_101->dw0004;
			*a4_126 = (char *) &a5_101->ptr0010 + 8;
			struct Eq_526670 * a4_129 = a4_126 ^ a0_127;
			struct Eq_492553 * a0_130 = a5_101->ptr0008;
			a4_129->ptr0004 = (char *) &a5_101->ptr0010 + 8;
			struct Eq_526680 * a4_132 = a4_129 ^ a0_130;
			int32 a0_133 = a5_101->dw000C;
			a4_132->ptr0008 = (char *) &a5_101->ptr0010 + 8;
			struct Eq_526690 * a4_135 = a4_132 ^ a0_133;
			a0 = a5_101->ptr0010;
			a4_135->ptr000C = (char *) &a5_101->ptr0010 + 8;
			struct Eq_526699 * a4_138 = a4_135 ^ a0;
			a4_138->ptr0010 = (char *) &a5_101->ptr0010 + 8;
			(a4_138 ^ 0x0C)->ptr0014 = (char *) &a5_101->ptr0010 + 8;
			++a1;
			a4 = a4_138 ^ 0x0C;
		} while ((char *) &a5_101->ptr0010 + 8 != (char *) (&s0_14->ptr0000) + 200);
	}
	a0 = null;
l230908C6:
	a0Out = a0;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	s4Out = dwArg04;
	return s0_14;
}

