pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23090A6C: void mbedtls_aes_setkey_dec(Register Eq_2 ra, Register (ptr32 Eq_526718) a1)
// Called from:
//      aes_setkey_dec_wrap
//      pem_aes_decrypt
void mbedtls_aes_setkey_dec(Eq_2 ra, struct Eq_526718 * a1)
{
	struct Eq_492554 * a1_18;
	struct Eq_492556 * a4_21;
	word32 a5_197;
	mbedtls_aes_init(ra, fp + -296, out a1_18, out a4_21, out a5_197);
	a1[0x0C] = (struct Eq_526718) a1;
	word32 a0_31;
	union Eq_2 * a1_32;
	word32 s4_200;
	word32 a4_199;
	word32 a3_198;
	Eq_2 s0_38 = mbedtls_aes_setkey_enc(fp + -296, a1_18, dwLocDC, a4_21, a1 + 8, dwLocFC, dwLoc18, out a0_31, out a1_32, out a3_198, out a4_199, out s4_200);
	if (a0_31 == 0x00)
	{
		*a1_32 = (union Eq_2 *) s0_38;
		((Eq_583177[]) 8)[a1_32].t0000 = s0_38;
		((Eq_583178[]) 0x0C)[a1_32].t0000 = s0_38;
		((Eq_583179[]) 16)[a1_32].t0000 = s0_38;
		ptr32 a5_119 = ((Eq_583180[]) 0x0C)[a1_32].dw0000 + ~0x0F;
		((Eq_583181[]) 20)[a1_32].t0000 = s0_38;
		struct Eq_526785 * a4_113 = a1_32 << 0x04;
		struct Eq_526788 * a2_116 = (word32) s0_38 + 24;
		Eq_526791 a1_118 = (char *) a1_32 - 1;
		while (a1_118 > 0x00)
		{
			int32 a6_71;
			for (a6_71 = 0x00; a6_71 != 0x10; a6_71 += 0x04)
			{
				uint32 a4_76 = a5_119 + a6_71;
				a4_113 = g_a4201E10C[(word32) (a4_76 >> 16 & 0x00FF)->b4201C6E4 * 0x04] ^ ((g_a4201D90C[(word32) (a4_76 & 0x00FF)->b4201C6E4 * 0x04] ^ g_a4201E50C[(word32) (a4_76 >> 0x18)->b4201C6E4 * 0x04]) ^ g_a4201DD0C[(word32) (a4_76 >> 0x08 & 0x00FF)->b4201C6E4 * 0x04]);
				a2_116[a6_71 / 16] = (struct Eq_526788) a4_113;
			}
			a2_116 = (struct Eq_526788 *) ((char *) &a2_116->ptr000C + 4);
			a1_118 = (word32) a1_118 - 1;
			a5_119 += ~0x0F;
		}
		a4_113->ptr0000 = a2_116;
		a4_113->ptr0004 = a2_116;
		struct Eq_526788 * a5_127 = a4_113->ptr0008;
		a4_113->ptr0008 = a2_116;
		a5_127->ptr000C->ptr000C = a2_116;
	}
	mbedtls_aes_free(fp + -296);
}

// 23090B86: Register word32 mbedtls_aes_encrypt(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Stack word32 dwArg3C, Stack Eq_2 dwArg0148, Register out (ptr32 Eq_526885) s1Out, Register out (ptr32 byte) a3Out, Register out (ptr32 byte) a4Out, Register out Eq_526888 a5Out, Register out ptr32 a6Out, Register out (ptr32 byte) s2Out, Register out (ptr32 Eq_526891) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 Eq_527197) s6Out, Register out Eq_526895 s7Out, Register out ptr32 s8Out, Register out Eq_526897 s9Out, Register out Eq_526898 s10Out, Register out Eq_526899 s11Out)
// Called from:
//      mbedtls_aes_crypt_ecb
//      aes_crypt_ctr_wrap
//      aes_crypt_cfb128_wrap
word32 mbedtls_aes_encrypt(Eq_2 a1, Eq_2 a2, Eq_2 a4, word32 dwArg3C, Eq_2 dwArg0148, struct Eq_526885 & s1Out, byte & a3Out, byte & a4Out, union Eq_526888 & a5Out, ptr32 & a6Out, byte & s2Out, struct Eq_526891 & s3Out, ptr32 & s4Out, byte & s5Out, union Eq_527197 & s6Out, union Eq_526895 & s7Out, ptr32 & s8Out, union Eq_526897 & s9Out, union Eq_526898 & s10Out, union Eq_526899 & s11Out)
{
	ui32 a3_39 = (word32) *((word32) a1 + 1) << 8 | (word32) (*a1) | (word32) (*((word32) a1 + 2)) << 16;
	ui32 a3_58 = (word32) *((word32) a1 + 6) << 16 | ((word32) (*((word32) a1 + 5)) << 8 | (word32) (*((word32) a1 + 4)));
	struct Eq_526938 * a3_71 = (word32) *((word32) a1 + 0x0A) << 16 | ((word32) (*((word32) a1 + 9)) << 8 | (word32) (*((word32) a1 + 8)));
	struct Eq_526957 * t6_107 = (word32) a4 + 16;
	uint32 a5_233 = ((word32) *((word32) a1 + 3) << 24 | a3_39) ^ a3_39;
	uint32 s10_103 = ((word32) *((word32) a1 + 7) << 24 | a3_58) ^ a3_58;
	uint32 s9_118 = ((word32) *((word32) a1 + 11) << 24 | a3_71) ^ a3_71;
	uint32 s8_276 = ((word32) *((word32) a1 + 0x0F) << 24 | ((word32) (*((word32) a1 + 0x0E)) << 16 | ((word32) (*((word32) a1 + 0x0D)) << 8 | (word32) (*((word32) a1 + 0x0C))))) ^ (a3_71->ptr0008)->dw000C;
	Eq_526895 s7_213 = (**((word32) a4 + 4) >> 0x01) + ~0x00;
	while (true)
	{
		uint32 a1_129 = a1 ^ g_a4201D3E4[(s8_276 >> 0x18) * 0x04] ^ t6_107->dw0000 ^ (s10_103 >> 0x06 & 1020)->dw4201CBE4 ^ (s9_118 >> 0x0E & 1020)->dw4201CFE4;
		int32 s11_138 = t6_107->dw0010;
		uint32 a3_153 = g_a4201C7E4[(s10_103 & 0x00FF) * 0x04] ^ g_a4201D3E4[(a5_233 >> 0x18) * 0x04] ^ t6_107->dw0004 ^ (s9_118 >> 0x06 & 1020)->dw4201CBE4 ^ (s8_276 >> 0x0E & 1020)->dw4201CFE4;
		uint32 a0_178 = g_a4201C7E4[(s9_118 & 0x00FF) * 0x04] ^ g_a4201D3E4[(s10_103 >> 0x18) * 0x04] ^ t6_107->dw0008 ^ (s8_276 >> 0x06 & 1020)->dw4201CBE4 ^ (a5_233 >> 0x0E & 1020)->dw4201CFE4;
		uint32 a4_191 = g_a4201C7E4[(s8_276 & 0x00FF) * 0x04] ^ g_a4201D3E4[(s9_118 >> 0x18) * 0x04] ^ t6_107->dw000C ^ (a5_233 >> 6 & 1020)->dw4201CBE4 ^ (s10_103 >> 0x0E & 1020)->dw4201CFE4;
		int32 s10_202 = t6_107->dw0014;
		int32 s9_205 = t6_107->dw0018;
		int32 s8_208 = t6_107->dw001C;
		if (s7_213 <= 0x00)
			break;
		union Eq_2 * a4_254 = g_a4201C7E4[(a4_191 & 0x00FF) * 0x04] ^ g_a4201D3E4[(a0_178 >> 24) * 0x04];
		a5_233 = g_a4201C7E4[(a1_129 & 0x00FF) * 0x04] ^ g_a4201D3E4[(a4_191 >> 0x18) * 0x04] ^ s11_138 ^ g_a4201CBE4[(a3_153 >> 0x08 & 0x00FF) * 0x04] ^ g_a4201CFE4[(a0_178 >> 0x10 & 0x00FF) * 0x04];
		s10_103 = g_a4201C7E4[(a3_153 & 0x00FF) * 0x04] ^ g_a4201D3E4[(a1_129 >> 0x18) * 0x04] ^ s10_202 ^ g_a4201CBE4[(a0_178 >> 0x08 & 0x00FF) * 0x04] ^ g_a4201CFE4[(a4_191 >> 0x10 & 0x00FF) * 0x04];
		a1 = *a4_254;
		s9_118 = g_a4201C7E4[(a0_178 & 0x00FF) * 0x04] ^ g_a4201D3E4[(a3_153 >> 0x18) * 0x04] ^ s9_205 ^ g_a4201CBE4[(a4_191 >> 0x08 & 0x00FF) * 0x04] ^ g_a4201CFE4[(a1_129 >> 0x10 & 0x00FF) * 0x04];
		++t6_107;
		s8_276 = a4_254 ^ s8_208 ^ a4_254 ^ a4_254;
		s7_213 = (word32) s7_213.u0 - 1;
	}
	union Eq_527197 * s6_280 = (a1_129 & 0x00FF) + 1107412708;
	byte * s5_294 = (a3_153 & 0x00FF) + 1107412708;
	struct Eq_526891 * s3_309 = (a0_178 & 0x00FF) + 1107412708;
	byte * s2_315 = (a3_153 >> 0x18) + 1107412708;
	byte * a4_320 = (a4_191 & 0x00FF) + 1107412708;
	byte * a3_325 = (a3_153 >> 16 & 0x00FF) + 1107412708;
	uint32 s11_296 = (word32) (a3_153 >> 0x08 & 0x00FF)->b4201C6E4 << 8 ^ ((word32) (*s6_280) ^ s11_138) ^ (word32) (a0_178 >> 0x10 & 0x00FF)->b4201C6E4 << 16 ^ (word32) (a4_191 >> 0x18)->b4201C6E4 << 24;
	uint32 s10_312 = (word32) (a0_178 >> 0x08 & 0x00FF)->b4201C6E4 << 8 ^ ((word32) (*s5_294) ^ s10_202) ^ (word32) (a4_191 >> 0x10 & 0x00FF)->b4201C6E4 << 16 ^ (word32) (a1_129 >> 0x18)->b4201C6E4 << 24;
	uint32 s9_328 = (word32) (a4_191 >> 0x08 & 0x00FF)->b4201C6E4 << 8 ^ ((word32) s3_309->b0000 ^ s9_205) ^ (word32) (a1_129 >> 0x10 & 0x00FF)->b4201C6E4 << 16 ^ (word32) (*s2_315) << 24;
	ui32 s8_336 = (word32) *a4_320 ^ s8_208 ^ (word32) (a1_129 >> 8 & 0x00FF)->b4201C6E4 << 8 ^ (word32) (*a3_325) << 16;
	ui32 a5_337 = (word32) (a0_178 >> 24)->b4201C6E4;
	*a2 = (byte) s11_296;
	*((word32) a2 + 4) = (byte) s10_312;
	*((word32) a2 + 1) = (byte) (s11_296 >> 0x08);
	*((word32) a2 + 2) = (byte) (s11_296 >> 0x10);
	*((word32) a2 + 5) = (byte) (s10_312 >> 0x08);
	*((word32) a2 + 6) = (byte) (s10_312 >> 0x10);
	*((word32) a2 + 9) = (byte) (s9_328 >> 0x08);
	*((word32) a2 + 0x0A) = (byte) (s9_328 >> 0x10);
	*((word32) a2 + 8) = (byte) s9_328;
	uint32 s8_343 = s8_336 ^ a5_337 << 24;
	*((word32) a2 + 0x0C) = (byte) s8_343;
	*((word32) a2 + 0x0D) = (byte) (s8_343 >> 0x08);
	*((word32) a2 + 3) = (byte) (s11_296 >> 0x18);
	*((word32) a2 + 7) = (byte) (s10_312 >> 0x18);
	*((word32) a2 + 11) = (byte) (s9_328 >> 0x18);
	*((word32) a2 + 0x0F) = (byte) (s8_343 >> 0x18);
	*((word32) a2 + 0x0E) = (byte) (s8_343 >> 0x10);
	0x00 = (int8) dwArg0148;
	0x00 = dwArg3C;
	s1Out = (struct Eq_526885 *) g_a4201C7E4;
	a3Out = a3_325;
	a4Out = a4_320;
	a5Out = s8_343 >> 0x10;
	a6Out = dwArgB8;
	s2Out = s2_315;
	s3Out = s3_309;
	s4Out = dwArg98;
	s5Out = s5_294;
	s6Out = s6_280;
	s7Out = s7_213;
	s8Out = dwArg78;
	s9Out = s9_328 >> 0x18;
	s10Out = s10_312 >> 0x18;
	s11Out = s11_296 >> 0x18;
	return dwLoc04;
}

