pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23090FC6: Register word32 mbedtls_aes_decrypt(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack word32 dwArg3C, Stack Eq_2 dwArg0148, Register out (ptr32 byte) s1Out, Register out (ptr32 byte) s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 byte) s6Out, Register out Eq_527566 s7Out, Register out ptr32 s8Out, Register out Eq_527568 s9Out, Register out Eq_527569 s10Out, Register out Eq_527570 s11Out)
// Called from:
//      mbedtls_aes_crypt_ecb
//      mbedtls_aes_crypt_cbc
word32 mbedtls_aes_decrypt(Eq_2 a1, Eq_2 a2, Eq_2 a5, word32 dwArg3C, Eq_2 dwArg0148, byte & s1Out, byte & s2Out, byte & s3Out, ptr32 & s4Out, byte & s5Out, byte & s6Out, union Eq_527566 & s7Out, ptr32 & s8Out, union Eq_527568 & s9Out, union Eq_527569 & s10Out, union Eq_527570 & s11Out)
{
	struct Eq_527571 * a4_58 = (word32) *((word32) a1 + 0x0A) << 16 | ((word32) (*((word32) a1 + 9)) << 8 | (word32) (*((word32) a1 + 8)));
	struct Eq_527590 * a4_39 = (word32) *((word32) a1 + 6) << 16 | ((word32) (*((word32) a1 + 5)) << 8 | (word32) (*((word32) a1 + 4)));
	struct Eq_527609 * a5_64 = a4_58->ptr0008;
	uint32 s10_257 = ((word32) *((word32) a1 + 7) << 24 | a4_39) ^ a4_39;
	struct Eq_527622 * t5_106 = a4_39->dw0004 + 16;
	uint32 s9_117 = ((word32) *((word32) a1 + 11) << 24 | a4_58) ^ a4_58;
	uint32 s5_273 = ((word32) *((word32) a1 + 3) << 24 | ((word32) (*((word32) a1 + 2)) << 16 | ((word32) (*((word32) a1 + 1)) << 8 | (word32) (*a1)))) ^ a5_64->dw0000;
	uint32 s8_111 = ((word32) *((word32) a1 + 0x0F) << 24 | ((word32) (*((word32) a1 + 0x0E)) << 16 | ((word32) (*((word32) a1 + 0x0D)) << 8 | (word32) (*((word32) a1 + 0x0C))))) ^ a5_64->dw000C;
	Eq_527566 s7_213 = (**((word32) a5 + 4) >> 0x01) + ~0x00;
	while (true)
	{
		uint32 a1_129 = a1 ^ g_a4201E50C[(s10_257 >> 0x18) * 0x04] ^ t5_106->dw0000 ^ (s8_111 >> 0x06 & 1020)->dw4201DD0C ^ (s9_117 >> 0x0E & 1020)->dw4201E10C;
		int32 s11_138 = t5_106->dw0010;
		uint32 a5_154 = g_a4201D90C[(s8_111 & 0x00FF) * 0x04] ^ g_a4201E50C[(s5_273 >> 0x18) * 0x04] ^ t5_106->dw000C ^ (s9_117 >> 0x06 & 1020)->dw4201DD0C ^ (s10_257 >> 0x0E & 1020)->dw4201E10C;
		uint32 a3_179 = g_a4201D90C[(s9_117 & 0x00FF) * 0x04] ^ g_a4201E50C[(s8_111 >> 0x18) * 0x04] ^ t5_106->dw0008 ^ (s10_257 >> 0x06 & 1020)->dw4201DD0C ^ (s5_273 >> 0x0E & 1020)->dw4201E10C;
		uint32 a4_195 = g_a4201D90C[(s10_257 & 0x00FF) * 0x04] ^ g_a4201E50C[(s9_117 >> 0x18) * 0x04] ^ t5_106->dw0004 ^ (s5_273 >> 0x06 & 1020)->dw4201DD0C ^ (s8_111 >> 0x0E & 1020)->dw4201E10C;
		int32 s10_203 = t5_106->dw0014;
		int32 s9_205 = t5_106->dw0018;
		int32 s8_208 = t5_106->dw001C;
		if (s7_213 <= 0x00)
			break;
		a1 = g_a4201E50C[(a1_129 >> 24) * 0x04];
		ui32 a5_253 = g_a4201D90C[(a5_154 & 0x00FF) * 0x04] ^ a1;
		s10_257 = g_a4201D90C[(a4_195 & 0x00FF) * 0x04] ^ g_a4201E50C[(a3_179 >> 0x18) * 0x04] ^ s10_203 ^ g_a4201DD0C[(a1_129 >> 0x08 & 0x00FF) * 0x04] ^ g_a4201E10C[(a5_154 >> 0x10 & 0x00FF) * 0x04];
		s5_273 = g_a4201D90C[(a1_129 & 0x00FF) * 0x04] ^ g_a4201E50C[(a4_195 >> 0x18) * 0x04] ^ s11_138 ^ g_a4201DD0C[(a5_154 >> 0x08 & 0x00FF) * 0x04] ^ g_a4201E10C[(a3_179 >> 0x10 & 0x00FF) * 0x04];
		s9_117 = g_a4201D90C[(a3_179 & 0x00FF) * 0x04] ^ g_a4201E50C[(a5_154 >> 0x18) * 0x04] ^ s9_205 ^ g_a4201DD0C[(a4_195 >> 0x08 & 0x00FF) * 0x04] ^ g_a4201E10C[(a1_129 >> 0x10 & 0x00FF) * 0x04];
		++t5_106;
		s8_111 = a5_253 ^ s8_208 ^ a5_253 ^ a5_253;
		s7_213 = (word32) s7_213.u0 - 1;
	}
	byte * s6_280 = (a1_129 & 0x00FF) + 1107417100;
	byte * s5_289 = (a4_195 >> 0x18) + 1107417100;
	byte * s3_309 = (a3_179 >> 0x18) + 1107417100;
	byte * s2_318 = (a3_179 & 0x00FF) + 1107417100;
	byte * s1_332 = (a5_154 >> 0x18) + 1107417100;
	uint32 s11_299 = (word32) (a5_154 >> 0x08 & 0x00FF)->b4201D80C << 8 ^ ((word32) (*s6_280) ^ s11_138) ^ (word32) (a3_179 >> 0x10 & 0x00FF)->b4201D80C << 16 ^ (word32) (*s5_289) << 24;
	uint32 s10_321 = (word32) (a1_129 >> 0x08 & 0x00FF)->b4201D80C << 8 ^ ((word32) (a4_195 & 0x00FF)->b4201D80C ^ s10_203) ^ (word32) (a5_154 >> 0x10 & 0x00FF)->b4201D80C << 16 ^ (word32) (*s3_309) << 24;
	ui32 s9_334 = (word32) (a4_195 >> 0x08 & 0x00FF)->b4201D80C << 8 ^ ((word32) (*s2_318) ^ s9_205) ^ (word32) (a1_129 >> 0x10 & 0x00FF)->b4201D80C << 16;
	ui32 a0_336 = (word32) *s1_332;
	uint32 s8_337 = (word32) (a5_154 & 0x00FF)->b4201D80C ^ s8_208 ^ (word32) (a3_179 >> 8 & 0x00FF)->b4201D80C << 8 ^ (word32) (a4_195 >> 16 & 0x00FF)->b4201D80C << 16 ^ (word32) (a1_129 >> 24)->b4201D80C << 24;
	*((word32) a2 + 1) = (byte) (s11_299 >> 0x08);
	*((word32) a2 + 2) = (byte) (s11_299 >> 0x10);
	*((word32) a2 + 5) = (byte) (s10_321 >> 0x08);
	*((word32) a2 + 6) = (byte) (s10_321 >> 0x10);
	uint32 s9_346 = s9_334 ^ a0_336 << 24;
	*((word32) a2 + 9) = (byte) (s9_346 >> 0x08);
	*((word32) a2 + 0x0A) = (byte) (s9_346 >> 0x10);
	*a2 = (byte) s11_299;
	*((word32) a2 + 4) = (byte) s10_321;
	*((word32) a2 + 8) = (byte) s9_346;
	*((word32) a2 + 0x0C) = (byte) s8_337;
	*((word32) a2 + 0x0D) = (byte) (s8_337 >> 0x08);
	*((word32) a2 + 3) = (byte) (s11_299 >> 0x18);
	*((word32) a2 + 7) = (byte) (s10_321 >> 0x18);
	*((word32) a2 + 11) = (byte) (s9_346 >> 0x18);
	*((word32) a2 + 0x0F) = (byte) (s8_337 >> 0x18);
	*((word32) a2 + 0x0E) = (byte) (s8_337 >> 0x10);
	0x00 = (int8) dwArg0148;
	0x00 = dwArg3C;
	s1Out = s1_332;
	s2Out = s2_318;
	s3Out = s3_309;
	s4Out = dwArg98;
	s5Out = s5_289;
	s6Out = s6_280;
	s7Out = s7_213;
	s8Out = dwArg78;
	s9Out = s9_346 >> 0x18;
	s10Out = s10_321 >> 0x18;
	s11Out = s11_299 >> 0x18;
	return dwLoc04;
}

// 23091410: Register Eq_527197 mbedtls_aes_crypt_ecb(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Stack word32 dwArg2C, Stack Eq_2 dwArg0138, Register out (ptr32 (arr byte)) s1Out, Register out Eq_492619 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      block_cipher_df
//      ctr_drbg_update_internal
//      mbedtls_ctr_drbg_random
//      mbedtls_aes_crypt_cbc
//      aes_crypt_ecb_wrap
Eq_527197 mbedtls_aes_crypt_ecb(Eq_2 a1, Eq_2 a2, Eq_2 a3, word32 dwArg2C, Eq_2 dwArg0138, byte (& s1Out, union Eq_492619 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 s9_32;
	ptr32 s8_31;
	ptr32 s7_30;
	ptr32 s6_29;
	ptr32 s5_28;
	ptr32 s4_27;
	ptr32 s3_26;
	Eq_492619 s2_25;
	ptr32 s11_24;
	ptr32 s10_23;
	byte (* s1_22)[];
	Eq_527197 s0_21;
	if (a1 == 0x01)
	{
		word32 a3_117;
		word32 a4_118;
		word32 a5_119;
		word32 a6_120;
		s0_21 = mbedtls_aes_encrypt(a2, a3, 0x01, dwArg2C, dwArg0138, out s1_22, out a3_117, out a4_118, out a5_119, out a6_120, out s2_25, out s3_26, out s4_27, out s5_28, out s6_29, out s7_30, out s8_31, out s9_32, out s10_23, out s11_24);
	}
	else
		s0_21 = mbedtls_aes_decrypt(a2, a3, a2, dwArg2C, dwArg0138, out s1_22, out s2_25, out s3_26, out s4_27, out s5_28, out s6_29, out s7_30, out s8_31, out s9_32, out s10_23, out s11_24);
	s1Out = s1_22;
	s2Out = s2_25;
	s3Out = s3_26;
	s4Out = s4_27;
	s5Out = s5_28;
	s6Out = s6_29;
	s7Out = s7_30;
	s8Out = s8_31;
	s9Out = s9_32;
	s10Out = s10_23;
	s11Out = s11_24;
	return s0_21;
}

