pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23091434: Register word32 mbedtls_aes_crypt_cbc(Register Eq_2 a1, Register ui32 a2, Register Eq_2 a3, Register ptr32 a4, Register ptr32 a5, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0198, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out ptr32 a4Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      aes_crypt_cbc_wrap
//      pem_aes_decrypt
word32 mbedtls_aes_crypt_cbc(Eq_2 a1, ui32 a2, Eq_2 a3, ptr32 a4, ptr32 a5, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0198, union Eq_2 & s1Out, union Eq_2 & a1Out, ptr32 & a4Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ui32 s0_115 = a2 & 0x0F;
	if ((a2 & 0x0F) == 0x00)
	{
		ptr32 s4_121 = a5;
		ptr32 s5_119 = a4;
		s1 = a3;
		ui32 s2_117 = a2;
		s7 = a1;
		int32 s8_223 = 0x10;
		if (a1 == 0x00)
		{
			while (true)
			{
				s7 = s5_119 - s0_115;
				Eq_2 s3_122 = s4_121 - s0_115;
				if (s0_115 + s2_117 == 0x00)
					break;
				Eq_2 a5_128;
				word32 a1_407;
				word32 a2_408;
				word32 a3_409;
				word32 a4_410;
				word32 a6_411;
				word32 a7_412;
				memcpy(fp + -64, s7, 0x10, out a1_407, out a2_408, out a3_409, out a4_410, out a5_128, out a6_411, out a7_412);
				word32 s3_158;
				word32 s6_413;
				word32 s7_414;
				word32 s8_415;
				Eq_527197 s0_153 = mbedtls_aes_decrypt(s7, s3_122, a5_128, dwLoc04, dwArg0108, out s1, out s2_117, out s3_158, out s4_121, out s5_119, out s6_413, out s7_414, out s8_415, out s9, out s10, out s11);
				int32 a3_173;
				for (a3_173 = 0x00; a3_173 != 0x10; ++a3_173)
				{
					byte * a4_177 = s3_158 + a3_173;
					*a4_177 = (byte) ((word32) *((word32) s1 + a3_173) ^ (word32) (*a4_177));
				}
				word32 a2_416;
				word32 a3_417;
				word32 a5_418;
				word32 a6_419;
				word32 a7_420;
				memcpy(s1, fp + -64, 0x10, out a1, out a2_416, out a3_417, out a4, out a5_418, out a6_419, out a7_420);
				s0_115 = (word32) s0_153 - 16;
			}
		}
		else
		{
			while (true)
			{
				a4 = s5_119 - s0_115;
				Eq_2 s3_45 = s4_121 - s0_115;
				if (s2_117 + s0_115 == 0x00)
					break;
				int32 a3_46 = 0x00;
				do
				{
					*((word32) s3_45 + a3_46) = (byte) ((word32) (a4 + a3_46) ^ (word32) (*((word32) s1 + a3_46)));
					++a3_46;
				} while (a3_46 != s8_223);
				Eq_2 s3_84;
				word32 s6_421;
				Eq_2 s0_79 = mbedtls_aes_crypt_ecb(s7, s3_45, s3_45, dwLoc14, dwArgF8, out s1, out s2_117, out s3_84, out s4_121, out s5_119, out s6_421, out s7, out s8_223, out s9, out s10, out s11);
				word32 a2_422;
				word32 a3_423;
				word32 a4_424;
				word32 a5_425;
				word32 a6_426;
				word32 a7_427;
				memcpy(s1, s3_84, 0x10, out a1, out a2_422, out a3_423, out a4_424, out a5_425, out a6_426, out a7_427);
				s0_115 = (word32) s0_79 - 16;
			}
		}
	}
	0x00 = dwArg0198;
	s1Out = s1;
	a1Out = a1;
	a4Out = a4;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return dwArg0158;
}

// 2309151A: void mbedtls_aes_crypt_cfb128(Register Eq_527197 s0, Register word32 a1, Register word32 a2, Register (ptr32 Eq_527197) a3, Register Eq_2 a4, Register (ptr32 Eq_528454) a5, Register (ptr32 Eq_528455) a6, Stack word32 dwArg1C, Stack word32 dwArgA8, Stack Eq_2 dwArg0128)
// Called from:
//      aes_crypt_cfb128_wrap
void mbedtls_aes_crypt_cfb128(Eq_527197 s0, word32 a1, word32 a2, union Eq_527197 * a3, Eq_2 a4, struct Eq_528454 * a5, struct Eq_528455 * a6, word32 dwArg1C, word32 dwArgA8, Eq_2 dwArg0128)
{
	union Eq_527197 * s6_132 = a3;
	Eq_2 s2_109 = a4;
	struct Eq_528454 * s3_129 = a5;
	struct Eq_528455 * s1_125 = a6;
	struct Eq_528455 * s4_130 = a6 + a2;
	if (a1 != 0x00)
	{
		while (s1_125 != s4_130)
		{
			if (s0 == 0x00)
			{
				word32 a3_313;
				word32 a4_314;
				word32 a5_315;
				word32 a6_316;
				word32 s5_317;
				word32 s7_318;
				word32 s8_319;
				word32 s9_320;
				word32 s10_321;
				word32 s11_322;
				s0 = mbedtls_aes_encrypt(s2_109, s2_109, a4, dwArg1C, dwArg0128, out s1_125, out a3_313, out a4_314, out a5_315, out a6_316, out s2_109, out s3_129, out s4_130, out s5_317, out s6_132, out s7_318, out s8_319, out s9_320, out s10_321, out s11_322);
			}
			a4 = s2_109 + s0;
			++s3_129;
			++s1_125;
			ui32 a5_156 = (word32) *a4 ^ (word32) s3_129->bFFFFFFFF;
			s1_125[0x0FFF] = (struct Eq_528455) (byte) a5_156;
			*a4 = (byte) a5_156;
			s0 = (word32) s0.u0 + 1 & 0x0F;
		}
	}
	else
	{
		while (s1_125 != s4_130)
		{
			if (s0 == 0x00)
			{
				word32 a3_323;
				word32 a4_324;
				word32 a5_325;
				word32 a6_326;
				word32 s5_327;
				word32 s7_328;
				word32 s8_329;
				word32 s9_330;
				word32 s10_331;
				word32 s11_332;
				s0 = mbedtls_aes_encrypt(s2_109, s2_109, a4, dwArg1C, dwArg0128, out s1_125, out a3_323, out a4_324, out a5_325, out a6_326, out s2_109, out s3_129, out s4_130, out s5_327, out s6_132, out s7_328, out s8_329, out s9_330, out s10_331, out s11_332);
			}
			++s3_129;
			a4 = s2_109 + s0;
			word32 a3_80 = (word32) s3_129->bFFFFFFFF;
			++s1_125;
			s1_125[0x0FFF] = (struct Eq_528455) (byte) ((word32) *a4 ^ a3_80);
			*a4 = (byte) a3_80;
			s0 = (word32) s0.u0 + 1 & 0x0F;
		}
	}
	*s6_132 = (union Eq_527197 *) s0;
	0x00 = dwArgA8;
}

// 230915B6: void mbedtls_aes_crypt_ctr(Register (ptr32 word32) s0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_528589) a5, Register (ptr32 Eq_528590) a6, Stack word32 dwArg0C, Stack word32 dwArg74, Stack (ptr32 word32) dwArgB4, Stack Eq_2 dwArg0118, Stack word32 dwArg0128)
// Called from:
//      aes_crypt_ctr_wrap
void mbedtls_aes_crypt_ctr(word32 * s0, word32 a1, Eq_2 a3, Eq_2 a4, struct Eq_528589 * a5, struct Eq_528590 * a6, word32 dwArg0C, word32 dwArg74, word32 * dwArgB4, Eq_2 dwArg0118, word32 dwArg0128)
{
	word32 s1_100 = *s0;
	struct Eq_528590 * s2_111 = a6 + a1;
	while (a6 != s2_111)
	{
		if (s0 == null)
		{
			Eq_2 s4_54;
			word32 s9_239;
			word32 s10_240;
			word32 s11_241;
			word32 s8_238;
			word32 s7_237;
			word32 s6_236;
			word32 s5_235;
			word32 s3_234;
			mbedtls_aes_encrypt(a3, a4, a4, dwArg0C, dwArg0118, out s1_100, out a3, out a4, out a5, out a6, out s2_111, out s3_234, out s4_54, out s5_235, out s6_236, out s7_237, out s8_238, out s9_239, out s10_240, out s11_241);
			0x00 = dwArg74;
			s0 = dwArgB4;
			Eq_2 a1_71 = s4_54;
			while (true)
			{
				ui32 a2_76 = (word32) *a1_71 + 0x01 & 0x00FF;
				*a1_71 = (byte) a2_76;
				if (a2_76 != 0x00)
					break;
				Eq_2 a2_78 = (word32) a1_71 - 1;
				if (a3 == a1_71)
					break;
				a1_71 = a2_78;
			}
		}
		++a5;
		++a6;
		Mem98[a6 + 0x0FFF:byte] = SLICE(CONVERT(Mem89[a4 + s0:byte], byte, word32) ^ CONVERT(Mem89[a5 + -1:byte], byte, word32), byte, 0);
		s0 = s0 + 0x01 & 0x0F;
	}
	*s0 = s1_100;
	0x00 = dwArg0128;
}

// 23091640: Register int32 mbedtls_asn1_get_len(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_525515 a3Out, Register out Eq_525516 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
//      mbedtls_asn1_get_tag
//      mbedtls_asn1_get_alg
//      mbedtls_x509_get_serial
//      mbedtls_x509_get_name
int32 mbedtls_asn1_get_len(Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_525515 & a3Out, union Eq_525516 & a4Out, union Eq_2 & a5Out)
{
	int32 a0_67;
	Eq_2 a0_5 = *a5;
	Eq_525515 a3_31 = a1 - a5;
	if (a3_31 <= 0x00)
	{
l23091672:
		a0_67 = -96;
l23091676:
		a1Out = a1;
		a2Out = a2;
		a3Out = a3_31;
		a4Out = a4;
		a5Out = a5;
		return a0_67;
	}
	else
	{
		ui32 a4_8 = (word32) *a5;
		if ((int32) (byte) a4_8 >= 0x00)
		{
			*((word32) a5 + 1) = a0_5;
			a5 = (word32) *a5;
			*a5 = a2;
			a4 = (word32) a5 + 1;
			goto l23091666;
		}
		Eq_2 a0_24;
		a4 = a4_8 & 0x007F;
		if ((a4_8 & 0x007F) != 0x02)
		{
			if ((a4_8 & 0x007F) <= 0x02)
			{
				if ((a4_8 & 0x007F) != 0x01)
					goto l2309168C;
				if (a3_31 != (a4_8 & 0x007F))
				{
					union Eq_2 * a5_52 = (word32) *((word32) a5 + 1);
					*a5_52 = (union Eq_2 *) a2;
					a0_24 = *a5_52;
					a5 = (char *) a5_52 + 2;
					goto l230916D4;
				}
				goto l23091672;
			}
			if ((a4_8 & 0x007F) != 0x03)
			{
				if ((a4_8 & 0x007F) != 0x04)
				{
l2309168C:
					a1Out = a1;
					a2Out = a2;
					a3Out = a3_31;
					a4Out = a4_8 & 0x007F;
					a5Out = a5;
					return -100;
				}
				if ((a4_8 & 0x007F) < a3_31)
				{
					a3_31 = (word32) *((word32) a5 + 4);
					a4 = (word32) *((word32) a5 + 1) << 24 | (word32) (*((word32) a5 + 2)) << 16 | a3_31;
					union Eq_2 * a5_47 = (word32) *((word32) a5 + 3) << 8 | a4;
					*a5_47 = (union Eq_2 *) a2;
					a0_24 = *a5_47;
					a5 = (char *) a5_47 + 5;
					goto l230916D4;
				}
				goto l23091672;
			}
			if ((a4_8 & 0x007F) >= a3_31)
				goto l23091672;
			ui32 a3_28 = (word32) *((word32) a5 + 2);
			a4 = (word32) *((word32) a5 + 1) << 16 | a3_28 << 8;
			union Eq_2 * a5_33 = (word32) *((word32) a5 + 3) | a4;
			*a5_33 = (union Eq_2 *) a2;
			a3_31 = a3_28 << 8;
			a0_24 = *a5_33;
			a5 = (char *) a5_33 + 4;
		}
		else
		{
			if ((a4_8 & 0x007F) >= a3_31)
				goto l23091672;
			uint32 a5_16 = (word32) *((word32) a5 + 2) << 8 | (word32) (*((word32) a5 + 1));
			union Eq_2 * a5_21 = (word32) (word16) (a5_16 >> 8 | a5_16 << 0x08);
			*a5_21 = (union Eq_2 *) a2;
			a4 = a5_16 << 0x08;
			a0_24 = *a5_21;
			a5 = (char *) a5_21 + 3;
		}
l230916D4:
		*a5 = a0_24;
l23091666:
		a0_67 = 0x00;
		a1 -= a5;
		a2 = *a5;
		if (a1 >= a5)
			goto l23091676;
		goto l23091672;
	}
}

// 2309171C: Register Eq_2 mbedtls_asn1_get_tag(Register Eq_2 a1, Register Eq_2 a2, Register Eq_494119 a3, Register Eq_2 a5, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_494119 a3Out, Register out (ptr32 Eq_494124) a4Out, Register out Eq_2 a5Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      pk_parse_key_sec1_der
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_rsa_pkcs1_verify
//      mbedtls_x509_crt_parse_der
//      mbedtls_asn1_get_bool
//      mbedtls_asn1_get_int
//      mbedtls_asn1_get_mpi
//      mbedtls_asn1_get_bitstring
//      mbedtls_asn1_get_bitstring_null
//      mbedtls_asn1_get_sequence_of
//      mbedtls_asn1_get_alg
//      mbedtls_x509_get_name
//      mbedtls_x509_get_ext
Eq_2 mbedtls_asn1_get_tag(Eq_2 a1, Eq_2 a2, Eq_494119 a3, Eq_2 a5, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_494119 & a3Out, struct Eq_494124 & a4Out, union Eq_2 & a5Out)
{
	Eq_528851 a0_5 = *a5;
	if (a1 - a5 <= 0x00)
	{
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return -96;
	}
	else if ((word32) *a5 != a3)
	{
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return -98;
	}
	else
	{
		*((word32) a5 + 1) = a0_5;
		Eq_494119 a3_16;
		Eq_2 a1_17;
		Eq_2 a2_18;
		struct Eq_494124 * a4_19;
		Eq_2 a5_20;
		Eq_2 a0_15 = mbedtls_asn1_get_len(a1, a2, (word32) a5 + 1, out a1_17, out a2_18, out a3_16, out a4_19, out a5_20);
		a1Out = a1_17;
		a2Out = a2_18;
		a3Out = a3_16;
		a4Out = a4_19;
		a5Out = a5_20;
		return a0_15;
	}
}

// 23091742: Register (ptr32 Eq_525256) mbedtls_asn1_get_bool(Register Eq_2 a1, Register (ptr32 Eq_525256) a2, Register Eq_2 a5, Register out (ptr32 Eq_525256) s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_525261 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
union Eq_525256 * mbedtls_asn1_get_bool(Eq_2 a1, union Eq_525256 * a2, Eq_2 a5, union Eq_525256 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_525261 & a5Out)
{
	union Eq_525256 * s0_15 = a0;
	ptr32 a1_20;
	word32 a4_23;
	word32 a2_64;
	word32 a3_65;
	Eq_525261 a5_24;
	Eq_2 a0_18 = mbedtls_asn1_get_tag(a1, fp + ~0x13, 0x01, a5, out a1_20, out a2_64, out a3_65, out a4_23, out a5_24);
	if (a0_18 == 0x00)
	{
		a5_24.u0 = 0x01;
		if (a4_23 == 0x01)
		{
			struct Eq_528909 * a5_30 = (word32) ((word32) *(union Eq_2 *) 0x01 != 0x00);
			a5_30->ptr0000 = a2;
			s0_15 = a5_30->ptr0000;
			a5_30->ptr0001 = s0_15;
			a5_24 = &a5_30->ptr0001;
		}
		else
			a0_18.u0 = -100;
	}
	s1Out = a2;
	a0Out = a0_18;
	a1Out = a1_20;
	a5Out = a5_24;
	return s0_15;
}

// 23091782: Register Eq_2 mbedtls_asn1_get_int(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 byte) a4Out, Register out Eq_494151 a5Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      pk_parse_key_sec1_der
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_asn1_get_int(Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, byte & a4Out, union Eq_494151 & a5Out)
{
	Eq_2 s1_39 = a2;
	Eq_2 s0_15 = a0;
	ptr32 a1_20;
	ptr32 a3_22;
	word32 a2_102;
	byte * a4_23;
	Eq_494151 a5_24;
	Eq_2 a0_18 = mbedtls_asn1_get_tag(a1, fp + ~0x13, 0x02, a5, out a1_20, out a2_102, out a3_22, out a4_23, out a5_24);
	if (a0_18 != 0x00)
	{
l230917BA:
		s1Out = s1_39;
		a0Out = a0_18;
		a1Out = a1_20;
		a3Out = a3_22;
		a4Out = a4_23;
		a5Out = a5_24;
		return s0_15;
	}
	else
	{
		a4_23 = (byte *) 0x03;
		a5_24 = (char *) a5_24.u2 - 1;
		if (a5_24 <= ~0x03)
		{
			s0_15 = *((word32) a5_24 - 1);
			a5_24 = (int32) *((word32) a5_24 - 1);
			if (a5_24 >= 0x00)
			{
				*a2 = 0x00;
				while (true)
				{
					a4_23 = (word32) a5_24 - 1;
					if (a5_24 == 0x00)
						break;
					s1_39 = *a5_24;
					struct Eq_528969 * a5_42 = a5_24 << 8 | (word32) (*a4_23);
					a5_42->t0000 = s1_39;
					s0_15 = a5_42->t0000;
					a5_42->t0001 = s0_15;
					a5_24 = &a5_42->t0001;
				}
				goto l230917BA;
			}
		}
		a0_18.u0 = -100;
		goto l230917BA;
	}
}

// 230917E0: Register Eq_2 mbedtls_asn1_get_mpi(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg64, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out (ptr32 ptr32) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2) s3Out, Register out (ptr32 Eq_494198) s4Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      mbedtls_pk_parse_subpubkey
Eq_2 mbedtls_asn1_get_mpi(Eq_2 ra, Eq_2 a1, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg64, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, struct Eq_494198 & s4Out)
{
	ptr32 s1_39 = a2;
	ptr32 s0_15 = a0;
	Eq_2 a3_22;
	ptr32 a2_21;
	Eq_2 a1_20;
	Eq_2 a4_23;
	ptr32 * a5_24;
	Eq_2 a0_18 = mbedtls_asn1_get_tag(a1, fp + ~0x13, 0x02, a5, out a1_20, out a2_21, out a3_22, out a4_23, out a5_24);
	if (a0_18 == 0x00)
	{
		ptr32 * a5_34;
		word32 s0_118;
		word32 a2_119;
		word32 a3_120;
		word32 a7_121;
		word32 s4_122;
		word32 s8_123;
		ra = mbedtls_mpi_read_binary(ra, a1_20, dwArg64, a3_22, a4_23, mstatus, dwLoc18, dwLoc08, dwArgB8, dwArgC8, dwArgF8, dwArg0108, dwArg0138, dwArg0148, out s0_118, out s1_39, out a0_18, out a1_20, out a2_119, out a3_120, out a4_23, out a5_34, out a7_121, out s2, out s3, out s4_122, out s8_123);
		s0_15 = *a5_34;
		a5_24 = a5_34 + a4_23;
		*a5_24 = s0_15;
		a2_21 = dwArgA4;
	}
	s0Out = s0_15;
	s1Out = s1_39;
	a0Out = a0_18;
	a1Out = a1_20;
	a2Out = a2_21;
	a4Out = a4_23;
	a5Out = a5_24;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	return ra;
}

// 23091812: Register Eq_2 mbedtls_asn1_get_bitstring(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out Eq_525373 a5Out, Register out Eq_2 s2Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_asn1_get_bitstring(Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a4Out, union Eq_525373 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 s1_14 = a0;
	ptr32 a1_22;
	word32 a2_75;
	word32 a3_76;
	ptr32 a4_25;
	Eq_525373 a5_26;
	Eq_2 a0_20 = mbedtls_asn1_get_tag(a1, a2, 0x03, a5, out a1_22, out a2_75, out a3_76, out a4_25, out a5_26);
	if (a0_20 == 0x00)
	{
		Eq_2 s0_27 = *a5_26;
		if (a5_26 != 0x00)
		{
			*((word32) a5_26 - 1) = s0_27;
			s1_14 = *((word32) a5_26 - 1);
			a5_26 = (word32) *((word32) a5_26 - 1);
			*((word32) s0_27 + 4) = (byte) a5_26;
			a4_25 = 0x07;
			if (a5_26 <= 0x07)
			{
				s1_14 = *a5_26;
				*((word32) a5_26 + 1) = s1_14;
				*((word32) a5_26 + 9) = *(union Eq_2 *) 0x07;
				*((word32) a5_26 + 8) = s1_14;
				a5_26 = (word32) a5_26 + 8;
				if ((word32) a5_26 + 8 != a1)
					a0_20.u0 = -0x0066;
			}
			else
				a0_20.u0 = -100;
		}
		else
			a0_20.u0 = -96;
	}
	0x00 = (int8) dwArg38;
	a0Out = a0_20;
	a1Out = a1_22;
	a2Out = dwArg10;
	a4Out = a4_25;
	a5Out = a5_26;
	s2Out = a1;
	return s1_14;
}

// 23091870: Register Eq_2 mbedtls_asn1_get_bitstring_null(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 word32) a4Out, Register out (ptr32 Eq_494833) a5Out)
// Called from:
//      pk_parse_key_sec1_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_x509_get_sig
Eq_2 mbedtls_asn1_get_bitstring_null(Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, word32 & a4Out, struct Eq_494833 & a5Out)
{
	Eq_2 s1_14 = a2;
	ptr32 a1_19;
	ptr32 a3_21;
	word32 a2_71;
	word32 * a4_22;
	struct Eq_494833 * a5_23;
	Eq_2 a0_17 = mbedtls_asn1_get_tag(a1, a2, 0x03, a5, out a1_19, out a2_71, out a3_21, out a4_22, out a5_23);
	if (a0_17 == 0x00)
	{
		s1_14 = a5_23->t0000;
		a5_23->tFFFFFFFF = s1_14;
		a4_22 = (word32 *) 0x01;
		if (a5_23 <= (struct Eq_494833 *) 0x01)
		{
l230918A0:
			a0_17.u0 = -0x0068;
			goto l230918A4;
		}
		a5_23->t0001 = a5_23->t0000;
		a4_22 = (word32 *) &a5_23->t0001;
		a5_23 = (word32) a5_23->t0000;
		if (a5_23 != null)
			goto l230918A0;
	}
l230918A4:
	a0Out = a0_17;
	a1Out = a1_19;
	a2Out = dwArg10;
	a3Out = a3_21;
	a4Out = a4_22;
	a5Out = a5_23;
	return s1_14;
}

// 230918AE: Register Eq_2 mbedtls_asn1_get_sequence_of(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_494119 a3, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_asn1_get_sequence_of(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_494119 a3, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s5Out)
{
	int32 a4_34;
	word32 a2_212;
	word32 a3_213;
	ptr32 a1_170;
	Eq_2 a5_114;
	Eq_2 a0_29 = mbedtls_asn1_get_tag(a1, fp + -36, 48, a5, out a1_170, out a2_212, out a3_213, out a4_34, out a5_114);
	Eq_2 s0_40 = a2;
	Eq_494119 s4_11 = a3;
	Eq_2 s1_190 = a0;
	Eq_2 s3_116 = a1;
	Eq_2 s2_105 = a0_29;
	if (a0_29 == 0x00)
	{
		s1_190 = *a5_114;
		a5_114 = (word32) a5_114 + a4_34;
		if (a1 != a5_114)
		{
l230918DE:
			s2_105.u0 = -0x0066;
		}
		else
		{
			do
			{
				s5 = (word32) s0_40 + 4;
				do
				{
					s1_190 = *a5_114;
					if (a5_114 >= s3_116)
					{
						((word32) s0_40 + 0x0C)->u0 = 0x00;
						s1_190 = *a5_114;
						if (a5_114 == s3_116)
							goto l23091928;
						goto l230918DE;
					}
					Eq_2 a5_46 = (word32) *a5_114;
					*a5_46 = s0_40;
					Eq_2 a3_59;
					Eq_2 a4_60;
					word32 a2_214;
					Eq_2 a0_55 = mbedtls_asn1_get_tag(s3_116, s5, s4_11, a5_46, out a1_170, out a2_214, out a3_59, out a4_60, out a5_114);
					if (a0_55 != 0x00)
					{
						s2_105 = a0_55;
						goto l23091928;
					}
					Eq_2 s1_63 = *a5_114;
					s0_40 = *((word32) a4_60 + 4);
					*((word32) a5_114 + 8) = s0_40;
					a5_114 += a4_60;
					*a5_114 = s1_63;
				} while (a5_114 >= s3_116);
				Eq_2 s0_83;
				word32 a2_215;
				word32 a3_216;
				word32 a4_217;
				word32 s8_218;
				ra = mycalloc(ra, s1_63, 0x01, 0x10, a3_59, a4_60, a5_114, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out s0_83, out s1_190, out a1_170, out a2_215, out a3_216, out a4_217, out a5_114, out s2_105, out s3_116, out s4_11, out s8_218);
				*(union Eq_2 *) 0x0D = s0_83;
				s0_40.u0 = 0x01;
			} while (true);
			s2_105.u0 = -0x006A;
		}
	}
l23091928:
	0x00 = (int8) dwArg0128;
	s1Out = s1_190;
	a0Out = s2_105;
	a1Out = a1_170;
	a5Out = a5_114;
	s2Out = s2_105;
	s5Out = s5;
	return ra;
}

// 23091946: Register Eq_2 mbedtls_asn1_get_alg(Register Eq_2 a1, Register (ptr32 Eq_495055) a2, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArgB4, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_495064) a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out (ptr32 Eq_495055) s4Out)
// Called from:
//      pk_get_pk_alg
//      mbedtls_x509_get_alg
Eq_2 mbedtls_asn1_get_alg(Eq_2 a1, struct Eq_495055 * a2, Eq_2 a3, Eq_2 a5, Eq_2 dwArgB4, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_495064 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, struct Eq_495055 & s4Out)
{
	word32 a2_147;
	Eq_2 a5_130;
	struct Eq_495064 * a4_128;
	ptr32 a3_126;
	ptr32 a1_124;
	Eq_2 a0_27 = mbedtls_asn1_get_tag(a1, fp + -36, 48, a5, out a1_124, out a2_147, out a3_126, out a4_128, out a5_130);
	Eq_2 s1_133 = a3;
	Eq_2 s3_134 = a1;
	Eq_2 s2_34 = a0_27;
	if (a0_27 == 0x00)
	{
		Eq_529288 s0_35 = *a5_130;
		s2_34.u0 = -96;
		s3_134 = a1 - a5_130;
		if (s3_134 > 0x00)
		{
			Eq_2 a5_38 = (word32) *a5_130;
			a2->t0000 = a5_38;
			s3_134 = Mem40[s0_35 + 0x00:int32] + a5_38;
			word32 a2_148;
			Eq_2 a0_46 = mbedtls_asn1_get_tag(s3_134, dwArgB4, 0x06, a5_38, out a1_124, out a2_148, out a3_126, out a4_128, out a5_130);
			s2_34 = a0_46;
			if (a0_46 == 0x00)
			{
				Eq_529288 s0_54 = *a5_130;
				a4_128 = a2->ptr0004;
				a2->t0008 = a5_130;
				word32 a5_57 = a5_130 + a4_128;
				*a5_57 = s0_54;
				if (a5_57 == s3_134)
				{
					a5_130 = (word32) a3 + 0x0C;
					while (s1_133 != (word32) a3 + 0x0C)
					{
						*s1_133 = 0x00;
						s1_133 = (word32) s1_133 + 1;
					}
				}
				else
				{
					struct Eq_529336 * a5_59 = (word32) *a5_57;
					a5_59->t0000 = a3;
					a5_59->t0001 = a5_59->t0000;
					word32 a2_149;
					Eq_2 a0_67 = mbedtls_asn1_get_len(s3_134, (word32) a3 + 4, &a5_59->t0001, out a1_124, out a2_149, out a3_126, out a4_128, out a5_130);
					if (a0_67 == 0x00)
					{
						Eq_529288 s0_75 = *a5_130;
						s1_133 = a4_128->t0004;
						*((word32) a5_130 + 8) = s1_133;
						a5_130 += a4_128;
						*a5_130 = s0_75;
						if (a5_130 != s3_134)
							s2_34.u0 = -0x0066;
					}
					else
						s2_34 = a0_67;
				}
			}
		}
	}
	0x00 = (int8) dwArg0128;
	a0Out = s2_34;
	a1Out = a1_124;
	a2Out = dwArg0100;
	a3Out = a3_126;
	a4Out = a4_128;
	a5Out = a5_130;
	s2Out = s2_34;
	s3Out = s3_134;
	s4Out = a2;
	return s1_133;
}

