pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23091A00: Register word32 mpi_sub_hlp(Register Eq_497213 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_497213 a7Out)
// Called from:
//      mpi_montmul
//      mbedtls_mpi_sub_abs
word32 mpi_sub_hlp(Eq_497213 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_497213 & a7Out)
{
	Eq_2 a5_16 = 0x00;
	Eq_497213 a7_15 = 0x00;
	while (true)
	{
		Eq_529413 a6_8 = a7_15 << 0x02;
		if (a7_15 == a0)
			break;
		struct Eq_529403 * a3_12 = *a4;
		struct Eq_529403 ** a4_18 = a4 - a5_16;
		*a4_18 = (struct Eq_529403 **) a3_12;
		word32 a6_20 = Mem19[a6_8 + a1:int32];
		a4 = a4_18 - a6_20;
		a3_12->t1000 = a4;
		t1 = (word32) (a4 < a5_16);
		a7_15 = (word32) a7_15 + 1;
		a5_16 = (word32) (a4_18 < a6_20) + t1;
	}
	word32 a2_27 = a2 + a6_8;
	while (a5_16 != 0x00)
	{
		struct Eq_529403 * a2_31 = *a4;
		a2_31->t1000 = a4 - a5_16;
		a2_27 = (char *) a2_31 + 4;
		a5_16 = (word32) (a4 < a5_16);
	}
	a2Out = a2_27;
	a4Out = a4;
	a5Out = a5_16;
	a7Out = a7_15;
	return t1;
}

// 23091A4A: Register (ptr32 Eq_529446) mpi_mul_hlp(Register Eq_497213 a0, Register (ptr32 Eq_529446) a1, Register (ptr32 Eq_529448) a2, Register (ptr32 Eq_529449) a3, Register out ptr32 a2Out, Register out Eq_529451 a4Out, Register out Eq_529451 a5Out)
// Called from:
//      mpi_montmul
//      mbedtls_mpi_mul_mpi
union Eq_529446 * mpi_mul_hlp(Eq_497213 a0, union Eq_529446 * a1, struct Eq_529448 * a2, struct Eq_529449 * a3, ptr32 & a2Out, union Eq_529451 & a4Out, union Eq_529451 & a5Out)
{
	struct Eq_529448 * a4_11 = a2;
	union Eq_529446 * a7_16 = a1;
	Eq_497213 t1_15 = a0;
	Eq_529451 a5_196 = 0x00;
	while (true)
	{
		Eq_529467 a6_13 = a4_11->dw0000;
		if (t1_15 <= 0x0F)
			break;
		struct Eq_529449 * t5_17 = *a7_16;
		word32 t4_25 = a3 + t5_17 + a5_196;
		++a4_11;
		word32 t4_27 = t4_25 + a6_13;
		a4_11[63] = (struct Eq_529448) t4_27;
		a7_16 = (union Eq_529446 *) ((char *) a7_16 + 64);
		struct Eq_529449 * a5_31 = *((char *) a7_16 - 60);
		up32 a6_32 = (word32) (t4_27 < a6_13) + (bool) ((a3 < t5_17) + (t4_25 < a5_196));
		word32 t4_35 = a3 + a5_31 + a6_32;
		Eq_529490 a5_38 = a4_11->dwFFFFFFC4;
		Eq_529490 t4_39 = (word32) a5_38 + t4_35;
		a4_11->dw0FC4 = (word32) t4_39;
		struct Eq_529449 * a6_43 = *((char *) a7_16 - 56);
		up32 a5_42 = (word32) (t4_39 < a5_38) + (bool) ((t4_35 < a6_32) + (a3 < a5_31));
		word32 t4_46 = a3 + a6_43 + a5_42;
		Eq_529514 a6_49 = a4_11->dwFFFFFFC8;
		Eq_529514 t4_50 = (word32) a6_49 + t4_46;
		a4_11->dw0FC8 = (word32) t4_50;
		struct Eq_529449 * a5_54 = *((char *) a7_16 - 52);
		up32 a6_53 = (word32) (t4_50 < a6_49) + (bool) ((t4_46 < a5_42) + (a3 < a6_43));
		word32 t4_57 = a3 + a5_54 + a6_53;
		Eq_529538 a5_60 = a4_11->dwFFFFFFCC;
		Eq_529538 t4_61 = (word32) a5_60 + t4_57;
		a4_11->dw0FCC = (word32) t4_61;
		struct Eq_529449 * a6_65 = *((char *) a7_16 - 48);
		up32 a5_64 = (word32) (t4_61 < a5_60) + (bool) ((t4_57 < a6_53) + (a3 < a5_54));
		word32 t4_68 = a3 + a6_65 + a5_64;
		Eq_529562 a6_71 = a4_11->dwFFFFFFD0;
		Eq_529562 t4_72 = (word32) a6_71 + t4_68;
		a4_11->dw0FD0 = (word32) t4_72;
		struct Eq_529449 * a5_76 = *((char *) a7_16 - 44);
		up32 a6_75 = (word32) (t4_72 < a6_71) + (bool) ((t4_68 < a5_64) + (a3 < a6_65));
		word32 t4_79 = a3 + a5_76 + a6_75;
		Eq_529586 a5_82 = a4_11->dwFFFFFFD4;
		Eq_529586 t4_83 = (word32) a5_82 + t4_79;
		a4_11->dw0FD4 = (word32) t4_83;
		struct Eq_529449 * a6_87 = *((char *) a7_16 - 40);
		up32 a5_86 = (word32) (t4_83 < a5_82) + (bool) ((t4_79 < a6_75) + (a3 < a5_76));
		word32 t4_90 = a3 + a6_87 + a5_86;
		Eq_529610 a6_93 = a4_11->dwFFFFFFD8;
		Eq_529610 t4_94 = (word32) a6_93 + t4_90;
		a4_11->dw0FD8 = (word32) t4_94;
		struct Eq_529449 * a5_98 = *((char *) a7_16 - 36);
		up32 a6_97 = (word32) (t4_94 < a6_93) + (bool) ((t4_90 < a5_86) + (a3 < a6_87));
		word32 t4_101 = a3 + a5_98 + a6_97;
		Eq_529634 a5_104 = a4_11->dwFFFFFFDC;
		Eq_529634 t4_105 = (word32) a5_104 + t4_101;
		a4_11->dw0FDC = (word32) t4_105;
		struct Eq_529449 * a6_109 = *((char *) a7_16 - 32);
		up32 a5_108 = (word32) (t4_105 < a5_104) + (bool) ((t4_101 < a6_97) + (a3 < a5_98));
		word32 t4_112 = a3 + a6_109 + a5_108;
		Eq_529658 a6_115 = a4_11->dwFFFFFFE0;
		Eq_529658 t4_116 = (word32) a6_115 + t4_112;
		a4_11->dw0FE0 = (word32) t4_116;
		struct Eq_529449 * a5_120 = *((char *) a7_16 - 28);
		up32 a6_119 = (word32) (t4_116 < a6_115) + (bool) ((t4_112 < a5_108) + (a3 < a6_109));
		word32 t4_123 = a3 + a5_120 + a6_119;
		Eq_529682 a5_126 = a4_11->dwFFFFFFE4;
		Eq_529682 t4_127 = (word32) a5_126 + t4_123;
		a4_11->dw0FE4 = (word32) t4_127;
		struct Eq_529449 * a6_131 = *((char *) a7_16 - 24);
		up32 a5_130 = (word32) (t4_127 < a5_126) + (bool) ((t4_123 < a6_119) + (a3 < a5_120));
		word32 t4_134 = a3 + a6_131 + a5_130;
		Eq_529706 a6_137 = a4_11->dwFFFFFFE8;
		Eq_529706 t4_138 = (word32) a6_137 + t4_134;
		a4_11->dw0FE8 = (word32) t4_138;
		struct Eq_529449 * a5_142 = *((char *) a7_16 - 20);
		up32 a6_141 = (word32) (t4_138 < a6_137) + (bool) ((t4_134 < a5_130) + (a3 < a6_131));
		word32 t4_145 = a3 + a5_142 + a6_141;
		Eq_529730 a5_148 = a4_11->dwFFFFFFEC;
		Eq_529730 t4_149 = (word32) a5_148 + t4_145;
		a4_11->dw0FEC = (word32) t4_149;
		struct Eq_529449 * a6_153 = *((char *) a7_16 - 16);
		up32 a5_152 = (word32) (t4_149 < a5_148) + (bool) ((t4_145 < a6_141) + (a3 < a5_142));
		word32 t4_156 = a3 + a6_153 + a5_152;
		Eq_529754 a6_159 = a4_11->dwFFFFFFF0;
		Eq_529754 t4_160 = (word32) a6_159 + t4_156;
		a4_11->dw0FF0 = (word32) t4_160;
		struct Eq_529449 * a5_164 = *((char *) a7_16 - 0x0C);
		up32 a6_163 = (word32) (t4_160 < a6_159) + (bool) ((t4_156 < a5_152) + (a3 < a6_153));
		word32 t4_167 = a3 + a5_164 + a6_163;
		Eq_529778 a5_170 = a4_11->dwFFFFFFF4;
		Eq_529778 t4_171 = (word32) a5_170 + t4_167;
		a4_11->dw0FF4 = (word32) t4_171;
		struct Eq_529449 * a6_175 = *((char *) a7_16 - 8);
		up32 a5_174 = (word32) (t4_171 < a5_170) + (bool) ((t4_167 < a6_163) + (a3 < a5_164));
		word32 t4_178 = a3 + a6_175 + a5_174;
		Eq_529802 a6_181 = a4_11->dwFFFFFFF8;
		Eq_529802 t4_182 = (word32) a6_181 + t4_178;
		a4_11->dw0FF8 = (word32) t4_182;
		struct Eq_529449 * t4_185 = *((char *) a7_16 - 4);
		up32 a6_186 = (word32) (t4_182 < a6_181) + (bool) ((t4_178 < a5_174) + (a3 < a6_175));
		word32 a5_189 = a3 + t4_185 + a6_186;
		Eq_529826 t4_192 = a4_11->dwFFFFFFFC;
		Eq_529826 a5_193 = (word32) t4_192 + a5_189;
		a4_11->dw0FFC = (word32) a5_193;
		t1_15 = (word32) t1_15 - 16;
		a5_196 = (word32) (a5_193 < t4_192) + (bool) ((a5_189 < a6_186) + (a3 < t4_185));
	}
	ui32 a4_201 = a0 >> 0x04 << 6;
	union Eq_529446 * a1_203 = (char *) a1 + a4_201;
	struct Eq_529851 * a2_205 = a2 + a4_201 / 64;
	Eq_529451 a4_206 = 0x07;
	uint32 a0_207 = (word32) a0.u1 + ((a0 >> 0x04) + ~0x0F);
	if (a0_207 > 0x07)
	{
		struct Eq_529449 * a7_208 = *a1_203;
		word32 a4_214 = a3 + a7_208 + a5_196;
		word32 a4_216 = a4_214 + a6_13;
		a2_205[0x0400] = (struct Eq_529851) a4_216;
		struct Eq_529449 * a5_220 = *((char *) a1_203 + 4);
		up32 a6_221 = (word32) (a4_216 < a6_13) + (bool) ((a3 < a7_208) + (a4_214 < a5_196));
		word32 a4_224 = a3 + a5_220 + a6_221;
		Eq_529894 a5_227 = a2_205[1];
		Eq_529894 a4_228 = (word32) a5_227 + a4_224;
		a2_205[0x0401] = (struct Eq_529851) a4_228;
		struct Eq_529449 * a4_231 = *((char *) a1_203 + 8);
		Eq_529907 a6_232 = (bool) ((a4_224 < a6_221) + (a3 < a5_220)) + (word32) (a4_228 < a5_227);
		word32 a5_235 = a3 + a4_231 + a6_232;
		Eq_529918 a6_238 = a2_205[2];
		word32 a5_239 = a5_235 + a6_238;
		a2_205[0x0402] = (struct Eq_529851) a5_239;
		struct Eq_529449 * a4_243 = *((char *) a1_203 + 0x0C);
		up32 a6_242 = (word32) (a5_239 < a6_238) + (bool) ((a3 < a4_231) + (a5_235 < a6_232));
		word32 a7_246 = a3 + a4_243 + a6_242;
		Eq_529942 a4_249 = a2_205[3];
		Eq_529942 a7_250 = (word32) a4_249 + a7_246;
		a2_205[0x0403] = (struct Eq_529851) a7_250;
		struct Eq_529449 * a5_252 = *((char *) a1_203 + 16);
		up32 a4_254 = (word32) (a7_250 < a4_249) + (bool) ((a7_246 < a6_242) + (a3 < a4_243));
		word32 a7_257 = a3 + a5_252 + a4_254;
		Eq_529966 a5_260 = a2_205[4];
		Eq_529966 a7_261 = (word32) a5_260 + a7_257;
		a2_205[0x0404] = (struct Eq_529851) a7_261;
		struct Eq_529449 * a6_263 = *((char *) a1_203 + 20);
		up32 a5_265 = (word32) (a7_261 < a5_260) + (bool) ((a7_257 < a4_254) + (a3 < a5_252));
		word32 a7_268 = a3 + a6_263 + a5_265;
		Eq_529990 a6_271 = a2_205[5];
		Eq_529990 a7_272 = (word32) a6_271 + a7_268;
		a2_205[0x0405] = (struct Eq_529851) a7_272;
		struct Eq_529449 * a4_274 = *((char *) a1_203 + 24);
		up32 a6_276 = (word32) (a7_272 < a6_271) + (bool) ((a7_268 < a5_265) + (a3 < a6_263));
		word32 a7_279 = a3 + a4_274 + a6_276;
		Eq_530014 a4_282 = a2_205[6];
		Eq_530014 a7_283 = (word32) a4_282 + a7_279;
		a2_205[1030] = (struct Eq_529851) a7_283;
		struct Eq_529449 * a5_285 = *((char *) a1_203 + 28);
		up32 a4_287 = (word32) (a7_283 < a4_282) + (bool) ((a7_279 < a6_276) + (a3 < a4_274));
		word32 a6_290 = a3 + a5_285 + a4_287;
		Eq_530038 a5_293 = a2_205[7];
		Eq_530038 a6_294 = (word32) a5_293 + a6_290;
		a2_205[1031] = (struct Eq_529851) a6_294;
		a4_206.u0 = (bool) ((a6_290 < a4_287) + (a3 < a5_285));
		a0_207 += ~0x07;
		a2_205 += 8;
		a1_203 = (union Eq_529446 *) ((char *) a1_203 + 32);
		a5_196.u0 = (bool) a4_206.u0 + (word32) (a6_294 < a5_293);
	}
	union Eq_529446 * t3_301 = (char *) a1_203 + (a0_207 << 2);
	struct Eq_529851 * a6_303 = a2_205;
	while (true)
	{
		Eq_530074 a7_306 = a6_303->dw0000;
		++a6_303;
		if (a1_203 == t3_301)
			break;
		a1_203 = (union Eq_529446 *) ((char *) a1_203 + 4);
		struct Eq_529449 * t1_311 = *((char *) a1_203 - 4);
		word32 a4_316 = a3 + t1_311 + a5_196;
		word32 a4_318 = a4_316 + a7_306;
		a6_303[0x03FF] = (struct Eq_529851) a4_318;
		a4_206 = (word32) (a4_318 < a7_306);
		a5_196 = (word32) a4_206 + (bool) ((a3 < t1_311) + (a4_316 < a5_196));
	}
	while (true)
	{
		struct Eq_530088 * a2_328 = *a4_206;
		a4_206 += a5_196;
		a2_328->t1000 = a4_206;
		if (a4_206 >= a5_196)
			break;
		a5_196.u0 = 0x01;
	}
	a2Out = (char *) a2_328 + 4;
	a4Out = a4_206;
	a5Out = a5_196;
	return a1_203;
}

// 23091E30: Register word32 mbedtls_mpi_init(Register Eq_2 a0)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_public
//      mbedtls_rsa_private
//      ecp_select_comb
//      ecp_double_jac
//      ecp_normalize_jac
//      ecp_normalize_jac_many
//      mbedtls_ecp_point_init.part.2
//      mbedtls_ecp_keypair_init
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_mul
word32 mbedtls_mpi_init(Eq_2 a0)
{
	if (a0 != 0x00)
	{
		*(union Eq_2 *) 0x01 = a0;
		*((word32) a0 + 4) = 0x00;
		*((word32) a0 + 8) = 0x00;
		a5 = 0x01;
	}
	return a5;
}

// 23091E40: Register word32 mbedtls_mpi_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_public
//      mbedtls_rsa_private
//      mbedtls_rsa_free
//      mbedtls_mpi_copy
//      mbedtls_mpi_sub_abs
//      mbedtls_mpi_mul_mpi
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_gcd
//      mbedtls_mpi_inv_mod
//      ecp_select_comb
//      ecp_double_jac
//      ecp_normalize_jac
//      ecp_normalize_jac_many
//      mbedtls_ecp_point_free
//      mbedtls_ecp_group_free
//      mbedtls_ecp_keypair_free
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_mul
word32 mbedtls_mpi_free(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		a6Out = a6;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_2 a0_10 = *((word32) a5 + 8);
		Eq_2 s0_11 = a0_10;
		if (a5 != 0x00)
		{
			Eq_2 a0_13 = *((word32) a4 + 4);
			while (true)
			{
				a4 = (word32) a4 - 1;
				if (a4 == ~0x00)
					break;
				*a5 = 0x00;
				a5 = (word32) a5 + 4;
			}
			word32 a2_98;
			word32 a5_99;
			word32 t3_100;
			vPortFree(a0_13, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_11, out s1, out a0_10, out a1, out a2_98, out a3, out a4, out a5_99, out a6, out s4, out t3_100);
		}
		*(union Eq_2 *) 0x01 = s0_11;
		*((word32) s0_11 + 4) = 0x00;
		((word32) s0_11 + 8)->u0 = 0x00;
		a0Out = a0_10;
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out.u0 = 0x01;
		a6Out = a6;
		s4Out = s4;
		return s1;
	}
}

// 23091E7C: Register Eq_2 mbedtls_mpi_grow(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_530186 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_530192) a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_530195) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_shrink
//      mbedtls_mpi_copy
//      mbedtls_mpi_safe_cond_assign
//      mbedtls_mpi_lset
//      mbedtls_mpi_read_binary
//      mbedtls_mpi_shift_l
//      mbedtls_mpi_add_abs
//      mbedtls_mpi_mul_mpi
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
Eq_2 mbedtls_mpi_grow(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_530186 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_530192 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, struct Eq_530195 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_530192 * a5_139 = (struct Eq_530192 *) 0x02000710;
	if (a1 <= 0x02000710)
	{
		ptr32 a0_126 = 0x00;
		if (a1 > 0x02000710)
		{
			ui32 a2_25;
			word32 s0_217;
			word32 s2_218;
			ra = mycalloc(ra, a1, a1, 0x04, a3, a4, 0x02000710, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_217, out s1, out a1, out a2_25, out a3, out a4, out a5_139, out s2_218, out s3, out s4, out s8);
			s2 = a1;
			if (a1 != 0x00)
			{
				struct Eq_530237 * s0_43 = *((word32) a1 + 8);
				if (a1 != 0x00)
				{
					Eq_2 a2_50;
					word32 a1_219;
					word32 a3_220;
					word32 a6_221;
					Eq_2 a5_47;
					word32 * a4_46;
					memcpy(a1, a1, a2_25 << 2, out a1_219, out a2_50, out a3_220, out a4_46, out a5_47, out a6_221, out a7);
					while (true)
					{
						a5_47 = (word32) a5_47 - 1;
						if (a5_47 == ~0x00)
							break;
						*a4_46 = 0x00;
						++a4_46;
					}
					word32 a0_222;
					word32 a2_223;
					word32 a6_224;
					word32 t3_225;
					vPortFree(a1, a2_50, a5_47, mstatus, dwArg0148, dwArg0188, out s0_43, out s1, out a0_222, out a1, out a2_223, out a3, out a4, out a5_139, out a6_224, out s4, out t3_225);
				}
				*((word32) s1 + 4) = s0_43;
				s0_43->t0008 = a1;
				a0_126 = 0x00;
			}
			else
				a0_126 = ~0x0F;
		}
		0x00 = (int8) dwArg38;
		s1Out = s1;
		a0Out = a0_126;
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_139;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
	else
	{
		s1Out = s1;
		a0Out = ~0x0F;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = (struct Eq_530192 *) 0x02000710;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
}

// 23091EEA: Register Eq_2 mbedtls_mpi_shrink(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out (ptr32 Eq_530305) s1Out, Register out Eq_530306 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_530306 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_530312) s3Out, Register out ptr32 s8Out)
// Called from:
//      ecp_normalize_jac_many
Eq_2 mbedtls_mpi_shrink(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, struct Eq_530305 & s1Out, union Eq_530306 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_530306 & a5Out, union Eq_2 & s2Out, struct Eq_530312 & s3Out, ptr32 & s8Out)
{
	if (a1 < a4)
	{
		Eq_2 s1_17 = a1;
		uint32 a5_18;
		for (a5_18 = (word32) a4 - 1; a5_18 != 0x00; a5_18 += ~0x00)
		{
			a3 = a5_18 << 0x02;
			a4 = Mem15[a4 + a3:word32];
			if (a4 != 0x00)
				break;
		}
		Eq_2 a5_28 = a5_18 + 0x01;
		if (a1 < a5_28)
			s1_17 = a5_28;
		Eq_2 a1_54;
		struct Eq_530312 * s3_64;
		ptr32 s8_66;
		word32 a5_291;
		word32 s2_292;
		word32 s4_293;
		word32 a2_290;
		word32 s0_289;
		struct Eq_530305 * s1_107;
		ptr32 a4_105;
		ptr32 a3_104;
		Eq_2 ra_60 = mycalloc(ra, s1_17, s1_17, 0x04, a3, a4, a5_28, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_289, out s1_107, out a1_54, out a2_290, out a3_104, out a4_105, out a5_291, out s2_292, out s3_64, out s4_293, out s8_66);
		Eq_530306 a5_121 = ~0x0F;
		if (s1_17 != 0x00)
		{
			struct Eq_530237 * s0_112 = *((word32) a1_54 + 8);
			if (a1_54 != 0x00)
			{
				word32 a7_297;
				Eq_2 a2_79;
				word32 a3_295;
				word32 a1_294;
				word32 a6_296;
				Eq_2 a5_76;
				word32 * a4_75;
				memcpy(s1_17, a1_54, s1_107 << 0x02, out a1_294, out a2_79, out a3_295, out a4_75, out a5_76, out a6_296, out a7_297);
				while (true)
				{
					a5_76 = (word32) a5_76 - 1;
					if (a5_76 == ~0x00)
						break;
					*a4_75 = 0x00;
					++a4_75;
				}
				word32 s4_303;
				word32 t3_304;
				word32 a5_301;
				word32 a0_298;
				word32 a1_299;
				word32 a2_300;
				word32 a6_302;
				vPortFree(s1_17, a2_79, a5_76, mstatus, dwArg0148, dwArg0188, out s0_112, out s1_107, out a0_298, out a1_299, out a2_300, out a3_104, out a4_105, out a5_301, out a6_302, out s4_303, out t3_304);
			}
			s1_107->ptr0004 = s0_112;
			s0_112->t0008 = s1_17;
			a5_121.u0 = 0x00;
		}
		0x00 = (int8) dwArg38;
		s1Out = s1_107;
		a0Out = a5_121;
		a2Out = dwArg10;
		a3Out = a3_104;
		a4Out = a4_105;
		a5Out = a5_121;
		s2Out = s1_17;
		s3Out = s3_64;
		s8Out = s8_66;
		return ra_60;
	}
	else
	{
		Eq_530306 a0_131;
		Eq_2 a2_132;
		Eq_530306 a5_133;
		ptr32 a3_136;
		ptr32 a4_137;
		struct Eq_530305 * s1_140;
		Eq_2 s2_141;
		struct Eq_530312 * s3_142;
		ptr32 s8_144;
		word32 a1_286;
		word32 a7_287;
		word32 s4_288;
		Eq_2 ra_139 = mbedtls_mpi_grow(ra, a1, a3, a4, mstatus, dwArg10, dwArg14, dwArg38, dwArg0108, dwArg0148, dwArg0188, out s1_140, out a0_131, out a1_286, out a2_132, out a3_136, out a4_137, out a5_133, out a7_287, out s2_141, out s3_142, out s4_288, out s8_144);
		s1Out = s1_140;
		a0Out = a0_131;
		a2Out = a2_132;
		a3Out = a3_136;
		a4Out = a4_137;
		a5Out = a5_133;
		s2Out = s2_141;
		s3Out = s3_142;
		s8Out = s8_144;
		return ra_139;
	}
}

// 23091F6A: Register Eq_2 mbedtls_mpi_copy(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_530465 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_530469) a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out (ptr32 Eq_530475) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_add_abs
//      mbedtls_mpi_sub_abs
//      mbedtls_mpi_mul_mpi
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_gcd
//      mbedtls_mpi_inv_mod
//      ecp_double_jac
//      ecp_normalize_jac_many
//      mbedtls_ecp_copy
//      ecp_add_mixed
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_copy(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_530465 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, struct Eq_530469 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & a7Out, struct Eq_530475 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s3_114;
	if (a0 != a1)
	{
		struct Eq_530475 * a1_17 = *((word32) a4 + 8);
		s2 = a1_17;
		if (a4 != 0x00)
		{
			do
				a2 = (word32) a2 - 1;
			while (a2 != 0x00 && *((word32) a4 + a2 * 0x04) == 0x00);
			a1_17->dw0000 + 0x00 = (int32) a0;
			s0 = (word32) a2 + 1;
			Eq_2 a0_51;
			ui32 a2_52;
			word32 s3_230;
			word32 s4_231;
			word32 s8_232;
			ra = mbedtls_mpi_grow(ra, (word32) a2 + 1, a3, a4, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArgE8, dwArg0128, dwArg0168, out s1, out a0_51, out a1, out a2_52, out a3, out a4, out a5, out a7, out s2, out s3_230, out s4_231, out s8_232);
			s3_114 = a0_51;
			if (a0_51 == 0x00)
			{
				Eq_2 a0_77;
				word32 t1_233;
				word32 a1_234;
				word32 a2_235;
				word32 a3_236;
				word32 a4_237;
				word32 a5_238;
				ra = memset(ra, a0_51, 0x00, a2_52 << 2, out t1_233, out a0_77, out a1_234, out a2_235, out a3_236, out a4_237, out a5_238);
				s1 = *((word32) a0_77 + 8);
				word32 a2_239;
				word32 a6_240;
				memcpy(a0_77, s2[8], (word32) a2 + 1 << 0x02, out a1, out a2_239, out a3, out a4, out a5, out a6_240, out a7);
			}
l23091FCA:
			s0Out = s0;
			s1Out = s1;
			a0Out = s3_114;
			a1Out = a1;
			a2Out = dwArg48;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			a6Out = dwArg28;
			a7Out = a7;
			s2Out = s2;
			s3Out = s3_114;
			s4Out = dwArg04;
			s8Out = dwLoc1C;
			return ra;
		}
		word32 a0_226;
		word32 a2_227;
		word32 a6_228;
		word32 s4_229;
		s1 = mbedtls_mpi_free(a0, a2, a4, a5, mstatus, dwArg0128, dwArg0168, out a0_226, out a1, out a2_227, out a3, out a4, out a5, out a6_228, out s4_229);
	}
	s3_114.u0 = 0x00;
	goto l23091FCA;
}

