pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23091FDA: Register Eq_2 mbedtls_mpi_safe_cond_assign(Register Eq_2 ra, Register Eq_2 a1, Register Eq_530592 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_530604)) a2Out, Register out (ptr32 Eq_530604) a3Out, Register out Eq_530605 a4Out, Register out (ptr32 Eq_530604) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_530609 s4Out)
// Called from:
//      ecp_select_comb
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_safe_cond_assign(Eq_2 ra, Eq_2 a1, Eq_530592 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, struct Eq_530604 & a2Out, struct Eq_530604 & a3Out, union Eq_530605 & a4Out, struct Eq_530604 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_530609 & s4Out)
{
	ptr32 s0_134 = a0;
	ptr32 a0_20;
	ptr32 s2_30;
	ptr32 s3_31;
	word32 s8_173;
	word32 a7_171;
	word32 s4_172;
	int32 * a1_24;
	struct Eq_530604 * a3_122;
	Eq_530605 a4_123;
	struct Eq_530604 ** a2_120;
	struct Eq_530604 * a5_124;
	ptr32 s1_135;
	Eq_2 ra_28 = mbedtls_mpi_grow(ra, *((word32) a1 + 4), a3, a4, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArgE8, dwArg0128, dwArg0168, out s1_135, out a0_20, out a1_24, out a2_120, out a3_122, out a4_123, out a5_124, out a7_171, out s2_30, out s3_31, out s4_172, out s8_173);
	if (a0_20 == 0x00)
	{
		struct Eq_530660 * a5_44 = 0x00 - a2;
		a2_120 = ((a2 | a5_44) & 0x00FF) >> 7;
		a4_123 = 0x01 - a2_120;
		a3_122 = a2_120 + a3_122;
		Mem53[a4_123 + a5_44 + a3_122:word32] = Mem16[a5_44 + 0x00:word32];
		a5_124 = null;
		while (true)
		{
			s1_135 = a3_122->ptr0004;
			if (a5_124 >= a3_122)
				break;
			struct Eq_530665 * a6_62 = a5_124 << 0x02;
			a1_24 += a6_62;
			a3_122 = a2_120 + Mem56[a3_122 + a6_62:word32] + (a4_123 + Mem56[a1_24 + 0x00:int32]);
			a3_122->a0000[0] = a1_24;
			a5_124 = (struct Eq_530604 *) ((char *) a5_124->a0000 + 1);
		}
		while (true)
		{
			s0_134 = a3_122->ptr0004;
			if (a5_124 >= a3_122)
				break;
			struct Eq_530604 ** a2_79 = a5_124 << 0x02;
			a3_122 = (struct Eq_530604 *) *a2_79;
			a2_120 = a2_79 + a4_123;
			*a2_120 = (struct Eq_530604 **) a3_122;
			a5_124 = (struct Eq_530604 *) ((char *) a5_124->a0000 + 1);
		}
	}
	s0Out = s0_134;
	s1Out = s1_135;
	a0Out = a0_20;
	a2Out = a2_120;
	a3Out = a3_122;
	a4Out = a4_123;
	a5Out = a5_124;
	s2Out = s2_30;
	s3Out = s3_31;
	s4Out = dwArg04;
	return ra_28;
}

// 23092060: Register Eq_2 mbedtls_mpi_lset(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_530713 s1Out, Register out ptr32 a1Out, Register out (ptr32 Eq_530715) a2Out, Register out (ptr32 Eq_530716) a3Out, Register out (ptr32 Eq_530717) a4Out, Register out (ptr32 Eq_530718) a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_530721) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_read_binary
//      mbedtls_mpi_shift_r
//      mbedtls_mpi_mul_mpi
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_inv_mod
//      ecp_normalize_jac
//      mbedtls_ecp_point_read_binary
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_lset(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_530713 & s1Out, ptr32 & a1Out, struct Eq_530715 & a2Out, struct Eq_530716 & a3Out, struct Eq_530717 & a4Out, struct Eq_530718 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, struct Eq_530721 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 a0_20;
	ui32 a2_21;
	Eq_530713 s1_29;
	struct Eq_530721 * s3_31;
	ptr32 s4_32;
	ptr32 s8_33;
	ptr32 a7_37;
	word32 s2_140;
	struct Eq_530718 * a5_102;
	struct Eq_530717 * a4_100;
	struct Eq_530716 * a3_25;
	ptr32 a1_24;
	Eq_2 ra_107 = mbedtls_mpi_grow(ra, 0x01, a3, a4, mstatus, dwArg00, dwArg04, dwArg28, dwArgF8, dwArg0138, dwArg0178, out s1_29, out a0_20, out a1_24, out a2_21, out a3_25, out a4_100, out a5_102, out a7_37, out s2_140, out s3_31, out s4_32, out s8_33);
	if (a0_20 == 0x00)
	{
		word32 a5_145;
		word32 a2_143;
		word32 a4_144;
		word32 t1_141;
		word32 a0_142;
		ra_107 = memset(ra_107, a0_20, 0x00, a2_21 << 2, out t1_141, out a0_142, out a1_24, out a2_143, out a3_25, out a4_144, out a5_145);
		struct Eq_530088 * s0_56 = a3_25->ptr0008;
		(s1_29 >> 0x1F ^ s1_29) - (s1_29 >> 0x1F) = (struct Eq_530716 **) a3_25;
		a4_100 = s1_29 >> 0x1F;
		a5_102 = (struct Eq_530718 *) ~0x00;
		if (s1_29 >= 0x00)
			a5_102 = (struct Eq_530718 *) 0x01;
		a5_102->dw0000 = s0_56;
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_29;
	a1Out = a1_24;
	a2Out = dwArg10;
	a3Out = a3_25;
	a4Out = a4_100;
	a5Out = a5_102;
	a7Out = a7_37;
	s2Out = a0_20;
	s3Out = s3_31;
	s4Out = s4_32;
	s8Out = s8_33;
	return ra_107;
}

// 230920AA: Register ui32 mbedtls_mpi_get_bit(Register Eq_2 a1, Register Eq_2 a5, Register out Eq_530794 a4Out, Register out Eq_530795 a5Out)
// Called from:
//      mbedtls_ecp_mul
ui32 mbedtls_mpi_get_bit(Eq_2 a1, Eq_2 a5, union Eq_530794 & a4Out, union Eq_530795 & a5Out)
{
	if (a1 >= a5 << 5)
	{
		a4Out = a4;
		a5Out = a5 << 5;
		return 0x00;
	}
	else
	{
		union Eq_530795 * a0_9 = ((Eq_583242[]) 8)[a5].ptr0000;
		Eq_530795 a5_12 = *a0_9;
		a4Out = a1 >> 0x05 << 2;
		a5Out = a5_12;
		return a0_9 >> a1 & 0x01;
	}
}

// 230920CA: Register (ptr32 Eq_530818) mbedtls_mpi_lsb(Register (ptr32 Eq_530818) a0, Register Eq_2 a5, Register out Eq_530820 a2Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_mpi_gcd
struct Eq_530818 * mbedtls_mpi_lsb(struct Eq_530818 * a0, Eq_2 a5, union Eq_530820 & a2Out, union Eq_2 & a5Out)
{
	int32 a6_5 = a0->dw0004;
	Eq_530820 a3_29 = 0x00;
	int32 a4_10 = 0x00;
	while (true)
	{
		struct Eq_530818 * a1_23;
		if (a6_5 == a4_10)
			break;
		Eq_530830 t1_16 = *((word32) a5 + a4_10 * 0x04);
		a5.u0 = 0x00;
		do
		{
			uint32 a2_20 = t1_16 >> a5;
			a2 = a2_20 & 0x01;
			a1_23 = a3_29 + a5;
			if ((a2_20 & 0x01) != 0x00)
				goto l230920DC;
			a5 = (byte) a5.u0 + 1;
			a2 = a3_29 + a5;
		} while (a5 != 32);
		++a4_10;
		a3_29 = a2;
	}
	a1_23 = null;
l230920DC:
	a2Out = a2;
	a5Out = a5;
	return a1_23;
}

// 2309210A: Register Eq_2 mbedtls_mpi_bitlen(Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register out Eq_497012 a1Out, Register out Eq_2 a2Out, Register out Eq_497014 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_rsa_check_pubkey
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_mpi_size
//      mbedtls_mpi_shift_l
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      ecp_modp
//      mbedtls_ecp_group_load
Eq_2 mbedtls_mpi_bitlen(Eq_2 a2, Eq_2 a4, Eq_2 a5, union Eq_497012 & a1Out, union Eq_2 & a2Out, union Eq_497014 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a5 != 0x00)
	{
		ui32 a5_15 = (word32) a5 - 1;
		while (true)
		{
			int32 a3_10 = a5_15 << 0x02;
			if (a5_15 == 0x00)
				break;
			a2 = *((word32) a4 + a3_10);
			if (a2 != 0x00)
				break;
			a5_15 += ~0x00;
		}
		int32 a0_21;
		a4.u0 = 0x80000000;
		a3.u0 = 32;
		for (a0_21 = 0x00; a0_21 != 32; ++a0_21)
		{
			a1 = a2 & a4;
			if (a1 != 0x00)
				break;
			a4 >>= 1;
		}
		a5 = (a5_15 + 0x01 << 5) - a0_21;
	}
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return a5;
}

// 2309214A: Register uint32 mbedtls_mpi_size(Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_mpi_write_binary
//      mbedtls_ecp_point_read_binary
uint32 mbedtls_mpi_size(Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a1_10;
	ptr32 a3_12;
	ptr32 a4_13;
	ptr32 a5_14;
	word32 a2_25;
	uint32 a0_17 = (char *) mbedtls_mpi_bitlen(a2, a4, a5, out a1_10, out a2_25, out a3_12, out a4_13, out a5_14) + 7 >> 3;
	a1Out = a1_10;
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_14;
	return a0_17;
}

