pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309215C: Register Eq_2 mbedtls_mpi_read_binary(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_494598 a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s8Out)
// Called from:
//      pk_parse_key_sec1_der
//      mbedtls_rsa_public
//      mbedtls_rsa_private
//      mbedtls_asn1_get_mpi
//      mbedtls_mpi_fill_random
//      mbedtls_ecp_point_read_binary
Eq_2 mbedtls_mpi_read_binary(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_494598 & a5Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s8Out)
{
	Eq_2 s0_20 = 0x00;
	while (s0_20 != a2 && CONVERT(Mem13[a1 + s0_20:byte], byte, word32) == 0x00)
		s0_20 = (word32) s0_20 + 1;
	uint32 a5_30 = a2 - s0_20;
	word32 a2_228;
	word32 s4_229;
	word32 s8_230;
	Eq_2 s1_103;
	ptr32 s3_202;
	ptr32 s2_201;
	Eq_494598 a5_101;
	ptr32 a7_195;
	Eq_2 a4_110;
	Eq_2 a3_112;
	ptr32 a0_186;
	ptr32 a1_188;
	Eq_2 ra_197 = mbedtls_mpi_grow(ra, (word32) ((a5_30 & 3) != 0x00) + (a5_30 >> 2), a3, a4, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArgE8, dwArg0128, dwArg0168, out s1_103, out a0_186, out a1_188, out a2_228, out a3_112, out a4_110, out a5_101, out a7_195, out s2_201, out s3_202, out s4_229, out s8_230);
	if (a0_186 == 0x00)
	{
		a0_186 = s2_201;
		word32 a5_232;
		word32 a2_231;
		word32 s4_233;
		word32 s8_234;
		ra_197 = mbedtls_mpi_lset(ra_197, a3_112, a4_110, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArgD8, dwArg0118, dwArg0158, out s1_103, out a1_188, out a2_231, out a3_112, out a4_110, out a5_232, out a7_195, out s2_201, out s3_202, out s4_233, out s8_234);
		a5_101.u0 = 0x00;
		if (s2_201 == 0x00)
		{
			while (s0_20 < s1_103)
			{
				s1_103 = (word32) s1_103 - 1;
				union Eq_2 * a3_106 = (word32) *((word32) s1_103 + s3_202);
				a4_110 = *a3_106;
				a3_112 = a3_106 | a3_106 << (a5_101 << 0x03 & 0x18);
				*a3_112 = a4_110;
				a5_101 = (word32) a5_101.u0 + 1;
			}
		}
	}
	s0Out = s0_20;
	s1Out = s1_103;
	a0Out = a0_186;
	a1Out = a1_188;
	a2Out = dwArg48;
	a3Out = a3_112;
	a4Out = a4_110;
	a5Out = a5_101;
	a7Out = a7_195;
	s2Out = s2_201;
	s3Out = s3_202;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return ra_197;
}

// 230921E0: Register Eq_2 mbedtls_mpi_write_binary(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_498374 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_498377 s3Out)
// Called from:
//      mbedtls_rsa_public
//      mbedtls_rsa_private
Eq_2 mbedtls_mpi_write_binary(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 & a0Out, ptr32 & a2Out, union Eq_498374 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_498377 & s3Out)
{
	ptr32 a0_28;
	word32 a3_117;
	word32 a1_116;
	Eq_2 a5_27;
	Eq_498374 a4_26;
	Eq_2 a0_22 = mbedtls_mpi_size(a2, a4, a5, out a1_116, out a3_117, out a4_26, out a5_27);
	if (a2 >= a0_22)
	{
		s2 = a0_22;
		word32 t1_118;
		word32 a0_119;
		word32 a1_120;
		word32 a2_121;
		word32 a3_122;
		word32 a5_123;
		ra = memset(ra, a1, 0x00, a2, out t1_118, out a0_119, out a1_120, out a2_121, out a3_122, out a4_26, out a5_123);
		word32 a2_42 = a1 + a2;
		a5_27.u0 = 0x00;
		while (true)
		{
			a2_42 += -1;
			if (a5_27 == a0_22)
				break;
			uint32 a4_52 = a5_27 << 0x03;
			a4_26 = a4_52 >> (a4_52 & 24);
			*a2_42 = (byte) a4_26;
			a5_27 = (byte) a5_27.u0 + 1;
		}
		a0_28 = 0x00;
	}
	else
		a0_28 = ~0x07;
	a0Out = a0_28;
	a2Out = dwArg48;
	a4Out = a4_26;
	a5Out = a5_27;
	s2Out = s2;
	s3Out = a0;
	return ra;
}

// 23092246: Register Eq_2 mbedtls_mpi_shift_l(Register Eq_2 ra, Register (ptr32 Eq_531059) a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out (ptr32 Eq_531069) s1Out, Register out Eq_531070 a0Out, Register out (ptr32 Eq_531071) a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_531069) a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_531059) s2Out, Register out (ptr32 Eq_531077) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_gcd
//      ecp_double_jac
Eq_2 mbedtls_mpi_shift_l(Eq_2 ra, struct Eq_531059 * a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & s0Out, struct Eq_531069 & s1Out, union Eq_531070 & a0Out, struct Eq_531071 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_531069 & a5Out, ptr32 & a7Out, struct Eq_531059 & s2Out, struct Eq_531077 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_531070 a0_118;
	struct Eq_531069 * a5_112;
	struct Eq_531082 * a5_28;
	word32 a2_297;
	union Eq_2 * a1_141;
	Eq_2 a4_102;
	Eq_2 a3_135;
	struct Eq_497022 * a0_23 = mbedtls_mpi_bitlen(a2, a4, a5, out a1_141, out a2_297, out a3_135, out a4_102, out a5_28);
	struct Eq_531059 * s2_15 = a1;
	struct Eq_531069 * s1_101 = a1 >> 0x05;
	struct Eq_531077 * s3_19 = a1 & 31;
	Eq_2 s0_100 = a5_28->t0004;
	word32 a0_30 = a0_23 + a1;
	if (a5_28 << 5 < a0_30)
	{
		word32 s8_300;
		word32 a2_298;
		word32 s4_299;
		ra = mbedtls_mpi_grow(ra, (word32) ((a0_30 & 31) != 0x00) + (a0_30 >> 5), a3_135, a4_102, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArgE8, dwArg0128, dwArg0168, out s1_101, out a0_118, out a1_141, out a2_298, out a3_135, out a4_102, out a5_112, out a7, out s2_15, out s3_19, out s4_299, out s8_300);
		if (a0_118 != 0x00)
			goto l2309228E;
	}
	a5_112 = (struct Eq_531069 *) 0x1F;
	if (s2_15 > (struct Eq_531059 *) 0x1F)
	{
		Eq_531144 a2_63 = (char *) s1_101 - 4;
		s0_100 = *(union Eq_2 *) 0x23;
		a4_102.u0 = 0x7C;
		while (true)
		{
			a4_102 = (byte) a4_102.u0 - 4;
			if (s1_101 >= a5_112)
				break;
			s0_100 = *((word32) a3_135 + 8);
			a1_141 = Mem72[a3_135 + a2_63 + a4_102:word32];
			a3_135 += a4_102;
			*a1_141 = (union Eq_2 *) a3_135;
			a5_112 = (struct Eq_531069 *) ((char *) a5_112 - 1);
		}
		a5_112 <<= 2;
		a3_135.u0 = ~0x03;
		while (true)
		{
			a5_112 = (struct Eq_531069 *) ((char *) a5_112 - 4);
			if (a5_112 == (struct Eq_531069 *) ~0x03)
				break;
			s0_100 = *((byte) a4_102.u0 + 8);
			a4_102 += a5_112;
			*a4_102.u0 = 0x00;
		}
	}
	if (s3_19 != null)
	{
		uint32 a2_113 = 0x00;
		a3_135 = 32 - s3_19;
		while (true)
		{
			s0_100 = a5_112[4];
			if (s1_101 >= a5_112)
				break;
			Eq_2 a4_107 = *a1_141;
			*(a1_141 << s3_19) = (union Eq_2 *) a4_107;
			a5_112 = (struct Eq_531069 *) *a4_107;
			a4_102 = a4_107 | a2_113;
			*a4_102.u0 = a5_112;
			++s1_101;
			a2_113 = a1_141 >> a3_135;
		}
	}
	a0_118.u0 = 0x00;
l2309228E:
	s0Out = s0_100;
	s1Out = s1_101;
	a0Out = a0_118;
	a2Out = dwArg48;
	a3Out = a3_135;
	a4Out = a4_102;
	a5Out = a5_112;
	a7Out = a7;
	s2Out = s2_15;
	s3Out = s3_19;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return ra;
}

// 23092308: Register Eq_2 mbedtls_mpi_shift_r(Register Eq_2 ra, Register (ptr32 (ptr32 uint32)) a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 uint32)) a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_531229 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_531232) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_gcd
//      mbedtls_mpi_inv_mod
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_shift_r(Eq_2 ra, uint32 ** a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, uint32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_531229 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, struct Eq_531232 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a0_5 = *((word32) a5 + 4);
	Eq_2 a3_124 = a1 >> 0x05;
	if (a5 < a1 >> 0x05)
	{
l2309231C:
		uint32 ** a1_77;
		Eq_2 a2_78;
		Eq_2 a3_79;
		Eq_531229 a4_80;
		Eq_2 a5_81;
		ptr32 s1_85;
		ptr32 s2_86;
		struct Eq_531232 * s3_87;
		ptr32 s4_88;
		ptr32 s8_89;
		word32 a7_249;
		Eq_2 ra_84 = mbedtls_mpi_lset(ra, a1 >> 0x05, a1 & 31, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArgF8, dwArg0138, dwArg0178, out s1_85, out a1_77, out a2_78, out a3_79, out a4_80, out a5_81, out a7_249, out s2_86, out s3_87, out s4_88, out s8_89);
		s1Out = s1_85;
		a0Out = a0_5;
		a1Out = a1_77;
		a2Out = a2_78;
		a3Out = a3_79;
		a4Out = a4_80;
		a5Out = a5_81;
		s2Out = s2_86;
		s3Out = s3_87;
		s4Out = s4_88;
		s8Out = s8_89;
		return ra_84;
	}
	Eq_2 a5_11;
	uint32 ** a1_10;
	if (a5 == a1 >> 0x05)
	{
		if ((a1 & 31) != 0x00)
			goto l2309231C;
		a5_11.u0 = 0x1F;
		a1_10 = a1;
		if (a1 <= (uint32 **) 0x1F)
		{
l2309233E:
			s1Out = s1;
			a0Out = 0x00;
			a1Out = a1_10;
			a2Out = a2;
			a3Out = a3_124;
			a4Out = a1 & 31;
			a5Out = a5_11;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s8Out = s8;
			return ra;
		}
		a5_11.u0 = 0x00;
		a1_10 = a1;
	}
	else
	{
		a5_11.u0 = 0x1F;
		a1_10 = a1;
		if (a1 <= (uint32 **) 0x1F)
			goto l2309233C;
		a1_10 = a1 >> 0x05 << 0x02;
		a5_11.u0 = 0x00;
		while (true)
		{
			a2 -= a1 >> 0x05;
			if (a5_11 >= a2)
				break;
			a2 = (word32) a2 + (a5_11 << 0x02);
			Mem26[a2 + 0x00:word32] = Mem13[a2 + a1_10:int32];
			a5_11 = (byte) a5_11.u0 + 1;
			a1_10 += 0x04;
		}
	}
	while (a5_11 < a3_124)
	{
		a2 = a5_11 << 0x02;
		a3_124 += a2;
		*a3_124 = 0x00;
		a5_11 = (word32) a5_11 + 1;
	}
l2309233C:
	if ((a1 & 31) != 0x00)
	{
		ui32 a7_45 = 0x00;
		int32 a6_47 = 32 - (a1 & 31);
		while (true)
		{
			a5_11 = (word32) a5_11 - 1;
			if (a5_11 == ~0x00)
				break;
			**a1_10 = a1_10 >> (a1 & 31);
			a3_124 = null[a5_11];
			a2 = a5_11 << 0x02 | a7_45;
			*a2 = a3_124;
			a7_45 = a1_10 << a6_47;
		}
	}
	goto l2309233E;
}

// 230923B0: Register ptr32 mbedtls_mpi_cmp_abs(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mpi_montmul
//      mbedtls_mpi_sub_abs
//      mbedtls_mpi_add_mpi
//      mbedtls_mpi_sub_mpi
//      mbedtls_mpi_div_mpi
ptr32 mbedtls_mpi_cmp_abs(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	while (a5 != 0x00)
	{
		a3 = a5 << 0x02;
		a4 = Mem0[a4 + a3 + -4:int32];
		if (a4 != 0x00)
			break;
		a5 = (word32) a5 - 1;
	}
	ptr32 a1_18 = *((word32) a3 + 4);
	while (true)
	{
		ptr32 a4_26;
		if (a3 == 0x00)
			break;
		a1_18 = (ptr32) *((word32) a2 + 8);
		if ((word32) a2 + (a3 << 0x02) + -4 != 0x00)
		{
			a4_26 = 0x01;
			if (a3 >= a5)
			{
				a4_26 = ~0x00;
				if (a5 >= a3)
				{
					a5 = (word32) a5 - 1;
					a1_18 = ~0x00;
					do
					{
						if (a5 == ~0x00)
						{
							a4_26 = 0x00;
							goto l230923F8;
						}
						int32 a4_36 = a5 << 0x02;
						a3 = *((word32) a3 + a4_36);
						Eq_2 a4_41 = *((word32) a2 + a4_36);
						if (a4_41 < a3)
						{
							a4_26 = 0x01;
							goto l230923F8;
						}
						a5 = (word32) a5 - 1;
					} while (a3 >= a4_41);
					a4_26 = ~0x00;
				}
			}
			goto l230923F8;
		}
		a3 = (word32) a3 - 1;
	}
	a4_26 = (word32) (a5 != 0x00);
l230923F8:
	a1Out = a1_18;
	a3Out = a3;
	a4Out = a4_26;
	a5Out = a5;
	return a4_26;
}

// 2309241C: Register Eq_2 mpi_montmul(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_529449) a3, Register (ptr32 Eq_531426) a4, Register (ptr32 Eq_531427) a5, Stack word32 dwArg010C, Register out ptr32 t1Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_531432) a2Out, Register out (ptr32 Eq_529449) a3Out, Register out (ptr32 Eq_531426) a4Out, Register out ptr32 a5Out, Register out Eq_531436 a7Out, Register out (ptr32 Eq_529449) s2Out, Register out Eq_497213 s3Out, Register out Eq_531439 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out (ptr32 Eq_529449) s7Out, Register out (ptr32 Eq_531443) s8Out, Register out Eq_2 s9Out, Register out Eq_497213 s10Out, Register out (ptr32 Eq_529449) s11Out)
// Called from:
//      mbedtls_mpi_exp_mod
Eq_2 mpi_montmul(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_529449 * a3, struct Eq_531426 * a4, struct Eq_531427 * a5, word32 dwArg010C, ptr32 & t1Out, ptr32 & s1Out, ptr32 & a0Out, struct Eq_531432 & a2Out, struct Eq_529449 & a3Out, struct Eq_531426 & a4Out, ptr32 & a5Out, union Eq_531436 & a7Out, struct Eq_529449 & s2Out, union Eq_497213 & s3Out, union Eq_531439 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, struct Eq_529449 & s7Out, struct Eq_531443 & s8Out, union Eq_2 & s9Out, union Eq_497213 & s10Out, struct Eq_529449 & s11Out)
{
	struct Eq_531432 * a2_5 = a5->ptr0004;
	Eq_531436 a7_7 = a4->t0004;
	if (a7_7 >= (char *) a5 + 1)
	{
		Eq_2 a6_10 = a4->t0008;
		if (a6_10 != 0x00)
		{
			word32 a1_358;
			word32 t1_356;
			word32 a2_359;
			word32 a0_357;
			word32 a4_361;
			word32 a5_362;
			word32 a3_360;
			memset(ra, a6_10, 0x00, a7_7 << 0x02, out t1_356, out a0_357, out a1_358, out a2_359, out a3_360, out a4_361, out a5_362);
			Eq_497213 s8_61 = a2_5->t0004;
			Eq_497213 s10_190 = *((word32) a1 + 4);
			Eq_2 a5_115 = a4->t0008;
			if (s8_61 < s10_190)
				s10_190 = s8_61;
			Eq_2 s6_67 = (word32) s8_61 + 1 << 2;
			Eq_497213 s3_70 = 0x00;
			s2_292 = s2;
			while (true)
			{
				struct Eq_529449 * s2_292;
				Eq_2 a0_73 = *((word32) a0 + 8);
				if (s3_70 == s8_61)
					break;
				struct Eq_529448 ** a4_78 = s3_70 << 0x02;
				union Eq_529446 * a1_77 = *((word32) a1 + 8);
				s11 = Mem72[a0_73 + a4_78:int32];
				struct Eq_529448 * s1_82 = *a4_78;
				s2_292 = s11 + Mem72[a1_77 + 0x00:int32] + a4_78 + a3;
				word32 a2_363;
				word32 a4_364;
				word32 a2_366;
				word32 a5_365;
				word32 a4_367;
				mpi_mul_hlp(s8_61, mpi_mul_hlp(s10_190, a1_77, s1_82, s11, out a2_363, out a4_364, out a5_365), s1_82, s2_292, out a2_366, out a4_367, out a5_115);
				s1_82[64] = (struct Eq_529448) s11;
				Mem125[s1_82 + 0x04 + s6_67:word32] = 0x00;
				s3_70 = (word32) s3_70 + 1;
			}
			Eq_2 a2_155;
			Eq_2 a4_130;
			Eq_2 a5_131;
			Eq_2 a2_134;
			Eq_2 a3_135;
			word32 a1_368;
			word32 a6_369;
			word32 a7_370;
			memcpy(a0_73, (word32) a5_115 + ((word32) s6_67 - 4), s6_67, out a1_368, out a2_134, out a3_135, out a4_130, out a5_131, out a6_369, out a7_370);
			Eq_2 a4_150;
			word32 a1_371;
			word32 a3_372;
			word32 a5_373;
			Eq_497213 a0_147 = mbedtls_mpi_cmp_abs(a2_134, a3_135, a4_130, a5_131, out a1_371, out a3_372, out a4_150, out a5_373);
			Eq_2 a1_152 = *((word32) a0 + 8);
			if (a0_147 >= 0x00)
				a2_155 = a1_152;
			else
				a2_155 = a4->t0008;
			struct Eq_531426 * a4_165;
			Eq_531436 a7_168;
			word32 a5_375;
			word32 a2_374;
			ptr32 t1_169 = mpi_sub_hlp(s3_70, a1_152, a2_155, a4_150, out a2_374, out a4_165, out a5_375, out a7_168);
			0x00 = dwArg010C;
			t1Out = t1_169;
			s1Out = dwLoc4C;
			a0Out = 0x00;
			a2Out = dwArg01A8;
			a3Out = s2;
			a4Out = a4_165;
			a5Out = 0x00;
			a7Out = a7_168;
			s2Out = s2_292;
			s3Out = s3_70;
			s4Out = dwArg0168;
			s5Out = a0;
			s6Out = s6_67;
			s7Out = a3;
			s8Out = dwArg0148;
			s9Out = a1;
			s10Out = s10_190;
			s11Out = s11;
			return dwLoc08;
		}
	}
	t1Out = t1;
	s1Out = s1;
	a0Out = ~0x03;
	a2Out = a2_5;
	a3Out = a3;
	a4Out = a4;
	a5Out = ~0x03;
	a7Out = a7_7;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

