pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23092526: Register Eq_2 mbedtls_mpi_cmp_mpi(Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register out (ptr32 Eq_497059) a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_497064 a6Out)
// Called from:
//      mbedtls_rsa_check_pubkey
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_check_pub_priv
//      mbedtls_rsa_public
//      mbedtls_rsa_private
//      mbedtls_mpi_cmp_int
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_mod_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_gcd
//      mbedtls_mpi_inv_mod
//      ecp_modp
//      ecp_double_jac
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_check_privkey
//      mbedtls_ecp_mul
//      mbedtls_ecp_check_pub_priv
Eq_2 mbedtls_mpi_cmp_mpi(Eq_2 a2, Eq_2 a4, Eq_2 a5, struct Eq_497059 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_497064 & a6Out)
{
	while (a5 != 0x00)
	{
		a3 = a5 << 0x02;
		a4 = Mem0[a4 + a3 + -4:int32];
		if (a4 != 0x00)
			break;
		a5 = (word32) a5 - 1;
	}
	struct Eq_497059 * a1_16 = *((word32) a4 + 4);
	for (; a4 != 0x00; a4 += ~0x00)
	{
		a6 = a1_16->t0008;
		a3 = Mem0[(a4 << 0x02) + a6 + -4:int32];
		if (a3 != 0x00)
		{
			if (a4 < a5)
				goto l2309255E;
			a1_16 = (struct Eq_497059 *) *a3;
			if (a5 < a4)
			{
				a4 = 0x00 - a3;
				goto l23092560;
			}
			if (a4 > 0x00)
			{
				if (a3 < 0x00)
				{
					a4.u0 = 0x01;
					goto l23092560;
				}
			}
			else if (a3 > 0x00 && a4 != 0x00)
			{
				a4.u0 = ~0x00;
				goto l23092560;
			}
			a5 = (word32) a5 - 1;
			a1_16 = (struct Eq_497059 *) ~0x00;
			do
			{
				if (a5 == ~0x00)
				{
					a4.u0 = 0x00;
					goto l23092560;
				}
				Eq_2 (* a3_36)[] = a5 << 0x02;
				a2 = Mem0[a2 + a3_36:word32];
				a3 = Mem0[a3_36 + a6:word32];
				if (a3 < a2)
					goto l23092560;
				a5 = (word32) a5 - 1;
			} while (a2 >= a3);
			a4 = 0x00 - a4;
			goto l23092560;
		}
	}
	a4.u0 = 0x00;
	if (a5 != 0x00)
	{
l2309255E:
	}
l23092560:
	a1Out = a1_16;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a6Out = a6;
	return a4;
}

// 230925B2: Register Eq_2 mbedtls_mpi_cmp_int(Register int32 a1, Register Eq_2 a2, Register out (ptr32 Eq_498106) a1Out, Register out (ptr32 Eq_498107) a2Out, Register out ptr32 a3Out, Register out Eq_498109 a4Out, Register out (ptr32 Eq_498110) a5Out, Register out ptr32 a6Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_private
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_mod_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_gcd
//      mbedtls_mpi_inv_mod
//      ecp_select_comb
//      ecp_modp
//      ecp_double_jac
//      ecp_normalize_jac
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_check_privkey
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_cmp_int(int32 a1, Eq_2 a2, struct Eq_498106 & a1Out, struct Eq_498107 & a2Out, ptr32 & a3Out, union Eq_498109 & a4Out, struct Eq_498110 & a5Out, ptr32 & a6Out)
{
	struct Eq_498106 * a1_24;
	struct Eq_498107 * a2_25;
	ptr32 a3_26;
	Eq_498109 a4_27;
	struct Eq_498110 * a5_28;
	ptr32 a6_29;
	Eq_2 a0_23 = mbedtls_mpi_cmp_mpi(a2, a1 >> 0x1F, 0x01, out a1_24, out a2_25, out a3_26, out a4_27, out a5_28, out a6_29);
	a1Out = a1_24;
	a2Out = a2_25;
	a3Out = a3_26;
	a4Out = a4_27;
	a5Out = a5_28;
	a6Out = a6_29;
	return a0_23;
}

// 230925DE: Register Eq_2 mbedtls_mpi_add_abs(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_531744) a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_531747 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_mpi_add_mpi
//      mbedtls_mpi_sub_mpi
//      ecp_mod_p256k1
Eq_2 mbedtls_mpi_add_abs(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_531744 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_531747 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	struct Eq_531744 * a1_155;
	Eq_531747 a5_138;
	ptr32 a7_110;
	Eq_2 s3_104;
	Eq_2 s1_102;
	ptr32 s4_114;
	Eq_2 s0_143;
	Eq_2 s2_103 = a0;
	s0_143 = s0;
	if (a0 != a2)
	{
		s0_143 = s0;
		if (a0 != a1)
		{
			ptr32 a0_26;
			word32 a6_373;
			word32 s4_374;
			word32 s8_375;
			word32 a2_372;
			ra = mbedtls_mpi_copy(ra, a0, a1, a2, a3, a4, a5, mstatus, dwLoc18, dwArgB8, dwArgF8, dwArg0138, out s0_143, out s1_102, out a0_26, out a1_155, out a2_372, out a3, out a4, out a5_138, out a6_373, out a7_110, out s2_103, out s3_104, out s4_374, out s8_375);
			s4_114 = a0_26;
			if (a0_26 != 0x00)
				goto l23092664;
		}
	}
	*s2_103 = 0x01;
	Eq_531765 a5_52 = 0x01;
	while (s0_143 != 0x00)
	{
		a4 = s0_143 << 0x02;
		a5_52 = Mem55[a5_52 + a4 + -4:int32];
		if (a5_52 != 0x00)
			break;
		s0_143 = (word32) s0_143 - 1;
	}
	ptr32 a0_93;
	word32 s4_377;
	word32 s8_378;
	word32 a2_376;
	ra = mbedtls_mpi_grow(ra, s0_143, a3, a4, mstatus, s2, s0, dwArg08, dwArgD8, dwArg0118, dwArg0158, out s1_102, out a0_93, out a1_155, out a2_376, out a3, out a4, out a5_138, out a7_110, out s2_103, out s3_104, out s4_377, out s8_378);
	s4_114 = a0_93;
	if (a0_93 == 0x00)
	{
		int32 a5_115 = *((word32) s2_103 + 8);
		a3.u0 = 0x00;
		s1_102.u0 = 0x00;
		while (s0_143 != a3)
		{
			struct Eq_531839 ** a4_125 = a1_155->dw0000;
			word32 a4_130 = a4_125 + s1_102;
			word32 a4_132 = a4_130 + a1_155;
			*((char *) *a4_125 + 0x00001000) = (struct Eq_531839 **) a4_132;
			a3 = (byte) a3.u0 + 1;
			s1_102 = (bool) ((a4_130 < s1_102) + (a4_132 < a1_155));
		}
		a4 = s0_143 << 0x02;
		a5_138 = (word32) a4 + a5_115;
		while (s1_102 != 0x00)
		{
			a4 = *((word32) s2_103 + 4);
			s3_104 = (word32) s0_143 + 1;
			if (s0_143 >= a4)
			{
				ptr32 a0_151;
				word32 a2_379;
				word32 s8_380;
				ra = mbedtls_mpi_grow(ra, s3_104, a3, a4, mstatus, s2, s0, dwArg08, dwArgD8, dwArg0118, dwArg0158, out s1_102, out a0_151, out a1_155, out a2_379, out a3, out a4, out a5_138, out a7_110, out s2_103, out s3_104, out s4_114, out s8_380);
				if (a0_151 != 0x00)
				{
					s4_114 = a0_151;
					break;
				}
			}
			struct Eq_531858 * a5_189 = *a4;
			a4 += s1_102;
			a5_189->t1000 = a4;
			s0_143 = s3_104;
			a5_138 = (char *) a5_189 + 4;
			s1_102 = (word32) (a4 < s1_102);
		}
	}
l23092664:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_102;
	a0Out = s4_114;
	a1Out = a1_155;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_138;
	a7Out = a7_110;
	s2Out = s2_103;
	s3Out = s3_104;
	s4Out = s4_114;
	return ra;
}

// 230926AE: Register Eq_2 mbedtls_mpi_sub_abs(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_497213 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_531917) a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_add_mpi
//      mbedtls_mpi_sub_mpi
//      mbedtls_mpi_gcd
//      ecp_modp
//      ecp_double_jac
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
Eq_2 mbedtls_mpi_sub_abs(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_497213 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_531917 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s3_244 = a1;
	Eq_2 s2_13 = a0;
	Eq_2 s1_150 = a2;
	Eq_2 a1_103;
	Eq_2 a3_147;
	Eq_2 a4_121;
	struct Eq_531917 * a5_145;
	Eq_497213 a0_100 = mbedtls_mpi_cmp_abs(a2, a3, a4, a5, out a1_103, out a3_147, out a4_121, out a5_145);
	Eq_497213 s0_117 = ~0x09;
	if (a0_100 < 0x00)
	{
l23092716:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_150;
		a0Out = s0_117;
		a1Out = a1_103;
		a2Out = dwArg0100;
		a3Out = a3_147;
		a4Out = a4_121;
		a5Out = a5_145;
		a7Out = a7;
		s2Out = s2_13;
		s3Out = s3_244;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
	Eq_2 a5_126 = 0x01;
	if (a2 == a0)
	{
		word32 s0_302;
		word32 s1_303;
		word32 a6_304;
		word32 s4_305;
		ra = mbedtls_mpi_copy(ra, fp + -44, a2, a2, a3_147, a4_121, 0x01, mstatus, dwLoc18, dwArgB8, dwArgF8, dwArg0138, out s0_302, out s1_303, out a0_100, out a1_103, out a2, out a3_147, out a4_121, out a5_126, out a6_304, out a7, out s2_13, out s3_244, out s4_305, out s8);
		s0_117 = a0_100;
		if (a0_100 != 0x00)
			goto l23092710;
	}
	if (s3_244 != s2_13)
	{
		word32 s0_309;
		word32 s1_310;
		word32 a3_311;
		word32 a6_312;
		word32 s4_313;
		ra = mbedtls_mpi_copy(ra, s2_13, s3_244, a2, a3_147, a4_121, a5_126, mstatus, dwLoc18, dwArgB8, dwArgF8, dwArg0138, out s0_309, out s1_310, out a0_100, out a1_103, out a2, out a3_311, out a4_121, out a5_126, out a6_312, out a7, out s2_13, out s3_244, out s4_313, out s8);
		s0_117 = a0_100;
		if (a0_100 != 0x00)
			goto l23092710;
	}
	*s2_13 = 0x01;
	while (a0_100 != 0x00 && Mem99[((a0_100 << 0x02) + a1_103) + -4:int32] == 0x00)
		a0_100 = (word32) a0_100.u0 - 1;
	mpi_sub_hlp(a0_100, a1_103, *((word32) s2_13 + 8), a4_121, out a2, out a4_121, out a5_126, out a7);
	s0_117.u0 = 0x00;
l23092710:
	word32 a0_306;
	word32 a2_307;
	word32 a6_308;
	s1_150 = mbedtls_mpi_free(fp + -44, a2, a4_121, a5_126, mstatus, dwArg0118, dwArg0158, out a0_306, out a1_103, out a2_307, out a3_147, out a4_121, out a5_145, out a6_308, out s4);
	goto l23092716;
}

// 23092736: Register Eq_2 mbedtls_mpi_add_mpi(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out (ptr32 ptr32) s0Out, Register out ptr32 s1Out, Register out Eq_498799 a0Out, Register out ptr32 a1Out, Register out (ptr32 Eq_498801) a2Out, Register out ptr32 a3Out, Register out Eq_498803 a4Out, Register out (ptr32 Eq_498804) a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_498806) s2Out, Register out (ptr32 Eq_498807) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_rsa_private
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_mod_mpi
//      mbedtls_mpi_exp_mod
//      mbedtls_mpi_inv_mod
//      ecp_modp
//      ecp_double_jac
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
Eq_2 mbedtls_mpi_add_mpi(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & s1Out, union Eq_498799 & a0Out, ptr32 & a1Out, struct Eq_498801 & a2Out, ptr32 & a3Out, union Eq_498803 & a4Out, struct Eq_498804 & a5Out, ptr32 & a7Out, struct Eq_498806 & s2Out, struct Eq_498807 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_498807 * s3_179;
	struct Eq_498806 * s2_176;
	ptr32 s1_106;
	ptr32 * s0_108;
	Eq_2 ra_171;
	ptr32 a7_168;
	ptr32 a1_156;
	Eq_498799 a0_105;
	ptr32 a3_159;
	Eq_498803 a4_162;
	struct Eq_498804 * a5_165;
	Eq_2 a1_14 = *s0;
	Eq_2 a2_16 = *a5;
	word32 a5_19 = s0 + a5;
	if (a5_19 < 0x00)
	{
		Eq_2 a3_51;
		Eq_2 a4_52;
		Eq_2 a5_53;
		word32 a1_214;
		if (mbedtls_mpi_cmp_abs(a2_16, a3, a4, a5_19, out a1_214, out a3_51, out a4_52, out a5_53) < 0x00)
		{
			word32 s0_63;
			word32 a2_215;
			word32 s4_216;
			word32 s8_217;
			ra_171 = mbedtls_mpi_sub_abs(ra, a0, a2_16, a1_14, a3_51, a4_52, a5_53, mstatus, dwArg98, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_63, out s1_106, out a0_105, out a1_156, out a2_215, out a3_159, out a4_162, out a5_165, out a7_168, out s2_176, out s3_179, out s4_216, out s8_217);
			s0_108 = 0x00 - s0_63;
			if (a0_105 != 0x00)
				goto l23092780;
			goto l2309276C;
		}
		word32 a2_218;
		word32 s4_219;
		word32 s8_220;
		ra_171 = mbedtls_mpi_sub_abs(ra, a0, a1_14, a2_16, a3_51, a4_52, a5_53, mstatus, dwArg98, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_108, out s1_106, out a0_105, out a1_156, out a2_218, out a3_159, out a4_162, out a5_165, out a7_168, out s2_176, out s3_179, out s4_219, out s8_220);
	}
	else
	{
		word32 s4_213;
		ra_171 = mbedtls_mpi_add_abs(ra, s0, a0, a1_14, a2_16, a3, a4, a5_19, s2, mstatus, s2, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_108, out s1_106, out a0_105, out a1_156, out a3_159, out a4_162, out a5_165, out a7_168, out s2_176, out s3_179, out s4_213);
	}
	if (a0_105 != 0x00)
	{
l23092780:
		s0Out = s0_108;
		s1Out = s1_106;
		a0Out = a0_105;
		a1Out = a1_156;
		a2Out = dwArg48;
		a3Out = a3_159;
		a4Out = a4_162;
		a5Out = a5_165;
		a7Out = a7_168;
		s2Out = s2_176;
		s3Out = s3_179;
		s4Out = dwArg04;
		s8Out = dwLoc1C;
		return ra_171;
	}
l2309276C:
	*s0_108 = s1_106;
	goto l23092780;
}

// 23092794: Register Eq_2 mbedtls_mpi_sub_mpi(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out (ptr32 ptr32) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_498647) a2Out, Register out ptr32 a3Out, Register out Eq_498649 a4Out, Register out (ptr32 Eq_498650) a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_498652) s2Out, Register out (ptr32 Eq_498653) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_rsa_private
//      mbedtls_mpi_sub_int
//      mbedtls_mpi_div_mpi
//      mbedtls_mpi_mod_mpi
//      mbedtls_mpi_inv_mod
//      ecp_select_comb
//      ecp_double_jac
//      ecp_add_mixed
//      mbedtls_ecp_mul
Eq_2 mbedtls_mpi_sub_mpi(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, struct Eq_498647 & a2Out, ptr32 & a3Out, union Eq_498649 & a4Out, struct Eq_498650 & a5Out, ptr32 & a7Out, struct Eq_498652 & s2Out, struct Eq_498653 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_498653 * s3_179;
	struct Eq_498652 * s2_176;
	ptr32 s1_106;
	ptr32 * s0_108;
	Eq_2 ra_171;
	ptr32 a7_168;
	ptr32 a0_105;
	ptr32 a3_159;
	Eq_498649 a4_162;
	struct Eq_498650 * a5_165;
	Eq_2 a1_14 = *s0;
	Eq_2 a2_16 = *a5;
	word32 a5_19 = s0 + a5;
	if (a5_19 > 0x00)
	{
		Eq_2 a3_51;
		Eq_2 a4_52;
		Eq_2 a5_53;
		word32 a1_214;
		if (mbedtls_mpi_cmp_abs(a2_16, a3, a4, a5_19, out a1_214, out a3_51, out a4_52, out a5_53) < 0x00)
		{
			word32 s0_63;
			word32 a1_215;
			word32 a2_216;
			word32 s4_217;
			word32 s8_218;
			ra_171 = mbedtls_mpi_sub_abs(ra, a0, a2_16, a1_14, a3_51, a4_52, a5_53, mstatus, dwArg98, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_63, out s1_106, out a0_105, out a1_215, out a2_216, out a3_159, out a4_162, out a5_165, out a7_168, out s2_176, out s3_179, out s4_217, out s8_218);
			s0_108 = 0x00 - s0_63;
			if (a0_105 != 0x00)
				goto l230927DE;
			goto l230927CA;
		}
		word32 a1_219;
		word32 a2_220;
		word32 s4_221;
		word32 s8_222;
		ra_171 = mbedtls_mpi_sub_abs(ra, a0, a1_14, a2_16, a3_51, a4_52, a5_53, mstatus, dwArg98, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_108, out s1_106, out a0_105, out a1_219, out a2_220, out a3_159, out a4_162, out a5_165, out a7_168, out s2_176, out s3_179, out s4_221, out s8_222);
	}
	else
	{
		word32 a1_212;
		word32 s4_213;
		ra_171 = mbedtls_mpi_add_abs(ra, s0, a0, a1_14, a2_16, a3, a4, a5_19, s2, mstatus, s2, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s0_108, out s1_106, out a0_105, out a1_212, out a3_159, out a4_162, out a5_165, out a7_168, out s2_176, out s3_179, out s4_213);
	}
	if (a0_105 != 0x00)
	{
l230927DE:
		s0Out = s0_108;
		s1Out = s1_106;
		a0Out = a0_105;
		a2Out = dwArg48;
		a3Out = a3_159;
		a4Out = a4_162;
		a5Out = a5_165;
		a7Out = a7_168;
		s2Out = s2_176;
		s3Out = s3_179;
		s4Out = dwArg04;
		s8Out = dwLoc1C;
		return ra_171;
	}
l230927CA:
	*s0_108 = s1_106;
	goto l230927DE;
}

// 230927F2: Register Eq_2 mbedtls_mpi_sub_int(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register int32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_ecp_check_pubkey
Eq_2 mbedtls_mpi_sub_int(Eq_2 ra, Eq_2 s0, Eq_2 a0, int32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_32;
	ptr32 a2_34;
	ptr32 a3_35;
	ptr32 a4_36;
	ptr32 a5_37;
	ptr32 s2_43;
	ptr32 s3_44;
	ptr32 s4_45;
	word32 s0_85;
	word32 s1_86;
	word32 a7_87;
	word32 s8_88;
	Eq_2 ra_40 = mbedtls_mpi_sub_mpi(ra, s0, a0, a3, a2 >> 0x1F, 0x01, s2, mstatus, dwArg78, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_85, out s1_86, out a0_32, out a2_34, out a3_35, out a4_36, out a5_37, out a7_87, out s2_43, out s3_44, out s4_45, out s8_88);
	a0Out = a0_32;
	a2Out = a2_34;
	a3Out = a3_35;
	a4Out = a4_36;
	a5Out = a5_37;
	s2Out = s2_43;
	s3Out = s3_44;
	s4Out = s4_45;
	return ra_40;
}

