pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309281E: Register Eq_2 mbedtls_mpi_mul_mpi(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_497205) a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_497209 a5Out, Register out Eq_497210 s2Out, Register out (ptr32 Eq_497205) s3Out, Register out ptr32 s4Out, Register out Eq_497213 s5Out, Register out Eq_2 s6Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_private
//      mbedtls_mpi_mul_int
//      ecp_double_jac
//      ecp_normalize_jac
//      ecp_normalize_jac_many
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_mul
//      ecp_mod_p256k1
Eq_2 mbedtls_mpi_mul_mpi(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0198, ptr32 & s0Out, union Eq_2 & s1Out, struct Eq_497205 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_497209 & a5Out, union Eq_497210 & s2Out, struct Eq_497205 & s3Out, ptr32 & s4Out, union Eq_497213 & s5Out, union Eq_2 & s6Out, ptr32 & s8Out)
{
	Eq_497210 s2_169;
	struct Eq_497205 * s3_180;
	Eq_2 a5_102 = 0x01;
	Eq_2 s4_28 = a0;
	Eq_2 s0_111 = a2;
	Eq_2 s1_32 = a1;
	if (a0 == a1)
	{
		struct Eq_497205 * a0_37;
		word32 a1_492;
		word32 a6_493;
		word32 a7_494;
		word32 s3_495;
		word32 s8_496;
		word32 s1_491;
		ra = mbedtls_mpi_copy(ra, fp + -56, a1, a2, a3, a4, 0x01, mstatus, s2, dwArgA8, dwArgE8, dwArg0128, out s0_111, out s1_491, out a0_37, out a1_492, out a2, out a3, out a4, out a5_102, out a6_493, out a7_494, out s2_169, out s3_495, out s4_28, out s8_496);
		s3_180 = a0_37;
		s1_32 = fp + -56;
		if (a0_37 != null)
			goto l23092854;
	}
	if (s4_28 == s0_111)
	{
		struct Eq_497205 * a0_73;
		word32 s8_513;
		word32 a1_508;
		word32 a6_509;
		word32 a7_510;
		word32 s3_511;
		word32 s4_512;
		word32 s0_507;
		ra = mbedtls_mpi_copy(ra, fp + -44, s4_28, a2, a3, a4, a5_102, mstatus, s2, dwArgA8, dwArgE8, dwArg0128, out s0_507, out s1_32, out a0_73, out a1_508, out a2, out a3, out a4, out a5_102, out a6_509, out a7_510, out s2_169, out s3_511, out s4_512, out s8_513);
		s3_180 = a0_73;
		if (a0_73 != null)
			goto l23092854;
		s0_111 = fp + -44;
	}
	s5 = *((word32) s1_32 + 4);
	while (s5 != 0x00)
	{
		a4 = s5 << 0x02;
		a5_102 = Mem26[a5_102 + a4 + -4:int32];
		if (a5_102 != 0x00)
			break;
		s5 = (word32) s5 - 1;
	}
	int32 s2_113;
	for (s2_113 = *((word32) s0_111 + 4); s2_113 != 0x00; s2_113 += ~0x00)
	{
		a4 = s2_113 << 0x02;
		a5_102 = Mem26[a5_102 + a4 + -4:int32];
		if (a5_102 != 0x00)
			break;
	}
	struct Eq_497205 * a0_159;
	Eq_2 a3_164;
	struct Eq_497205 * s4_171;
	word32 s1_514;
	word32 a7_516;
	word32 s3_517;
	word32 s8_518;
	word32 a1_515;
	ra = mbedtls_mpi_grow(ra, (word32) s5 + s2_113, a3, a4, mstatus, s6, s4, dwLoc08, dwArgC8, dwArg0108, dwArg0148, out s1_514, out a0_159, out a1_515, out a2, out a3_164, out a4, out a5_102, out a7_516, out s2_169, out s3_517, out s4_171, out s8_518);
	s3_180 = a0_159;
	if (a0_159 == null)
	{
		struct Eq_529449 * a3_185;
		struct Eq_532440 * s4_194;
		word32 s8_522;
		word32 s3_521;
		word32 s1_519;
		word32 a7_520;
		union Eq_529446 * a1_183;
		ra = mbedtls_mpi_lset(ra, a3_164, a4, mstatus, dwLoc40, 0x01, dwLoc18, dwLoc08, dwArgB8, dwArgF8, dwArg0138, out s1_519, out a1_183, out a2, out a3_185, out a4, out a5_102, out a7_520, out s2_169, out s3_521, out s4_194, out s8_522);
		s3_180 = s4_171;
		s6.u0 = ~0x00;
		if (s4_171 == null)
		{
			while (true)
			{
				s2_169 = (word32) s2_169.u0 - 1;
				if (s2_169 == ~0x00)
					break;
				a1_183 = mpi_mul_hlp(s5, a1_183, (s2_169 << 0x02) + s4_194->dw0008, a3_185, out a2, out a4, out a5_102);
			}
			a5_102 += a4;
			s4_194->t0000 = a5_102;
		}
	}
l23092854:
	Eq_2 a2_248;
	Eq_2 a5_249;
	Eq_2 a4_252;
	word32 a1_498;
	word32 a6_500;
	word32 s4_501;
	word32 a3_499;
	word32 a0_497;
	mbedtls_mpi_free(fp + -44, a2, a4, a5_102, mstatus, dwArg0108, dwArg0148, out a0_497, out a1_498, out a2_248, out a3_499, out a4_252, out a5_249, out a6_500, out s4_501);
	Eq_497209 a5_261;
	ptr32 a3_263;
	ptr32 a4_264;
	word32 s4_506;
	word32 a6_505;
	word32 a0_502;
	word32 a1_503;
	word32 a2_504;
	Eq_2 s1_266 = mbedtls_mpi_free(fp + -56, a2_248, a4_252, a5_249, mstatus, dwArg0108, dwArg0148, out a0_502, out a1_503, out a2_504, out a3_263, out a4_264, out a5_261, out a6_505, out s4_506);
	0x00 = (int8) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_266;
	a0Out = s3_180;
	a2Out = dwArg0138;
	a3Out = a3_263;
	a4Out = a4_264;
	a5Out = a5_261;
	s2Out = s2_169;
	s3Out = s3_180;
	s4Out = dwArgF4;
	s5Out = s5;
	s6Out = s6;
	s8Out = dwArgD4;
	return ra;
}

// 23092906: Register Eq_2 mbedtls_mpi_mul_int(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0178, Register out Eq_532511 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_532514) a2Out, Register out ptr32 a3Out, Register out Eq_532516 a4Out, Register out (ptr32 Eq_532517) a5Out, Register out (ptr32 Eq_532518) s2Out, Register out (ptr32 Eq_532519) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_532522) s6Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_mpi_div_mpi
//      ecp_double_jac
//      ecp_add_mixed
Eq_2 mbedtls_mpi_mul_int(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0178, union Eq_532511 & s0Out, ptr32 & s1Out, ptr32 & a0Out, struct Eq_532514 & a2Out, ptr32 & a3Out, union Eq_532516 & a4Out, struct Eq_532517 & a5Out, struct Eq_532518 & s2Out, struct Eq_532519 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_532522 & s6Out, ptr32 & s8Out)
{
	struct Eq_532514 * a2_22;
	ptr32 a3_23;
	Eq_532516 a4_24;
	struct Eq_532517 * a5_25;
	Eq_532511 s0_29;
	ptr32 s1_30;
	struct Eq_532518 * s2_31;
	struct Eq_532519 * s3_32;
	ptr32 s4_33;
	ptr32 s5_34;
	ptr32 s8_35;
	ptr32 a0_43;
	struct Eq_532522 * s6_44;
	Eq_2 ra_28 = mbedtls_mpi_mul_mpi(ra, a0, a1, fp + ~0x1B, a3, a4, s2, s4, s6, mstatus, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0178, out s0_29, out s1_30, out a0_43, out a2_22, out a3_23, out a4_24, out a5_25, out s2_31, out s3_32, out s4_33, out s5_34, out s6_44, out s8_35);
	s0Out = s0_29;
	s1Out = s1_30;
	a0Out = a0_43;
	a2Out = a2_22;
	a3Out = a3_23;
	a4Out = a4_24;
	a5Out = a5_25;
	s2Out = s2_31;
	s3Out = s3_32;
	s4Out = s4_33;
	s5Out = s5_34;
	s6Out = s6_44;
	s8Out = s8_35;
	return ra_28;
}

