pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
						Eq_2 ra_693 = mbedtls_mpi_grow(ra_1001, s2_651->dw0004 + 0x01, a3_644, a4_1000, mstatus, 0x01, 0x00, dwLoc0658, dwLoc0588, dwLoc0548, dwLoc0508, out s1_2162, out a0_685, out a1_2163, out a2_1036, out a3_690, out a4_1000, out a5_687, out a7, out s2_2164, out s3_2165, out s4_697, out s8_2166);
						s0_1021 = a0_685;
						if (a0_685 != 0x00)
							goto l23093076;
						Eq_2 a0_709;
						Eq_2 s4_713;
						struct Eq_531427 * a5_719;
						struct Eq_529449 * s1_723;
						word32 s3_2172;
						word32 s8_2173;
						word32 a6_2170;
						word32 s2_2171;
						word32 a1_2168;
						word32 a3_2169;
						word32 s0_2167;
						Eq_2 ra_721 = mbedtls_mpi_copy(ra_693, s4_697, s9_574, a2_1036, a3_690, a4_1000, a5_687, mstatus, 0x00, dwLoc05A8, dwLoc0568, dwLoc0528, out s0_2167, out s1_723, out a0_709, out a1_2168, out a2_1036, out a3_2169, out a4_1000, out a5_719, out a6_2170, out a7, out s2_2171, out s3_2172, out s4_713, out s8_2173);
						s0_1021 = a0_709;
						if (a0_709 != 0x00)
							goto l23093076;
						Eq_2 a0_737;
						Eq_2 s4_752;
						word32 s6_754;
						word32 t1_2174;
						word32 s9_2175;
						word32 s10_2176;
						ra_1001 = mpi_montmul(ra_721, s4_713, fp + -1588, s1_723, fp + -0x0664, a5_719, dwLoc0584, out t1_2174, out s1_1003, out a0_737, out a2_1036, out a3_644, out a4_1000, out a5_1230, out a7, out s2_651, out s3_1007, out s4_752, out s5_1009, out s6_754, out s7_1011, out s8_1219, out s9_2175, out s10_2176, out s11_670);
						s0_1021 = a0_737;
						if (a0_737 != 0x00)
							goto l23093076;
						s6_669 = s6_754 + 0x01;
						s9_574 = s4_752;
					}
					goto l23092EB4;
				}
			}
			goto l23093076;
		}
		a1_245 = fp + -0x0670;
		a0_247 = s7_1011;
	}
	word32 a7_2128;
	word32 a3_2126;
	word32 a6_2127;
	word32 a1_2125;
	memcpy(a0_247, a1_245, 0x0C, out a1_2125, out a2_1036, out a3_2126, out a4_1000, out a5_328, out a6_2127, out a7_2128);
	goto l23092E4E;
}

// 230930F8: Register Eq_2 mbedtls_mpi_gcd(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_497677 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_private
//      mbedtls_mpi_inv_mod
Eq_2 mbedtls_mpi_gcd(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg68, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_497677 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a0_31;
	Eq_2 a3_39;
	word32 s1_551;
	word32 s0_550;
	word32 a1_552;
	word32 s4_555;
	word32 a6_553;
	word32 a7_554;
	Eq_2 a5_116;
	Eq_2 a4_115;
	Eq_2 a2_113;
	ptr32 s8_124;
	ptr32 s3_122;
	Eq_2 s2_121;
	Eq_2 ra_43 = mbedtls_mpi_copy(ra, fp + -40, a1, a2, a3, a4, 0x01, mstatus, 0x00, dwArg98, dwArgD8, dwArg0118, out s0_550, out s1_551, out a0_31, out a1_552, out a2_113, out a3_39, out a4_115, out a5_116, out a6_553, out a7_554, out s2_121, out s3_122, out s4_555, out s8_124);
	ptr32 s0_132 = a0_31;
	if (a0_31 == 0x00)
	{
		ptr32 a0_57;
		word32 a7_575;
		word32 s4_576;
		word32 a1_572;
		word32 a6_574;
		word32 a3_573;
		word32 s1_571;
		word32 s0_570;
		Eq_2 ra_69 = mbedtls_mpi_copy(ra_43, fp + -28, a2, a2, a3_39, a4_115, a5_116, mstatus, 0x00, dwArg98, dwArgD8, dwArg0118, out s0_570, out s1_571, out a0_57, out a1_572, out a2_113, out a3_573, out a4_115, out a5_116, out a6_574, out a7_575, out s2_121, out s3_122, out s4_576, out s8_124);
		s0_132 = a0_57;
		if (a0_57 == 0x00)
		{
			Eq_2 a5_86;
			word32 a2_577;
			uint32 ** a0_81 = mbedtls_mpi_lsb(fp + -40, a5_116, out a2_577, out a5_86);
			uint32 ** s1_101 = a0_81;
			Eq_2 a2_94;
			Eq_2 a5_97;
			uint32 ** a0_92 = mbedtls_mpi_lsb(fp + -28, a5_86, out a2_94, out a5_97);
			if (a0_92 < a0_81)
				s1_101 = a0_92;
			ptr32 a0_111;
			uint32 ** s1_120;
			word32 a1_578;
			word32 s4_580;
			word32 a3_579;
			Eq_2 ra_119 = mbedtls_mpi_shift_r(ra_69, s1_101, a2_94, a5_97, mstatus, dwLoc50, dwLoc4C, dwLoc28, dwLoc18, dwArgA8, dwArgE8, dwArg0128, out s1_120, out a0_111, out a1_578, out a2_113, out a3_579, out a4_115, out a5_116, out s2_121, out s3_122, out s4_580, out s8_124);
			s0_132 = a0_111;
			if (a0_111 == 0x00)
			{
				ptr32 a0_135;
				word32 s4_583;
				word32 a3_582;
				word32 a1_581;
				struct Eq_531059 * s1_144;
				Eq_2 ra_143 = mbedtls_mpi_shift_r(ra_119, s1_120, a2_113, a5_116, mstatus, dwLoc50, dwLoc4C, dwLoc28, dwLoc18, dwArgA8, dwArgE8, dwArg0128, out s1_144, out a0_135, out a1_581, out a2_113, out a3_582, out a4_115, out a5_116, out s2_121, out s3_122, out s4_583, out s8_124);
				s0_132 = a0_135;
				if (a0_135 == 0x00)
				{
					do
					{
						Eq_2 a2_166;
						Eq_2 a4_168;
						Eq_2 a5_169;
						word32 a1_618;
						word32 a3_619;
						word32 a6_620;
						if (mbedtls_mpi_cmp_int(0x00, a2_113, out a1_618, out a2_166, out a3_619, out a4_168, out a5_169, out a6_620) == 0x00)
						{
							ptr32 a0_340;
							Eq_2 a3_343;
							word32 s4_591;
							word32 a7_590;
							word32 s1_589;
							word32 s0_588;
							Eq_2 ra_348 = mbedtls_mpi_shift_l(ra_143, s1_144, a2_166, a4_168, a5_169, mstatus, 0x00, dwArg98, dwArgD8, dwArg0118, out s0_588, out s1_589, out a0_340, out a2_113, out a3_343, out a4_115, out a5_116, out a7_590, out s2_121, out s3_122, out s4_591, out s8_124);
							s0_132 = a0_340;
							if (a0_340 == 0x00)
							{
								ptr32 a0_365;
								word32 a1_594;
								word32 s1_593;
								word32 s0_592;
								word32 a3_595;
								word32 a6_596;
								word32 a7_597;
								word32 s4_598;
								mbedtls_mpi_copy(ra_348, s2_121, fp + -28, a2_113, a3_343, a4_115, a5_116, mstatus, 0x00, dwArg98, dwArgD8, dwArg0118, out s0_592, out s1_593, out a0_365, out a1_594, out a2_113, out a3_595, out a4_115, out a5_116, out a6_596, out a7_597, out s2_121, out s3_122, out s4_598, out s8_124);
								s0_132 = a0_365;
							}
							break;
						}
						Eq_2 a2_175;
						Eq_2 a5_178;
						ptr32 a0_187;
						word32 s4_587;
						word32 a3_586;
						word32 a1_585;
						word32 s1_584;
						Eq_2 ra_195 = mbedtls_mpi_shift_r(ra_143, mbedtls_mpi_lsb(fp + -40, a5_169, out a2_175, out a5_178), a2_175, a5_178, mstatus, dwLoc50, dwLoc4C, dwLoc28, dwLoc18, dwArgA8, dwArgE8, dwArg0128, out s1_584, out a0_187, out a1_585, out a2_113, out a3_586, out a4_115, out a5_116, out s2_121, out s3_122, out s4_587, out s8_124);
						s0_132 = a0_187;
						if (a0_187 != 0x00)
							break;
						Eq_2 a2_212;
						Eq_2 a5_215;
						ptr32 a0_221;
						word32 s1_599;
						word32 a1_600;
						word32 a3_601;
						word32 s4_602;
						Eq_2 ra_229 = mbedtls_mpi_shift_r(ra_195, mbedtls_mpi_lsb(fp + -28, a5_116, out a2_212, out a5_215), a2_212, a5_215, mstatus, dwLoc50, dwLoc4C, dwLoc28, dwLoc18, dwArgA8, dwArgE8, dwArg0128, out s1_599, out a0_221, out a1_600, out a2_113, out a3_601, out a4_115, out a5_116, out s2_121, out s3_122, out s4_602, out s8_124);
						s0_132 = a0_221;
						if (a0_221 != 0x00)
							break;
						Eq_2 ra_269;
						Eq_2 a3_248;
						Eq_2 a4_249;
						Eq_2 a5_250;
						word32 a1_603;
						word32 a2_604;
						word32 a6_605;
						if (mbedtls_mpi_cmp_mpi(a2_113, a4_115, a5_116, out a1_603, out a2_604, out a3_248, out a4_249, out a5_250, out a6_605) >= 0x00)
						{
							ptr32 a0_283;
							word32 s0_612;
							word32 s1_613;
							word32 a1_614;
							word32 a3_615;
							word32 a7_616;
							word32 s4_617;
							ra_269 = mbedtls_mpi_sub_abs(ra_229, fp + -40, fp + -40, fp + -28, a3_248, a4_249, a5_250, mstatus, dwArg68, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_612, out s1_613, out a0_283, out a1_614, out a2_113, out a3_615, out a4_115, out a5_116, out a7_616, out s2_121, out s3_122, out s4_617, out s8_124);
							s0_132 = a0_283;
							if (a0_283 != 0x00)
								break;
						}
						else
						{
							ptr32 a0_255;
							word32 s0_606;
							word32 s1_607;
							word32 a1_608;
							word32 a3_609;
							word32 a7_610;
							word32 s4_611;
							ra_269 = mbedtls_mpi_sub_abs(ra_229, fp + -28, fp + -28, fp + -40, a3_248, a4_249, a5_250, mstatus, dwArg68, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_606, out s1_607, out a0_255, out a1_608, out a2_113, out a3_609, out a4_115, out a5_116, out a7_610, out s2_121, out s3_122, out s4_611, out s8_124);
							s0_132 = a0_255;
							if (a0_255 != 0x00)
								break;
						}
						ptr32 a0_315;
						word32 a1_621;
						word32 a3_622;
						word32 s4_623;
						ra_143 = mbedtls_mpi_shift_r(ra_269, (uint32 **) 0x01, a2_113, a5_116, mstatus, dwLoc50, dwLoc4C, dwLoc28, dwLoc18, dwArgA8, dwArgE8, dwArg0128, out s1_144, out a0_315, out a1_621, out a2_113, out a3_622, out a4_115, out a5_116, out s2_121, out s3_122, out s4_623, out s8_124);
						s0_132 = a0_315;
					} while (a0_315 == 0x00);
				}
			}
		}
	}
	Eq_2 a2_396;
	Eq_2 a5_397;
	Eq_2 a4_400;
	word32 s4_560;
	word32 a0_556;
	word32 a6_559;
	word32 a1_557;
	word32 a3_558;
	mbedtls_mpi_free(fp + -52, a2_113, a4_115, a5_116, mstatus, dwArgF8, dwArg0138, out a0_556, out a1_557, out a2_396, out a3_558, out a4_400, out a5_397, out a6_559, out s4_560);
	Eq_2 a2_408;
	Eq_2 a5_409;
	Eq_2 a4_412;
	word32 a6_564;
	word32 s4_565;
	word32 a3_563;
	word32 a0_561;
	word32 a1_562;
	mbedtls_mpi_free(fp + -40, a2_396, a4_400, a5_397, mstatus, dwArgF8, dwArg0138, out a0_561, out a1_562, out a2_408, out a3_563, out a4_412, out a5_409, out a6_564, out s4_565);
	ptr32 a2_420;
	Eq_497677 a5_421;
	ptr32 a4_424;
	ptr32 s4_427;
	word32 a3_568;
	word32 a6_569;
	word32 a1_567;
	word32 a0_566;
	mbedtls_mpi_free(fp + -28, a2_408, a4_412, a5_409, mstatus, dwArgF8, dwArg0138, out a0_566, out a1_567, out a2_420, out a3_568, out a4_424, out a5_421, out a6_569, out s4_427);
	s1Out = dwLoc4C;
	a0Out = s0_132;
	a2Out = a2_420;
	a3Out = s2;
	a4Out = a4_424;
	a5Out = a5_421;
	s2Out = s2_121;
	s3Out = s3_122;
	s4Out = s4_427;
	s8Out = s8_124;
	return dwLoc08;
}

// 23093204: Register ptr32 mbedtls_mpi_fill_random(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register ptr32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_499101 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_rsa_private
//      mbedtls_ecp_mul
ptr32 mbedtls_mpi_fill_random(Eq_2 ra, Eq_2 s0, Eq_2 s1, ptr32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_499101 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	if (a1 > 0x0400)
	{
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out.u0 = 0x0400;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		mstatusOut = mstatus;
		return ~0x03;
	}
	else
	{
		Eq_2 s0_25;
		Eq_2 ra_27;
		word32 a6_69;
		word32 a7_70;
		word32 t0_75;
		word32 t1_76;
		word32 t3_77;
		word32 t4_78;
		word32 t5_79;
		word32 t6_80;
		word32 tp_81;
		ptr32 a0_28;
		Eq_2 a2_29;
		Eq_2 a3_30;
		Eq_2 a4_40;
		Eq_499101 a5_23;
		ptr32 s2_107;
		ptr32 s3_110;
		ptr32 s4_113;
		ptr32 s8_116;
		a2();
		if (a0_28 == 0x00)
		{
			word32 s0_160;
			word32 s1_161;
			word32 a1_162;
			word32 a7_163;
			mbedtls_mpi_read_binary(ra_27, fp - 1040, s0_25, a3_30, a4, mstatus, dwLoc0408, dwLoc03F8, dwLoc0338, dwLoc0328, dwLoc02F8, dwLoc02E8, dwLoc02B8, dwLoc02A8, out s0_160, out s1_161, out a0_28, out a1_162, out a2_29, out a3_30, out a4_40, out a5_23, out a7_163, out s2_107, out s3_110, out s4_113, out s8_116);
		}
		a2Out = a2_29;
		a3Out = a3_30;
		a4Out = a4_40;
		a5Out = a5_23;
		s2Out = s2_107;
		s3Out = s3_110;
		s4Out = s4_113;
		s8Out = s8_116;
		mstatusOut = mstatus;
		return a0_28;
	}
}

