pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309324C: Register Eq_2 mbedtls_mpi_inv_mod(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0164, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_498014 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out)
// Called from:
//      mbedtls_rsa_check_privkey
//      mbedtls_rsa_private
//      ecp_normalize_jac
//      ecp_normalize_jac_many
Eq_2 mbedtls_mpi_inv_mod(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0164, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_498014 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out)
{
	Eq_2 s2_1018 = a0;
	Eq_2 s3_11 = a1;
	Eq_2 s1_1005 = a2;
	Eq_2 a4_26;
	word32 a1_1433;
	word32 a6_1434;
	Eq_498014 a5_1000;
	Eq_2 a3_1002;
	ptr32 a2_1306;
	if (mbedtls_mpi_cmp_int(0x00, a2, out a1_1433, out a2_1306, out a3_1002, out a4_26, out a5_1000, out a6_1434) > 0x00)
	{
		dwLoc8C = 0x00;
		dwLoc70 = 0x01;
		Eq_2 s1_72;
		word32 a0_84;
		word32 a3_1435;
		word32 s4_1436;
		Eq_2 a5_110;
		Eq_2 a4_109;
		Eq_2 a2_107;
		ra = mbedtls_mpi_gcd(ra, a1, a2, a3_1002, a4_26, mstatus, dwLoc28, 0x01, 0x00, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, out s1_72, out a0_84, out a2_107, out a3_1435, out a4_109, out a5_110, out s2_1018, out s3_11, out s4_1436, out s8);
		if (a0_84 == 0x00)
		{
			word32 a6_1483;
			word32 a1_1481;
			word32 a3_1482;
			if (mbedtls_mpi_cmp_int(0x01, a2_107, out a1_1481, out a2_107, out a3_1482, out a4_109, out a5_110, out a6_1483) == 0x00)
			{
				word32 a0_105;
				Eq_2 a3_108;
				word32 s1_1484;
				word32 a7_1485;
				word32 s4_1486;
				ra = mbedtls_mpi_mod_mpi(ra, fp + -0x0080, s3_11, s1_72, s5, s6, s7, s10, s11, mstatus, 0x01, 0x00, dwLoc58, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, 0x00, 0x01, 0x00, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_1484, out a0_105, out a2_107, out a3_108, out a4_109, out a5_110, out a7_1485, out s2_1018, out s3_11, out s4_1486, out s5, out s6, out s7, out s8, out s9, out s10, out s11);
				if (a0_105 == 0x00)
				{
					word32 a0_135;
					Eq_2 a3_143;
					Eq_2 s1_149;
					word32 s4_1491;
					word32 a7_1490;
					word32 a1_1488;
					word32 a6_1489;
					word32 s0_1487;
					ra = mbedtls_mpi_copy(ra, fp + -116, fp + -0x0080, a2_107, a3_108, a4_109, a5_110, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0_1487, out s1_149, out a0_135, out a1_1488, out a2_107, out a3_143, out a4_109, out a5_110, out a6_1489, out a7_1490, out s2_1018, out s3_11, out s4_1491, out s8);
					if (a0_135 == 0x00)
					{
						word32 a0_160;
						Eq_2 a3_168;
						Eq_2 s1_174;
						word32 a6_1494;
						word32 a7_1495;
						word32 s4_1496;
						word32 s0_1492;
						word32 a1_1493;
						ra = mbedtls_mpi_copy(ra, fp + -80, s1_149, a2_107, a3_143, a4_109, a5_110, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0_1492, out s1_174, out a0_160, out a1_1493, out a2_107, out a3_168, out a4_109, out a5_110, out a6_1494, out a7_1495, out s2_1018, out s3_11, out s4_1496, out s8);
						if (a0_160 == 0x00)
						{
							word32 a0_185;
							Eq_2 a3_193;
							word32 s4_1502;
							word32 a7_1501;
							word32 a1_1499;
							word32 a6_1500;
							word32 s0_1497;
							word32 s1_1498;
							ra = mbedtls_mpi_copy(ra, fp + -0x0044, s1_174, a2_107, a3_168, a4_109, a5_110, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0_1497, out s1_1498, out a0_185, out a1_1499, out a2_107, out a3_193, out a4_109, out a5_110, out a6_1500, out a7_1501, out s2_1018, out s3_11, out s4_1502, out s8);
							if (a0_185 == 0x00)
							{
								Eq_2 a3_212;
								word32 s1_1503;
								word32 a1_1504;
								word32 a7_1505;
								word32 s4_1506;
								ra = mbedtls_mpi_lset(ra, a3_193, a4_109, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1503, out a1_1504, out a2_107, out a3_212, out a4_109, out a5_110, out a7_1505, out s2_1018, out s3_11, out s4_1506, out s8);
								if (fp == ~0x67)
								{
									Eq_2 a3_235;
									word32 s1_1507;
									word32 s4_1510;
									word32 a1_1508;
									word32 a7_1509;
									ra = mbedtls_mpi_lset(ra, a3_212, a4_109, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1507, out a1_1508, out a2_107, out a3_235, out a4_109, out a5_110, out a7_1509, out s2_1018, out s3_11, out s4_1510, out s8);
									if (fp == ~0x5B)
									{
										Eq_2 a3_258;
										word32 a1_1512;
										word32 a7_1513;
										word32 s4_1514;
										word32 s1_1511;
										ra = mbedtls_mpi_lset(ra, a3_235, a4_109, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1511, out a1_1512, out a2_107, out a3_258, out a4_109, out a5_110, out a7_1513, out s2_1018, out s3_11, out s4_1514, out s8);
										if (fp == ~0x37)
										{
											Eq_2 a0_278 = fp + -44;
											word32 a3_1517;
											word32 s1_1515;
											word32 a1_1516;
											word32 a7_1518;
											word32 s4_1519;
											ra = mbedtls_mpi_lset(ra, a3_258, a4_109, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1515, out a1_1516, out a2_107, out a3_1517, out a4_109, out a5_110, out a7_1518, out s2_1018, out s3_11, out s4_1519, out s8);
											while (true)
											{
												Eq_2 s0_300 = a0_278;
												if (a0_278 != 0x00)
													break;
l2309332C:
												ui32 a5_305 = *a5_110;
												a5_110 = a5_305 & 0x01;
												if ((a5_305 & 0x01) != 0x00)
												{
													do
													{
														s5 = dwArg54;
														ui32 a5_458 = *a5_110;
														if ((a5_458 & 0x01) != 0x00)
														{
															Eq_2 a3_655;
															Eq_2 s0_674;
															Eq_2 a1_676;
															Eq_2 a3_615;
															Eq_2 a4_616;
															Eq_2 a5_617;
															word32 a2_1527;
															word32 a1_1526;
															word32 a6_1528;
															if (mbedtls_mpi_cmp_mpi(a2_107, a4_109, a5_458 & 0x01, out a1_1526, out a2_1527, out a3_615, out a4_616, out a5_617, out a6_1528) >= 0x00)
															{
																Eq_2 a0_680;
																Eq_2 a3_683;
																word32 s0_1533;
																word32 s1_1534;
																word32 a7_1535;
																word32 s4_1536;
																ra = mbedtls_mpi_sub_mpi(ra, s0_300, fp + -116, a3_615, a4_616, a5_617, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1533, out s1_1534, out a0_680, out a2_107, out a3_683, out a4_109, out a5_110, out a7_1535, out s2_1018, out s3_11, out s4_1536, out s8);
																if (a0_680 != 0x00)
																	break;
																Eq_2 a0_706;
																word32 s0_1537;
																word32 s4_1540;
																word32 s1_1538;
																word32 a7_1539;
																ra = mbedtls_mpi_sub_mpi(ra, a0_680, fp + -0x0068, a3_683, a4_109, a5_110, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1537, out s1_1538, out a0_706, out a2_107, out a3_655, out a4_109, out a5_110, out a7_1539, out s2_1018, out s3_11, out s4_1540, out s8);
																s0_674 = a0_706;
																if (a0_706 != 0x00)
																	break;
																a1_676 = fp + -92;
															}
															else
															{
																Eq_2 a0_626;
																Eq_2 a3_629;
																word32 s4_1532;
																word32 s1_1530;
																word32 a7_1531;
																word32 s0_1529;
																ra = mbedtls_mpi_sub_mpi(ra, s0_300, fp + -0x0044, a3_615, a4_616, a5_617, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1529, out s1_1530, out a0_626, out a2_107, out a3_629, out a4_109, out a5_110, out a7_1531, out s2_1018, out s3_11, out s4_1532, out s8);
																if (a0_626 != 0x00)
																	break;
																Eq_2 a0_652;
																word32 s1_1586;
																word32 s0_1585;
																word32 a7_1587;
																word32 s4_1588;
																ra = mbedtls_mpi_sub_mpi(ra, a0_626, fp + -56, a3_629, a4_109, a5_110, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1585, out s1_1586, out a0_652, out a2_107, out a3_655, out a4_109, out a5_110, out a7_1587, out s2_1018, out s3_11, out s4_1588, out s8);
																s0_674 = a0_652;
																if (a0_652 != 0x00)
																	break;
																a1_676 = fp + -44;
															}
															Eq_2 a0_742;
															word32 s0_1589;
															word32 s1_1590;
															word32 a3_1591;
															word32 a7_1592;
															word32 s4_1593;
															ra = mbedtls_mpi_sub_mpi(ra, s0_674, a1_676, a3_655, a4_109, a5_110, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1589, out s1_1590, out a0_742, out a2_107, out a3_1591, out a4_109, out a5_110, out a7_1592, out s2_1018, out s3_11, out s4_1593, out s8);
															s0_300 = a0_742;
															if (a0_742 != 0x00)
																break;
															word32 a6_1543;
															word32 a3_1542;
															word32 a1_1541;
															if (mbedtls_mpi_cmp_int(0x00, a2_107, out a1_1541, out a2_107, out a3_1542, out a4_109, out a5_110, out a6_1543) != 0x00)
																goto l2309332C;
															do
															{
																Eq_2 a3_782;
																word32 a6_1545;
																word32 a1_1544;
																if (mbedtls_mpi_cmp_int(0x00, a2_107, out a1_1544, out a2_107, out a3_782, out a4_109, out a5_110, out a6_1545) >= 0x00)
																{
																	do
																	{
																		Eq_2 a2_828;
																		Eq_2 a3_829;
																		Eq_2 a4_830;
																		Eq_2 a5_831;
																		word32 a6_1553;
																		word32 a1_1552;
																		if (mbedtls_mpi_cmp_mpi(a2_107, a4_109, a5_110, out a1_1552, out a2_828, out a3_829, out a4_830, out a5_831, out a6_1553) < 0x00)
																		{
																			word32 s4_1566;
																			word32 a7_1565;
																			word32 a6_1564;
																			word32 a3_1563;
																			word32 a1_1562;
																			word32 a0_1561;
																			word32 s1_1560;
																			word32 s0_1559;
																			ra = mbedtls_mpi_copy(ra, s2_1018, fp + -56, a2_828, a3_829, a4_830, a5_831, mstatus, 0x00, dwArg58, dwArg98, dwArgD8, out s0_1559, out s1_1560, out a0_1561, out a1_1562, out a2_107, out a3_1563, out a4_109, out a5_110, out a6_1564, out a7_1565, out s2_1018, out s3_11, out s4_1566, out s8);
																			break;
																		}
																		Eq_2 a0_841;
																		word32 a7_1557;
																		word32 s4_1558;
																		word32 s1_1555;
																		word32 a3_1556;
																		word32 s0_1554;
																		ra = mbedtls_mpi_sub_mpi(ra, s0_300, fp + -56, a3_829, a4_830, a5_831, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1554, out s1_1555, out a0_841, out a2_107, out a3_1556, out a4_109, out a5_110, out a7_1557, out s2_1018, out s3_11, out s4_1558, out s8);
																		s0_300 = a0_841;
																	} while (a0_841 == 0x00);
																	break;
																}
																Eq_2 a0_796;
																word32 s4_1551;
																word32 a3_1549;
																word32 a7_1550;
																word32 a1_1548;
																word32 s1_1547;
																word32 s0_1546;
																ra = mbedtls_mpi_add_mpi(ra, s0_300, fp + -56, a3_782, a4_109, a5_110, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1546, out s1_1547, out a0_796, out a1_1548, out a2_107, out a3_1549, out a4_109, out a5_110, out a7_1550, out s2_1018, out s3_11, out s4_1551, out s8);
																s0_300 = a0_796;
															} while (a0_796 == 0x00);
															break;
														}
														Eq_2 a0_465;
														word32 s1_1523;
														word32 a1_1524;
														word32 s4_1525;
														Eq_2 a3_468;
														ra = mbedtls_mpi_shift_r(ra, (uint32 **) 0x01, a2_107, a5_458 & 0x01, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1523, out a0_465, out a1_1524, out a2_107, out a3_468, out a4_109, out a5_110, out s2_1018, out s3_11, out s4_1525, out s8);
														if (a0_465 != 0x00)
															break;
														ui32 a5_488 = *a5_110;
														ra = dwArg0164;
														a5_110 = a5_488 & 0x01;
														if ((a5_488 & 0x01) == 0x00)
														{
															ui32 a5_491 = *(a5_488 & 0x01);
															a3_468 = dwArg0164;
															a5_110 = a5_491 & 0x01;
															if ((a5_491 & 0x01) == 0x00)
																goto l23093454;
														}
														Eq_2 a0_505;
														Eq_2 a3_508;
														word32 a7_1570;
														word32 s4_1571;
														word32 s1_1568;
														word32 a1_1569;
														word32 s0_1567;
														ra = mbedtls_mpi_add_mpi(dwArg0164, a0_465, fp + -56, a3_468, a4_109, a5_110, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1567, out s1_1568, out a0_505, out a1_1569, out a2_107, out a3_508, out a4_109, out a5_110, out a7_1570, out s2_1018, out s3_11, out s4_1571, out s8);
														if (a0_505 != 0x00)
															break;
														word32 a0_531;
														word32 s4_1584;
														word32 a7_1583;
														word32 a3_1582;
														word32 s1_1581;
														word32 s0_1580;
														ra = mbedtls_mpi_sub_mpi(ra, a0_505, fp + -44, a3_508, a4_109, a5_110, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1580, out s1_1581, out a0_531, out a2_107, out a3_1582, out a4_109, out a5_110, out a7_1583, out s2_1018, out s3_11, out s4_1584, out s8);
														if (a0_531 != 0x00)
															break;
l23093454:
														word32 a0_562;
														word32 a3_1574;
														word32 s4_1575;
														word32 s1_1572;
														word32 a1_1573;
														ra = mbedtls_mpi_shift_r(ra, (uint32 **) 0x01, a2_107, a5_110, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1572, out a0_562, out a1_1573, out a2_107, out a3_1574, out a4_109, out a5_110, out s2_1018, out s3_11, out s4_1575, out s8);
														if (a0_562 != 0x00)
															break;
														Eq_2 a0_586;
														word32 s4_1579;
														word32 a3_1578;
														word32 s1_1576;
														word32 a1_1577;
														ra = mbedtls_mpi_shift_r(ra, (uint32 **) 0x01, a2_107, a5_110, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1576, out a0_586, out a1_1577, out a2_107, out a3_1578, out a4_109, out a5_110, out s2_1018, out s3_11, out s4_1579, out s8);
														s0_300 = a0_586;
													} while (a0_586 == 0x00);
													break;
												}
												Eq_2 a0_312;
												Eq_2 a3_315;
												word32 s4_1522;
												word32 s1_1520;
												word32 a1_1521;
												ra = mbedtls_mpi_shift_r(ra, (uint32 **) 0x01, a2_107, a5_305 & 0x01, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1520, out a0_312, out a1_1521, out a2_107, out a3_315, out a4_109, out a5_110, out s2_1018, out s3_11, out s4_1522, out s8);
												if (a0_312 != 0x00)
													break;
												ui32 a5_335 = *a5_110;
												a5_110 = a5_335 & 0x01;
												if ((a5_335 & 0x01) == 0x00)
												{
													ui32 a5_338 = *(a5_335 & 0x01);
													a5_110 = a5_338 & 0x01;
													if ((a5_338 & 0x01) == 0x00)
														goto l230933BE;
												}
												Eq_2 a0_352;
												Eq_2 a3_355;
												word32 s0_1594;
												word32 s1_1595;
												word32 a1_1596;
												word32 a7_1597;
												word32 s4_1598;
												ra = mbedtls_mpi_add_mpi(ra, a0_312, fp + -0x0068, a3_315, a4_109, a5_110, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1594, out s1_1595, out a0_352, out a1_1596, out a2_107, out a3_355, out a4_109, out a5_110, out a7_1597, out s2_1018, out s3_11, out s4_1598, out s8);
												if (a0_352 != 0x00)
													break;
												word32 a0_378;
												word32 s0_1607;
												word32 s1_1608;
												word32 a3_1609;
												word32 a7_1610;
												word32 s4_1611;
												ra = mbedtls_mpi_sub_mpi(ra, a0_352, fp + -92, a3_355, a4_109, a5_110, s2_1018, mstatus, 0x01, dwArg28, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_1607, out s1_1608, out a0_378, out a2_107, out a3_1609, out a4_109, out a5_110, out a7_1610, out s2_1018, out s3_11, out s4_1611, out s8);
												if (a0_378 != 0x00)
													break;
l230933BE:
												word32 a0_409;
												word32 s1_1599;
												word32 a1_1600;
												word32 a3_1601;
												word32 s4_1602;
												ra = mbedtls_mpi_shift_r(ra, (uint32 **) 0x01, a2_107, a5_110, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1599, out a0_409, out a1_1600, out a2_107, out a3_1601, out a4_109, out a5_110, out s2_1018, out s3_11, out s4_1602, out s8);
												if (a0_409 != 0x00)
													break;
												word32 s1_1603;
												word32 a1_1604;
												word32 a3_1605;
												word32 s4_1606;
												ra = mbedtls_mpi_shift_r(ra, (uint32 **) 0x01, a2_107, a5_110, mstatus, dwLoc90, 0x00, 0x00, dwLoc58, dwArg68, dwArgA8, dwArgE8, out s1_1603, out a0_278, out a1_1604, out a2_107, out a3_1605, out a4_109, out a5_110, out s2_1018, out s3_11, out s4_1606, out s8);
											}
										}
									}
								}
							}
						}
					}
				}
			}
		}
		Eq_2 a2_903;
		Eq_2 a5_904;
		Eq_2 a4_907;
		word32 a6_1440;
		word32 s4_1441;
		word32 a3_1439;
		word32 a0_1437;
		word32 a1_1438;
		mbedtls_mpi_free(fp + -0x0080, a2_107, a4_109, a5_110, mstatus, dwArgB8, dwArgF8, out a0_1437, out a1_1438, out a2_903, out a3_1439, out a4_907, out a5_904, out a6_1440, out s4_1441);
		Eq_2 a2_915;
		Eq_2 a5_916;
		Eq_2 a4_919;
		word32 s4_1446;
		word32 a3_1444;
		word32 a6_1445;
		word32 a0_1442;
		word32 a1_1443;
		mbedtls_mpi_free(fp + -116, a2_903, a4_907, a5_904, mstatus, dwArgB8, dwArgF8, out a0_1442, out a1_1443, out a2_915, out a3_1444, out a4_919, out a5_916, out a6_1445, out s4_1446);
		Eq_2 a2_927;
		Eq_2 a5_928;
		Eq_2 a4_931;
		word32 a1_1448;
		word32 a6_1450;
		word32 a3_1449;
		word32 a0_1447;
		word32 s4_1451;
		mbedtls_mpi_free(fp + -0x0068, a2_915, a4_919, a5_916, mstatus, dwArgB8, dwArgF8, out a0_1447, out a1_1448, out a2_927, out a3_1449, out a4_931, out a5_928, out a6_1450, out s4_1451);
		Eq_2 a2_939;
		Eq_2 a5_940;
		Eq_2 a4_943;
		word32 a1_1453;
		word32 a0_1452;
		word32 a3_1454;
		word32 s4_1456;
		word32 a6_1455;
		mbedtls_mpi_free(fp + -92, a2_927, a4_931, a5_928, mstatus, dwArgB8, dwArgF8, out a0_1452, out a1_1453, out a2_939, out a3_1454, out a4_943, out a5_940, out a6_1455, out s4_1456);
		Eq_2 a2_951;
		Eq_2 a5_952;
		Eq_2 a4_955;
		word32 a6_1460;
		word32 a1_1458;
		word32 a3_1459;
		word32 s4_1461;
		word32 a0_1457;
		mbedtls_mpi_free(fp + -0x008C, a2_939, a4_943, a5_940, mstatus, dwArgB8, dwArgF8, out a0_1457, out a1_1458, out a2_951, out a3_1459, out a4_955, out a5_952, out a6_1460, out s4_1461);
		Eq_2 a2_963;
		Eq_2 a5_964;
		Eq_2 a4_967;
		word32 a1_1463;
		word32 a3_1464;
		word32 s4_1466;
		word32 a0_1462;
		word32 a6_1465;
		mbedtls_mpi_free(fp + -80, a2_951, a4_955, a5_952, mstatus, dwArgB8, dwArgF8, out a0_1462, out a1_1463, out a2_963, out a3_1464, out a4_967, out a5_964, out a6_1465, out s4_1466);
		Eq_2 a2_975;
		Eq_2 a5_976;
		Eq_2 a4_979;
		word32 a6_1470;
		word32 a1_1468;
		word32 a3_1469;
		word32 s4_1471;
		word32 a0_1467;
		mbedtls_mpi_free(fp + -0x0044, a2_963, a4_967, a5_964, mstatus, dwArgB8, dwArgF8, out a0_1467, out a1_1468, out a2_975, out a3_1469, out a4_979, out a5_976, out a6_1470, out s4_1471);
		Eq_2 a2_987;
		Eq_2 a5_988;
		Eq_2 a4_991;
		word32 a1_1473;
		word32 a3_1474;
		word32 a6_1475;
		word32 s4_1476;
		word32 a0_1472;
		mbedtls_mpi_free(fp + -56, a2_975, a4_979, a5_976, mstatus, dwArgB8, dwArgF8, out a0_1472, out a1_1473, out a2_987, out a3_1474, out a4_991, out a5_988, out a6_1475, out s4_1476);
		word32 a6_1480;
		word32 a4_1479;
		word32 a0_1477;
		word32 a1_1478;
		s1_1005 = mbedtls_mpi_free(fp + -44, a2_987, a4_991, a5_988, mstatus, dwArgB8, dwArgF8, out a0_1477, out a1_1478, out a2_1306, out a3_1002, out a4_1479, out a5_1000, out a6_1480, out s4);
	}
	s1Out = s1_1005;
	a0Out = dwLoc8C;
	a2Out = a2_1306;
	a3Out = a3_1002;
	a4Out = dwLoc70;
	a5Out = a5_1000;
	s2Out = s2_1018;
	s3Out = s3_11;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

