pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 230934D8: Register Eq_2 mbedtls_cipher_get_block_size(Register Eq_2 a0, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_cipher_update
//      mbedtls_cipher_finish
Eq_2 mbedtls_cipher_get_block_size(Eq_2 a0, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 == 0x00 || a5 == 0x00)
	{
		a5Out = a5;
		return <invalid>;
	}
	else
	{
		a5Out = *(union Eq_2 *) 0x14;
		return <invalid>;
	}
}

// 230934E8: void add_pkcs_padding(Register ptr32 a0, Register word32 a1, Register int32 a2)
void add_pkcs_padding(ptr32 a0, word32 a1, int32 a2)
{
	Eq_536416 a1_5 = a1 - a2;
	Eq_536416 a5_15 = 0x00;
	while (a5_15 < a1_5)
	{
		(word32) a5_15 + a0 + a2 = (byte *) (byte) a1_5;
		a5_15 = (word32) a5_15 + 1 & 0x00FF;
	}
}

struct Eq_537297 * g_ptr230934F4 = &g_t973200F5;
// 23093504: void get_pkcs_padding(Register ptr32 a0, Register Eq_536430 a1, Register (ptr32 Eq_536430) a2)
void get_pkcs_padding(ptr32 a0, Eq_536430 a1, union Eq_536430 * a2)
{
	if (a0 == 0x00 || a2 == null)
		return;
	Eq_536430 a6_10 = (word32) ((word32) a1 + a0 + -1);
	Eq_536430 a7_12 = a1 - a6_10;
	*a2 = (union Eq_536430 *) a7_12;
	ui32 a5_14 = (word32) (a1 < a6_10) | (word32) (a6_10 < 1);
	Eq_536430 a4_16 = 0x00;
	while (a4_16 != a1)
	{
		a4_16 = (word32) a4_16 + 1;
		a5_14 = (a5_14 | ((word32) (a4_16 < a7_12) ^ 1) + (a6_10 ^ (word32) (*((word32) a4_16 + a0)))) & 0x00FF;
	}
	if (a5_14 != 0x00)
		;
}

// 23093560: void add_zeros_padding(Register ptr32 a0, Register Eq_536474 a1, Register Eq_536474 a2)
void add_zeros_padding(ptr32 a0, Eq_536474 a1, Eq_536474 a2)
{
	while (a2 < a1)
	{
		*((word32) a2 + a0) = 0x00;
		a2 = (word32) a2 + 1;
	}
}

struct Eq_537297 * g_ptr2309356C = &g_t6050007;
// 23093572: void get_no_padding(Register word32 a0, Register (ptr32 word32) a1, Register word32 a2)
void get_no_padding(word32 a0, word32 * a1, word32 a2)
{
	if (a0 == 0x00 || a2 == 0x00)
		return;
	*a1 = a2;
}

// 23093584: void get_zeros_padding(Register ptr32 a0, Register (ptr32 Eq_536493) a1, Register (ptr32 word32) a2)
void get_zeros_padding(ptr32 a0, struct Eq_536493 * a1, word32 * a2)
{
	if (a0 == 0x00 || a2 == null)
		return;
	*a2 = 0x00;
	ui32 a5_16 = 0x00;
	while (a1 != null)
	{
		struct Eq_536493 * a3_10 = (char *) a1 - 1;
		ui32 a4_17 = (word32) ((word32) a3_10[a0] != 0x00) | a5_16;
		*(a1 + (a5_16 ^ a4_17) | a1) = a1->dw0000;
		a1 = a3_10;
		a5_16 = a4_17;
	}
}

// 230935C0: Register (ptr32 Eq_505722) mbedtls_cipher_info_from_type(Register (ptr32 Eq_505722) a0, Register (ptr32 Eq_505722) a4, Register out (ptr32 byte) a5Out)
// Called from:
//      mbedtls_ssl_derive_keys
struct Eq_505722 * mbedtls_cipher_info_from_type(struct Eq_505722 * a0, struct Eq_505722 * a4, byte & a5Out)
{
	do
	{
		byte * a5_7 = a4->ptr0004;
	} while (a4 != null && (word32) (*a5_7) != a0);
	a5Out = a5_7;
	return a4;
}

// 230935DC: Register (ptr32 Eq_506254) mbedtls_cipher_info_from_values(Register (ptr32 Eq_506254) a0, Register (ptr32 Eq_506254) a1, Register (ptr32 Eq_506254) a2, Register (ptr32 Eq_506254) a3, Register (ptr32 Eq_506254) a5, Register out (ptr32 Eq_506254) a4Out)
// Called from:
//      mbedtls_gcm_setkey
struct Eq_506254 * mbedtls_cipher_info_from_values(struct Eq_506254 * a0, struct Eq_506254 * a1, struct Eq_506254 * a2, struct Eq_506254 * a3, struct Eq_506254 * a5, struct Eq_506254 & a4Out)
{
	while (true)
	{
		struct Eq_506254 * a4_7 = a5->ptr0004;
		if (a5 == null)
			break;
		a5 = a3->ptr0018;
		a3 = (word32) a3->b0000;
		if (a3 == a0)
		{
			a5 = a3->ptr0004;
			if (a3 == a1)
			{
				a3 = (word32) a5->b0001;
				if (a3 == a2)
					break;
			}
		}
	}
	a4Out = a4_7;
	return a5;
}

// 23093608: Register Eq_2 mbedtls_cipher_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      mbedtls_ssl_setup
Eq_2 mbedtls_cipher_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	return memset(ra, a0, 0x00, 64, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 23093612: Register word32 mbedtls_cipher_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_transform_free
//      mbedtls_gcm_setkey
//      mbedtls_gcm_free
word32 mbedtls_cipher_free(Eq_2 ra, Eq_2 a0, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a5Out = a5;
		return a2;
	}
	else
	{
		Eq_2 s0_17 = a0;
		word32 a0_10 = *((word32) a0 + 60);
		if (a0_10 != 0x00)
		{
			<anonymous> * a5_14 = *((word32) *((word32) a5 + 24) + 32);
			word32 a2_20;
			a5_14();
		}
		Eq_2 a5_22 = (word32) s0_17 + 64;
		while (s0_17 != a5_22)
		{
			*s0_17 = 0x00;
			s0_17 = (word32) s0_17 + 1;
		}
		a5Out = a5_22;
		return dwArg10;
	}
}

// 23093642: Register Eq_2 mbedtls_cipher_setkey(Register Eq_2 a0, Register (ptr32 Eq_506254) a2, Register word32 a3, Register (ptr32 Eq_506564) a4, Register (ptr32 Eq_506565) a5, Register out (ptr32 Eq_506564) a4Out, Register out (ptr32 Eq_506565) a5Out)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_gcm_setkey
Eq_2 mbedtls_cipher_setkey(Eq_2 a0, struct Eq_506254 * a2, word32 a3, struct Eq_506564 * a4, struct Eq_506565 * a5, struct Eq_506564 & a4Out, struct Eq_506565 & a5Out)
{
	if (a0 != 0x00)
	{
		struct Eq_506254 * a0_6 = a5->ptr0000;
		if (a5 == null)
			goto l23093680;
		a5 = a4->ptr0010;
		a4 &= 0x02;
		if ((a4 & 0x02) == 0x00)
		{
			a5 = (a4 & 0x02)->ptr0004;
			if ((a4 & 0x02) != a2)
				goto l23093680;
		}
		struct Eq_536631 * a5_25;
		<anonymous> * t1_26;
		a2->ptr0004 = a0_6;
		a0_6->b0008 = (byte) a3;
		a4 = (struct Eq_506564 *) 0x01;
		if (a3 == 0x01)
		{
l2309366C:
			a5_25 = a5->ptr0018;
			t1_26 = a5_25->ptr0014;
			goto l23093672;
		}
		a4 = (word32) a5->b0001 + ~0x02 & 0x00FD;
		if (a4 == null)
			goto l2309366C;
		if (a3 == 0x00)
		{
			a5_25 = a5->ptr0018;
			t1_26 = a5_25->ptr0018;
l23093672:
			Eq_2 a0_47;
			struct Eq_506565 * a5_48;
			struct Eq_506564 * a4_49;
			word32 t1_52;
			t1_26();
			a4Out = a4_49;
			a5Out = a5_48;
			return a0_47;
		}
	}
l23093680:
	a4Out = a4;
	a5Out = a5;
	return ~0x060000FF;
}

// 23093688: Register Eq_2 mbedtls_cipher_set_iv(Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_cipher_crypt
Eq_2 mbedtls_cipher_set_iv(word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = ~0x060000FF;
		a1Out = a1;
		a3Out = a3;
		a5Out = a5;
		return s1;
	}
	ptr32 a0_21;
	Eq_2 a0_14 = *a5;
	if (a5 != 0x00 && a1 != 0x00)
	{
		Eq_2 s0_19 = a2;
		if (a2 > 0x10)
		{
			a0_21 = ~0x0600007F;
			goto l230936BE;
		}
		Eq_2 a5_22 = *(union Eq_2 *) 0x20;
		if (false)
		{
l230936B0:
			word32 a6_133;
			word32 a7_134;
			word32 a4_132;
			word32 a2_131;
			memcpy((word32) a0_14 + 40, a1, s0_19, out a1, out a2_131, out a3, out a4_132, out a5, out a6_133, out a7_134);
			*((word32) s0_19 + 56) = a0_14;
			a0_21 = 0x00;
l230936BE:
			a0Out = a0_21;
			a1Out = a1;
			a3Out = a3;
			a5Out = a5;
			return a0_14;
		}
		a5 = *((word32) a5_22 + 0x0C);
		if (a2 >= a5)
		{
			s0_19 = a5;
			goto l230936B0;
		}
	}
	a0_21 = ~0x060000FF;
	goto l230936BE;
}

// 230936E0: Register Eq_2 mbedtls_cipher_reset(Register Eq_2 a0, Register Eq_2 a5)
// Called from:
//      mbedtls_cipher_crypt
Eq_2 mbedtls_cipher_reset(Eq_2 a0, Eq_2 a5)
{
	if (a0 == 0x00)
		return ~0x060000FF;
	struct Eq_536736 * a0_6 = *a5;
	if (a5 == 0x00)
		return ~0x060000FF;
	a0_6->dw0024 = 0x00;
	return 0x00;
}

// 230936F6: Register Eq_2 mbedtls_cipher_update(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out)
// Called from:
//      mbedtls_cipher_crypt
//      mbedtls_gcm_setkey
//      mbedtls_gcm_starts
//      mbedtls_gcm_update
Eq_2 mbedtls_cipher_update(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x060000FF;
		a1Out = a1;
		a3Out = a3;
		a5Out = a5;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		return ra;
	}
	Eq_2 s5_114;
	ptr32 a0_107;
	Eq_2 a0_24 = *a5;
	s5_114 = s5;
	if (a5 != 0x00)
	{
		s5_114 = a4;
		if (a4 != 0x00)
		{
			a4->u0 = 0x00;
			word32 a5_708;
			Eq_2 a0_35 = mbedtls_cipher_get_block_size(a0_24, a5, out a5_708);
			s6 = a3;
			Eq_2 s4_203 = a1;
			s1 = a2;
			Eq_2 s0_173 = *a4;
			a3.u0 = 0x01;
			s2 = a0_35;
			a5 = (word32) *((word32) a4 + 1);
			if (a5 == 0x01)
			{
				if (a0_35 == a2)
				{
					*a4 = a0_35;
					int32 a1_381 = (int32) *((word32) *a5 + 8);
					struct Eq_536838 * a5_383 = *((word32) a5 + 24);
					0x00 = (int8) dwArg0128;
					ptr32 a0_397;
					Eq_2 s0_398;
					Eq_2 ra_399;
					Eq_2 s1_400;
					Eq_2 s2_401;
					Eq_2 s3_402;
					Eq_2 s4_403;
					Eq_2 s5_404;
					Eq_2 s6_405;
					Eq_2 s7_406;
					Eq_2 a5_407;
					Eq_2 a3_409;
					Eq_2 a1_410;
					word32 t1_414;
					Eq_2 s8_416;
					ptr32 a7_417;
					word32 t0_418;
					word32 t4_419;
					word32 t5_420;
					word32 t6_421;
					a5_383->ptr0004();
					s0Out = s0_398;
					s1Out = s1_400;
					a0Out = a0_397;
					a1Out = a1_410;
					a3Out = a3_409;
					a5Out = a5_407;
					a7Out = a7_417;
					s2Out = s2_401;
					s3Out = s3_402;
					s4Out = s4_403;
					s5Out = s5_404;
					s6Out = s6_405;
					s7Out = s7_406;
					s8Out = s8_416;
					return ra_399;
				}
				a0_107 = ~0x0600027F;
				goto l23093706;
			}
			a3.u0 = 0x06;
			if (a5 == 0x06)
			{
				*a4 = a2;
				0x00 = (int8) dwArg0128;
				ptr32 a0_333;
				Eq_2 s0_334;
				Eq_2 s1_336;
				Eq_2 s2_337;
				Eq_2 s3_338;
				Eq_2 s4_339;
				Eq_2 s5_340;
				Eq_2 s6_341;
				Eq_2 s7_342;
				Eq_2 a5_343;
				Eq_2 a3_345;
				Eq_2 a1_346;
				Eq_2 s8_352;
				ptr32 a7_353;
				Eq_2 ra_335 = mbedtls_gcm_update(a0_35, a2, dwArg78, a3, out s0_334, out s1_336, out a0_333, out a1_346, out a3_345, out a5_343, out a7_353, out s2_337, out s3_338, out s4_339, out s5_340, out s6_341, out s7_342, out s8_352);
				s0Out = s0_334;
				s1Out = s1_336;
				a0Out = a0_333;
				a1Out = a1_346;
				a3Out = a3_345;
				a5Out = a5_343;
				a7Out = a7_353;
				s2Out = s2_337;
				s3Out = s3_338;
				s4Out = s4_339;
				s5Out = s5_340;
				s6Out = s6_341;
				s7Out = s7_342;
				s8Out = s8_352;
				return ra_335;
			}
			if (a0_35 == 0x00)
			{
				a0_107 = ~0x0600037F;
				goto l23093706;
			}
			if (a1 != a3)
			{
l230937C2:
				a3.u0 = 0x02;
				if (a5 != 0x02)
				{
					if (a5 == 0x03)
					{
						word32 s0_99 = *((word32) a0_35 + 60);
						word32 tp_122;
						word32 t3_123;
						word32 t1_124;
						word32 s8_126;
						word32 t6_440;
						word32 t5_439;
						word32 t4_438;
						word32 t0_437;
						(*((word32) a5 + 0x0C))();
					}
					else
					{
						a3.u0 = 0x05;
						if (a5 != 0x05)
						{
							a0_107 = ~0x0600007F;
							goto l23093706;
						}
						word32 s0_57 = *((word32) a0_35 + 60);
						word32 tp_90;
						word32 t3_91;
						word32 t1_92;
						word32 s8_94;
						word32 t6_436;
						word32 t5_435;
						word32 t0_433;
						word32 t4_434;
						(*((word32) a5 + 16))();
					}
					if (a0_107 != 0x00)
					{
l23093706:
						0x00 = (int8) dwArg0128;
						s0Out = dwArgE4;
						s1Out = s1;
						a0Out = a0_107;
						a1Out = a1;
						a3Out = a3;
						a5Out = a5;
						a7Out = a7;
						s2Out = s2;
						s3Out = s3;
						s4Out = dwArg78;
						s5Out = s5_114;
						s6Out = s6;
						s7Out = s7;
						s8Out = s5;
						return ra;
					}
					goto l230938A0;
				}
				else
				{
					a5 = (int32) *((word32) s0_173 + 8);
					s3 = *((word32) s0_173 + 36);
					if (a5 == 0x00)
					{
						a5 = a0_35 - s3;
						if (a5 >= a2)
							goto l230937DA;
					}
					else if (a5 == 0x01)
					{
						a5 = a0_35 - s3;
						if (a2 < a5)
						{
l230937DA:
							word32 a6_711;
							word32 a2_709;
							word32 a4_710;
							memcpy((word32) s0_173 + ((word32) s3 + 20), a1, a2, out a1, out a2_709, out a3, out a4_710, out a5, out a6_711, out a7);
							s1 = a2 + a5;
							*((word32) s1 + 36) = *((word32) a5 + 36);
							goto l230937EE;
						}
					}
					if (s3 != 0x00)
					{
						Eq_2 s7_136 = a0_35 - s3;
						Eq_2 a0_142 = (word32) s0_173 + ((word32) s3 + 20);
						struct Eq_537022 * a5_144;
						word32 a1_712;
						word32 a4_715;
						word32 a6_716;
						word32 a7_717;
						word32 a2_713;
						word32 a3_714;
						memcpy(a0_142, a1, s7_136, out a1_712, out a2_713, out a3_714, out a4_715, out a5_144, out a6_716, out a7_717);
						word32 s0_159 = *((word32) a0_142 + 60);
						word32 s4_178;
						word32 tp_187;
						word32 t3_188;
						word32 t1_189;
						word32 a6_190;
						word32 s8_191;
						word32 t0_193;
						word32 t4_194;
						word32 t5_195;
						word32 t6_196;
						a5_144->ptr0018->ptr0008();
						if (a0_107 != 0x00)
							goto l23093706;
						a5 = Mem28[s5_114 + 0x00:int32] + s2;
						*s5_114 = a5;
						((word32) s0_173 + 36)->u0 = 0x00;
						s6 += s2;
						s4_203 = (word32) s7 + s4_178;
						s1 = s1 + s3 - s2;
					}
					if (s1 != 0x00)
					{
						Eq_2 s3_207 = s1 & s2;
						if (s3_207 == 0x00 && (int32) (*((word32) s0_173 + 8)) == 0x00)
							s3_207 = s2;
						s1 -= s3_207;
						Eq_2 a0_220 = (word32) s0_173 + 20;
						word32 a4_719;
						word32 a6_720;
						word32 a2_718;
						memcpy(a0_220, s4_203 + s1, s3_207, out a1, out a2_718, out a3, out a4_719, out a5, out a6_720, out a7);
						s3 = s3_207 + a5;
						*((word32) *((word32) a5 + 36) + 36) = s3;
						if (s1 != 0x00)
						{
							word32 s0_240 = *((word32) a0_220 + 60);
							word32 tp_275;
							word32 t3_276;
							word32 t1_277;
							word32 a6_278;
							word32 s8_279;
							word32 t0_281;
							word32 t4_282;
							word32 t5_283;
							word32 t6_284;
							(*((word32) *((word32) a5 + 24) + 8))();
							if (a0_107 != 0x00)
								goto l23093706;
							a5 = *s5_114;
							s1 += a5;
l230938A0:
							*s5_114 = s1;
							goto l23093706;
						}
					}
l230937EE:
					a0_107 = 0x00;
					goto l23093706;
				}
			}
			s0_173 = *(union Eq_2 *) 0x2A;
			if (false)
			{
				a3 = a2 & a0_35;
				if (a3 == 0x00)
					goto l230937C2;
			}
		}
	}
	a0_107 = ~0x060000FF;
	goto l23093706;
}

