pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309390A: Register Eq_2 mbedtls_cipher_finish(Register Eq_2 ra, Register word32 s0, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register (ptr32 Eq_511822) a3, Register Eq_2 a5, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_511822) a3Out, Register out Eq_537148 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_2) s3Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_cipher_crypt
Eq_2 mbedtls_cipher_finish(Eq_2 ra, word32 s0, Eq_2 a0, Eq_2 a1, union Eq_2 * a2, struct Eq_511822 * a3, Eq_2 a5, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, struct Eq_511822 & a3Out, union Eq_537148 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 s0_115;
	if (a0 != 0x00)
	{
		s1 = *a5;
		if (a5 != 0x00 && a2 != null)
		{
			*a2 = (union Eq_2 *) 0x00;
			Eq_2 a0_25 = a3->t0000;
			a5.u0 = 0x03;
			a4 = (word32) a3->b0001;
			if (a4 != 0x03)
			{
				a5 = (word32) a4 - 5 & 0x00FF;
				if (a5 > 0x02)
				{
					a5.u0 = 0x01;
					if (a4 == 0x01)
					{
						s0_115 = 0x00;
						if (false)
							goto l23093972;
						goto l2309394C;
					}
					if (a4 != 0x02)
					{
						s0_115 = ~0x0600007F;
						goto l23093972;
					}
					a4.u0 = (int32) *((word32) a0_25 + 8);
					s3 = a2;
					Eq_2 s4_37 = a1;
					s2 = *((word32) a0_25 + 36);
					if (a4 == 0x01)
					{
						Eq_2 a0_43 = *(union Eq_2 *) 0x0D;
						if (false)
						{
							s0_115 = 0x00;
							if (s2 == 0x00)
								goto l23093972;
							goto l2309394C;
						}
						Eq_2 s1_44 = *((word32) a1 + 56);
						if (a1 == 0x00)
							a3 = (struct Eq_511822 *) *((word32) a1 + 0x0C);
						word32 a4_70;
						word32 t1_75;
						(*(<anonymous> *) 0x01)();
l23093990:
						struct Eq_537234 * a5_80;
						Eq_2 a0_79 = mbedtls_cipher_get_block_size(s1, a5, out a5_80);
						word32 s1_87 = *((word32) a0_79 + 60);
						struct Eq_537243 * sp_98;
						ptr32 a0_105;
						word32 t1_114;
						a5_80->ptr0018->ptr0008();
						s0_115 = a0_105;
						if (a0_105 == 0x00)
						{
							word32 a5_281;
							Eq_2 a0_117 = mbedtls_cipher_get_block_size(s1, a5, out a5_281);
							a5 = (int32) *((word32) s1 + 8);
							a1 = a0_117;
							if (a5 == 0x00)
							{
								word32 s4_125 = sp_98->dw0024;
								Eq_2 ra_132;
								Eq_2 s1_134;
								Eq_2 s2_135;
								union Eq_2 * s3_136;
								ptr32 s4_137;
								ptr32 a0_138;
								Eq_2 a5_139;
								struct Eq_511822 * a3_141;
								Eq_537148 a4_142;
								Eq_2 a1_144;
								word32 t1_147;
								(*((word32) s1 + 16))();
								s1Out = s1_134;
								a0Out = a0_138;
								a1Out = a1_144;
								a3Out = a3_141;
								a4Out = a4_142;
								a5Out = a5_139;
								s2Out = s2_135;
								s3Out = s3_136;
								s4Out = s4_137;
								return ra_132;
							}
							*s3 = (union Eq_2 *) a0_117;
						}
l23093972:
						s1Out = s1;
						a0Out = s0_115;
						a1Out = a1;
						a3Out = a3;
						a4Out = a4;
						a5Out = a5;
						s2Out = s2;
						s3Out = s3;
						s4Out = dwArg04;
						return ra;
					}
					if (mbedtls_cipher_get_block_size(a0_25, 0x01, out a5) == s2)
						goto l23093990;
					s1 = *((byte) a5.u0 + 0x0C);
					if (a5 != 0x00 || s2 != 0x00)
					{
l2309394C:
						s0_115 = ~0x0600027F;
						goto l23093972;
					}
				}
			}
			s0_115 = 0x00;
			goto l23093972;
		}
	}
	s0_115 = ~0x060000FF;
	goto l23093972;
}

// 23093A06: Register Eq_2 mbedtls_cipher_set_padding_mode(Register Eq_2 a0, Register word32 a1, Register (ptr32 Eq_506521) a5, Register out ptr32 a4Out, Register out (ptr32 Eq_506521) a5Out)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_cipher_setup
Eq_2 mbedtls_cipher_set_padding_mode(Eq_2 a0, word32 a1, struct Eq_506521 * a5, ptr32 & a4Out, struct Eq_506521 & a5Out)
{
	if (a0 != 0x00)
	{
		struct Eq_537297 * a0_6 = a5->ptr0000;
		a4 = (word32) a5->b0001;
		a5 = (struct Eq_506521 *) 0x02;
		if (a4 == 0x02)
		{
			struct Eq_506521 * a5_17;
			if (a1 != 0x03)
			{
				if (a1 != 0x04)
				{
					if (a1 != 0x00)
					{
						a4Out = a4;
						a5Out = (struct Eq_506521 *) 0x04;
						return ~0x0600007F;
					}
					g_ptr230934F4 = a0_6;
					a5_17 = &g_t23093504;
				}
				else
				{
					a0_6->dw000C = 0x00;
					a5_17 = &g_t23093572;
				}
			}
			else
			{
				g_ptr2309356C = a0_6;
				a5_17 = &g_t23093584;
			}
			a5_17->ptr0010 = a0_6;
			a4Out = a4;
			a5Out = a5_17;
			return 0x00;
		}
	}
	a4Out = a4;
	a5Out = a5;
	return ~0x060000FF;
}

// 23093A6C: Register Eq_2 mbedtls_cipher_setup(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_506254) a1, Register out (ptr32 Eq_2) s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out (ptr32 Eq_506521) a5Out)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_gcm_setkey
Eq_2 mbedtls_cipher_setup(Eq_2 ra, Eq_2 a0, struct Eq_506254 * a1, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a4Out, struct Eq_506521 & a5Out)
{
	if (a1 == null)
	{
		s1Out = s1;
		a0Out = ~0x060000FF;
		a4Out = a4;
		a5Out = a5;
		return ra;
	}
	else
	{
		ptr32 a0_16;
		if (a0 != 0x00)
		{
			word32 a0_20;
			word32 a1_21;
			struct Eq_537344 * a5_25;
			Eq_2 s0_33;
			struct Eq_537346 * a0_36;
			word32 a2_37;
			word32 tp_39;
			word32 a3_40;
			word32 t0_42;
			word32 t1_43;
			a5_25->ptr001C();
			a0_36->t003C = s0_33;
			if (a0_36 != null)
			{
				*s1 = (union Eq_2 *) s0_33;
				mbedtls_cipher_set_padding_mode(s0_33, 0x00, a5, out a4, out a5);
				a0_16 = 0x00;
			}
			else
				a0_16 = ~0x0600017F;
		}
		else
			a0_16 = ~0x060000FF;
		s1Out = s1;
		a0Out = a0_16;
		a4Out = a4;
		a5Out = a5;
		return ra;
	}
}

// 23093ABE: Register Eq_2 mbedtls_cipher_crypt(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_511817) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 word32) a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_511822) a3Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out)
// Called from:
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_cipher_crypt(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s5, Eq_2 s7, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgB4, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgF8, Eq_2 dwArg0128, struct Eq_511817 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, word32 & a1Out, ptr32 & a2Out, struct Eq_511822 & a3Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out)
{
	Eq_2 s3_147 = a3;
	Eq_2 s4_148 = a4;
	Eq_2 s2_146 = a5;
	Eq_2 a5_100;
	struct Eq_511822 * a3_139;
	word32 * a1_138;
	ptr32 a0_137;
	Eq_2 s1_145 = mbedtls_cipher_set_iv(a0, a1, a2, a5, out a0_137, out a1_138, out a3_139, out a5_100);
	if (a0_137 == 0x00)
	{
		a0_137 = mbedtls_cipher_reset(s1_145, a5_100);
		if (a0_137 == 0x00)
		{
			word32 s0_169;
			word32 a7_170;
			word32 s6_171;
			word32 s7_172;
			word32 s8_173;
			ra = mbedtls_cipher_update(ra, s1_145, a3, a4, a5, a6, a5_100, a3, s5, s7, dwArg08, dwArg48, dwArg68, dwArg88, dwArgB4, dwArgD0, dwArgD4, dwArgF8, out s0_169, out s1_145, out a0_137, out a1_138, out a3_139, out a5_100, out a7_170, out s2_146, out s3_147, out s4_148, out s5, out s6_171, out s7_172, out s8_173);
			if (a0_137 == 0x00)
			{
				word32 a4_90;
				ra = mbedtls_cipher_finish(ra, *a1_138, s1_145, a1_138 + s2_146, fp + -36, a3_139, a5_100, out s1_145, out a0_137, out a1_138, out a3_139, out a4_90, out a5_100, out s2_146, out s3_147, out s4_148);
				if (a0_137 == 0x00)
				{
					a5_100 = (word32) a5_100 + a4_90;
					*a5_100 = *a5_100;
				}
			}
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_145;
	a0Out = a0_137;
	a1Out = a1_138;
	a2Out = dwArg0100;
	a3Out = a3_139;
	a5Out = a5_100;
	s2Out = s2_146;
	s3Out = s3_147;
	s4Out = s4_148;
	s5Out = s5;
	return ra;
}

