pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23093B1A: Register Eq_2 mbedtls_cipher_auth_encrypt(Register Eq_2 ra, Register (ptr32 Eq_511462) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a6, Register Eq_2 s5, Register (ptr32 Eq_2) t4, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack word32 dwArgAC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_511475) s0Out, Register out ptr32 a0Out, Register out (ptr32 Eq_511477) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_511479) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out)
// Called from:
//      mbedtls_ssl_write_record
Eq_2 mbedtls_cipher_auth_encrypt(Eq_2 ra, struct Eq_511462 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a6, Eq_2 s5, union Eq_2 * t4, Eq_2 dwArg38, Eq_2 dwArg84, Eq_2 dwArgA8, word32 dwArgAC, Eq_2 dwArg0128, Eq_2 dwArg0198, struct Eq_511475 & s0Out, ptr32 & a0Out, struct Eq_511477 & a5Out, ptr32 & s2Out, struct Eq_490569 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out)
{
	struct Eq_537448 * t5_5 = a0->ptr0000;
	0x00 = dwArgAC;
	if ((word32) t5_5->b0001 != 0x06)
	{
		s0Out = dwArg08;
		a0Out = ~0x0600007F;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return ra;
	}
	else
	{
		*t4 = (union Eq_2 *) a6;
		Eq_2 a0_23 = a0->t003C;
		ptr32 a0_36;
		struct Eq_511477 * a5_41;
		struct Eq_511475 * s0_45;
		ptr32 s2_47;
		struct Eq_490569 * s3_48;
		ptr32 s4_49;
		Eq_2 s5_50;
		ptr32 s6_51;
		word32 s1_117;
		Eq_2 ra_44 = mbedtls_gcm_crypt_and_tag(ra, a0_23, 0x01, a1, a2, a4, s5, dwArg38, a6, dwArg84, dwArgA8, dwArg0128, dwArg0198, out s0_45, out s1_117, out a0_36, out a5_41, out s2_47, out s3_48, out s4_49, out s5_50, out s6_51);
		s0Out = s0_45;
		a0Out = a0_36;
		a5Out = a5_41;
		s2Out = s2_47;
		s3Out = s3_48;
		s4Out = s4_49;
		s5Out = s5_50;
		s6Out = s6_51;
		return ra_44;
	}
}

// 23093B56: Register word32 mbedtls_cipher_auth_decrypt(Register (ptr32 Eq_517251) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_517125 a6, Register Eq_2 a7, Register Eq_2 s5, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0154, Register out (ptr32 Eq_517263) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_517266) a5Out, Register out Eq_517267 s2Out, Register out ptr32 s3Out)
// Called from:
//      mbedtls_ssl_read_record_layer
word32 mbedtls_cipher_auth_decrypt(struct Eq_517251 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_517125 a6, Eq_2 a7, Eq_2 s5, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArgC8, Eq_2 dwArg0138, Eq_2 dwArg0154, struct Eq_517263 & s0Out, ptr32 & s1Out, ptr32 & a0Out, struct Eq_517266 & a5Out, union Eq_517267 & s2Out, ptr32 & s3Out)
{
	if ((word32) a0->ptr0000->b0001 != 0x06)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x0600007F;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		return ra;
	}
	else
	{
		0x00 = (int8) dwArg0154;
		*a1 = a6;
		struct Eq_517263 * s0_43;
		ptr32 s1_44;
		Eq_517267 s2_45;
		ptr32 s3_46;
		ptr32 a0_34;
		word32 ra_42 = mbedtls_gcm_auth_decrypt(a0->t003C, a1, a2, a4, a7, s5, dwArg24, dwArg48, dwArgC8, dwArg0138, out s0_43, out s1_44, out a0_34, out s2_45, out s3_46);
		if (a0_34 == ~0x11)
			a0_34 = ~0x060002FF;
		s0Out = s0_43;
		s1Out = s1_44;
		a0Out = a0_34;
		a5Out = (struct Eq_517266 *) ~0x11;
		s2Out = s2_45;
		s3Out = s3_46;
		return ra_42;
	}
}

// 23093BA4: void gcm_ctx_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void gcm_ctx_free(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_13 = mbedtls_gcm_free(ra, a0, a5);
	word32 s0_36;
	word32 s1_37;
	word32 a0_38;
	word32 a1_39;
	word32 a2_40;
	word32 a3_41;
	word32 a4_42;
	word32 a5_43;
	word32 a6_44;
	word32 s4_45;
	word32 t3_46;
	vPortFree(a0, dwArg10, a5_13, mstatus, dwArg0158, dwArg0198, out s0_36, out s1_37, out a0_38, out a1_39, out a2_40, out a3_41, out a4_42, out a5_43, out a6_44, out s4_45, out t3_46);
}

// 23093BBC: void gcm_ctx_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void gcm_ctx_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 0x0188, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
		mbedtls_gcm_init(ra_21, 0x01);
}

// 23093BDE: void gcm_aes_setkey_wrap(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_506254) a2, Register (ptr32 Eq_506254) a5, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8)
void gcm_aes_setkey_wrap(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_506254 * a2, struct Eq_506254 * a5, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8)
{
	mbedtls_gcm_setkey(ra, s1, a0, (struct Eq_506254 *) 0x02, a2, a5, s3, s5, s7, dwArg38, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8);
}

// 23093BE8: void aes_ctx_free(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void aes_ctx_free(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_11 = mbedtls_aes_free(a0);
	word32 s0_34;
	word32 s1_35;
	word32 a0_36;
	word32 a1_37;
	word32 a2_38;
	word32 a3_39;
	word32 a4_40;
	word32 a5_41;
	word32 a6_42;
	word32 s4_43;
	word32 t3_44;
	vPortFree(a0, dwArg10, a5_11, mstatus, dwArg0158, dwArg0198, out s0_34, out s1_35, out a0_36, out a1_37, out a2_38, out a3_39, out a4_40, out a5_41, out a6_42, out s4_43, out t3_44);
}

// 23093C00: void aes_ctx_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void aes_ctx_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 0x0118, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
	{
		word32 a1_83;
		word32 a4_84;
		word32 a5_85;
		mbedtls_aes_init(ra_21, 0x01, out a1_83, out a4_84, out a5_85);
	}
}

