pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23093C22: void aes_setkey_dec_wrap(Register Eq_2 ra, Register (ptr32 Eq_526718) a1)
void aes_setkey_dec_wrap(Eq_2 ra, struct Eq_526718 * a1)
{
	mbedtls_aes_setkey_dec(ra, a1);
}

// 23093C26: void aes_setkey_enc_wrap(Register (ptr32 Eq_492553) a0, Register (ptr32 Eq_492554) a1, Register Eq_492555 a2, Register (ptr32 Eq_492556) a4, Register Eq_492534 a5, Stack (ptr32 Eq_492553) dwArg44, Stack Eq_2 dwArg0128)
void aes_setkey_enc_wrap(struct Eq_492553 * a0, struct Eq_492554 * a1, Eq_492555 a2, struct Eq_492556 * a4, Eq_492534 a5, struct Eq_492553 * dwArg44, Eq_2 dwArg0128)
{
	word32 a0_23;
	word32 a1_24;
	word32 a3_25;
	word32 a4_26;
	word32 s4_27;
	mbedtls_aes_setkey_enc(a0, a1, a2, a4, a5, dwArg44, dwArg0128, out a0_23, out a1_24, out a3_25, out a4_26, out s4_27);
}

// 23093C2A: void aes_crypt_ctr_wrap(Register (ptr32 word32) s0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_528589) a5, Register (ptr32 Eq_528590) a6, Stack word32 dwArg0C, Stack word32 dwArg74, Stack (ptr32 word32) dwArgB4, Stack Eq_2 dwArg0118, Stack word32 dwArg0128)
void aes_crypt_ctr_wrap(word32 * s0, word32 a1, Eq_2 a3, Eq_2 a4, struct Eq_528589 * a5, struct Eq_528590 * a6, word32 dwArg0C, word32 dwArg74, word32 * dwArgB4, Eq_2 dwArg0118, word32 dwArg0128)
{
	mbedtls_aes_crypt_ctr(s0, a1, a3, a4, a5, a6, dwArg0C, dwArg74, dwArgB4, dwArg0118, dwArg0128);
}

// 23093C2E: void aes_crypt_cfb128_wrap(Register Eq_527197 s0, Register word32 a1, Register word32 a2, Register (ptr32 Eq_527197) a3, Register Eq_2 a4, Register (ptr32 Eq_528454) a5, Register (ptr32 Eq_528455) a6, Stack word32 dwArg1C, Stack word32 dwArgA8, Stack Eq_2 dwArg0128)
void aes_crypt_cfb128_wrap(Eq_527197 s0, word32 a1, word32 a2, union Eq_527197 * a3, Eq_2 a4, struct Eq_528454 * a5, struct Eq_528455 * a6, word32 dwArg1C, word32 dwArgA8, Eq_2 dwArg0128)
{
	mbedtls_aes_crypt_cfb128(s0, a1, a2, a3, a4, a5, a6, dwArg1C, dwArgA8, dwArg0128);
}

// 23093C32: void aes_crypt_cbc_wrap(Register Eq_2 a1, Register ui32 a2, Register Eq_2 a3, Register ptr32 a4, Register ptr32 a5, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0198)
void aes_crypt_cbc_wrap(Eq_2 a1, ui32 a2, Eq_2 a3, ptr32 a4, ptr32 a5, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0198)
{
	word32 s1_39;
	word32 a1_40;
	word32 a4_41;
	word32 s7_42;
	word32 s9_43;
	word32 s10_44;
	word32 s11_45;
	mbedtls_aes_crypt_cbc(a1, a2, a3, a4, a5, dwArgF8, dwArg0108, dwArg0198, out s1_39, out a1_40, out a4_41, out s7_42, out s9_43, out s10_44, out s11_45);
}

// 23093C36: void aes_crypt_ecb_wrap(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Stack word32 dwArg2C, Stack Eq_2 dwArg0138)
void aes_crypt_ecb_wrap(Eq_2 a1, Eq_2 a2, Eq_2 a3, word32 dwArg2C, Eq_2 dwArg0138)
{
	word32 s1_37;
	word32 s2_38;
	word32 s3_39;
	word32 s4_40;
	word32 s5_41;
	word32 s6_42;
	word32 s7_43;
	word32 s8_44;
	word32 s9_45;
	word32 s10_46;
	word32 s11_47;
	mbedtls_aes_crypt_ecb(a1, a2, a3, dwArg2C, dwArg0138, out s1_37, out s2_38, out s3_39, out s4_40, out s5_41, out s6_42, out s7_43, out s8_44, out s9_45, out s10_46, out s11_47);
}

// 23093C3A: Register word32 debug_send_line.isra.0(Register (ptr32 Eq_514837) a0, Register out (ptr32 (ptr32 (ptr32 (ptr32 Eq_538791)))) a0Out)
// Called from:
//      mbedtls_debug_print_msg
//      mbedtls_debug_print_ret
//      mbedtls_debug_print_buf
//      mbedtls_debug_print_mpi
//      mbedtls_debug_print_crt
word32 debug_send_line.isra.0(struct Eq_514837 * a0, struct Eq_538791 & a0Out)
{
	word32 t1_8;
	struct Eq_538791 **** a0_9;
	a0->ptr0010();
	a0Out = a0_9;
	return t1_8;
}

// 23093C42: Register word32 mbedtls_debug_print_mpi.part.1(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register out ptr32 a1Out, Register out ptr32 a2Out)
// Called from:
//      mbedtls_debug_print_mpi
word32 mbedtls_debug_print_mpi.part.1(Eq_2 ra, Eq_2 s1, Eq_2 a1, ptr32 & a1Out, ptr32 & a2Out)
{
	word32 a5_32[] = *((word32) *((word32) s1 + 4) + 8);
	Eq_537894 s1_43 = (word32) s1 - 1;
	while (true)
	{
		int32 a4_45 = s1_43 << 0x02;
		if (s1_43 == 0x00 || a5_32[a4_45 / 4] != 0x00)
			break;
		s1_43 = (word32) s1_43 - 1;
	}
	word32 a5_56 = 0x1F;
	while ((a1 >> a5_56 & 0x01) == 0x00)
	{
		a5_56 += ~0x00;
		if (a5_56 == ~0x00)
			break;
	}
	struct Eq_514837 ** s4_98;
	word32 s10_634;
	word32 s6_630;
	word32 a5_626;
	word32 a1_622;
	word32 s11_635;
	word32 s8_632;
	word32 s7_631;
	word32 s3_628;
	word32 a7_627;
	word32 a3_624;
	word32 a2_623;
	word32 s0_620;
	word32 s9_633;
	word32 s5_629;
	word32 a4_625;
	word32 a0_621;
	ui32 s1_119;
	struct Eq_537931 * s2_122;
	Eq_2 ra_153 = snprintf(ra, fp + -576, 0x0200, &g_t230C8954, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_620, out s1_119, out a0_621, out a1_622, out a2_623, out a3_624, out a4_625, out a5_626, out a7_627, out s2_122, out s3_628, out s4_98, out s5_629, out s6_630, out s7_631, out s8_632, out s9_633, out s10_634, out s11_635);
	word32 a0_636;
	debug_send_line.isra.0(*s4_98, out a0_636);
	int32 s0_114 = 0x00;
	word32 a4_115 = 0x01;
	ui32 s9_116 = 0x00;
	int32 s8_117 = 0x0200;
	for (; s1_119 != ~0x00; s1_119 += ~0x00)
	{
		int32 s10_120 = s1_119 << 0x02;
		if (a4_115 == 0x00 || *((word32) s2_122->t0008 + s10_120) != 0x00)
		{
			word32 s3_127 = 0x18;
			word32 s11_128 = ~0x07;
			do
			{
				if (a4_115 == 0x00 || (*((word32) s2_122->t0008 + s10_120) >> s3_127 & 0x00FF) != 0x00)
				{
					if ((s9_116 & 0x0F) == 0x00 && s9_116 != 0x00)
					{
						struct Eq_514837 ** s4_169;
						word32 s6_682;
						word32 s7_683;
						word32 s9_684;
						word32 s10_685;
						word32 s11_686;
						word32 s0_670;
						word32 s1_671;
						word32 a7_678;
						word32 s2_679;
						word32 s3_680;
						word32 s5_681;
						word32 a0_672;
						word32 a1_673;
						word32 a2_674;
						word32 a5_677;
						word32 a3_675;
						word32 a4_676;
						ra_153 = snprintf(ra_153, fp + -576 + s0_114, s8_117 - s0_114, &g_t230C930C, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_670, out s1_671, out a0_672, out a1_673, out a2_674, out a3_675, out a4_676, out a5_677, out a7_678, out s2_679, out s3_680, out s4_169, out s5_681, out s6_682, out s7_683, out s8_117, out s9_684, out s10_685, out s11_686);
						word32 a0_687;
						debug_send_line.isra.0(*s4_169, out a0_687);
						s0_114 = 0x00;
					}
					word32 a0_206;
					word32 s0_214;
					word32 s9_225;
					word32 s4_694;
					word32 s5_695;
					word32 s6_696;
					word32 s7_697;
					word32 a3_690;
					word32 a4_691;
					word32 a5_692;
					word32 a7_693;
					word32 a2_689;
					word32 a1_688;
					ra_153 = snprintf(ra_153, fp + -576 + s0_114, s8_117 - s0_114, &g_t230BFCE8, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_214, out s1_119, out a0_206, out a1_688, out a2_689, out a3_690, out a4_691, out a5_692, out a7_693, out s2_122, out s3_127, out s4_694, out s5_695, out s6_696, out s7_697, out s8_117, out s9_225, out s10_120, out s11_128);
					s0_114 = s0_214 + a0_206;
					s9_116 = s9_225 + 0x01;
					a4_115 = 0x00;
				}
				s3_127 += ~0x07;
			} while (s3_127 != s11_128);
		}
	}
	if (a4_115 != 0x00)
	{
		word32 a1_638;
		word32 a5_642;
		word32 a0_255;
		word32 s0_263;
		word32 s2_644;
		word32 a7_643;
		word32 a3_640;
		word32 a2_639;
		word32 s4_646;
		word32 s5_647;
		word32 s6_648;
		word32 s7_649;
		word32 s8_650;
		word32 s11_653;
		word32 s9_651;
		word32 s10_652;
		word32 s3_645;
		word32 a4_641;
		word32 s1_637;
		ra_153 = snprintf(ra_153, fp + -576 + s0_114, 0x0200 - s0_114, &g_t230C8974, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_263, out s1_637, out a0_255, out a1_638, out a2_639, out a3_640, out a4_641, out a5_642, out a7_643, out s2_644, out s3_645, out s4_646, out s5_647, out s6_648, out s7_649, out s8_650, out s9_651, out s10_652, out s11_653);
		s0_114 = s0_263 + a0_255;
	}
	struct Eq_514837 ** s4_302;
	ptr32 s5_303;
	ptr32 s6_304;
	word32 a2_658;
	word32 a3_659;
	word32 s8_666;
	word32 s9_667;
	word32 s10_668;
	word32 s11_669;
	word32 a4_660;
	word32 a5_661;
	word32 a7_662;
	word32 s7_665;
	word32 s2_663;
	word32 s3_664;
	word32 s0_654;
	word32 s1_655;
	word32 a0_656;
	word32 a1_657;
	snprintf(ra_153, fp + -576 + s0_114, 0x0200 - s0_114, &g_t230C930C, dwLoc0228, dwLoc0208, dwLoc01DC, dwLoc01C0, dwLoc01BC, dwLoc0198, dwLoc0174, out s0_654, out s1_655, out a0_656, out a1_657, out a2_658, out a3_659, out a4_660, out a5_661, out a7_662, out s2_663, out s3_664, out s4_302, out s5_303, out s6_304, out s7_665, out s8_666, out s9_667, out s10_668, out s11_669);
	word32 a0_316;
	debug_send_line.isra.0(*s4_302, out a0_316);
	a1Out = s5_303;
	a2Out = s6_304;
	return a0_316;
}

// 23093DF4: Register Eq_2 mbedtls_debug_print_msg(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_274) a4, Register Eq_2 a5, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_504509) a3Out, Register out (ptr32 Eq_274) a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_504513 s4Out, Register out (ptr32 int32) s5Out, Register out Eq_504515 s6Out, Register out ptr32 s7Out, Register out Eq_504517 s8Out, Register out ptr32 s9Out, Register out (ptr32 Eq_504519) s10Out, Register out (ptr32 Eq_504520) s11Out, Register out ptr32 t4Out)
// Called from:
//      ssl_swap_epochs
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      ssl_set_timer
//      ssl_check_timer
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_flush_output
//      mbedtls_ssl_send_flight_completed
//      mbedtls_ssl_optimize_checksum
//      mbedtls_ssl_get_record_expansion
//      mbedtls_ssl_handshake
//      ssl_handshake_wrapup_free_hs_transform
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
//      mbedtls_ssl_write_record
//      mbedtls_ssl_resend
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_handle_message_type
//      mbedtls_ssl_send_alert_message
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_write_change_cipher_spec
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_write
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_read_record
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_parse_change_cipher_spec
//      mbedtls_ssl_parse_finished
//      mbedtls_ssl_read
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_debug_print_msg(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_274 * a4, Eq_2 a5, union Eq_2 & a1Out, ptr32 & a2Out, struct Eq_504509 & a3Out, struct Eq_274 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_504513 & s4Out, int32 & s5Out, union Eq_504513 & s6Out, ptr32 & s7Out, union Eq_504513 & s8Out, ptr32 & s9Out, struct Eq_504519 & s10Out, struct Eq_504520 & s11Out, ptr32 & t4Out)
{
	if (a0 != 0x00)
	{
		a0 = *a5;
		if (a5 != 0x00)
		{
			a5 = *((word32) a5 + 16);
			if (a5 != 0x00)
			{
				a5 = g_t4200ECE4;
				if (a5 >= a1)
				{
					Eq_2 s1_44;
					ptr32 s2_47;
					struct Eq_504509 * s3_48;
					word32 t0_173;
					word32 s0_174;
					word32 a1_175;
					word32 a2_176;
					word32 a3_177;
					word32 a4_178;
					word32 a5_179;
					struct Eq_514837 * a0_38;
					vsnprintf(ra, fp + -560, 0x0200, a4, fp + -0x0C, dwLoc01E8, dwLoc01C8, dwLoc019C, dwLoc0180, dwLoc017C, dwLoc0158, dwLoc0134, out t0_173, out s0_174, out s1_44, out a0_38, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179, out a7, out s2_47, out s3_48, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4);
					a5.u0 = 510;
					if (a0_38 <= (struct Eq_514837 *) 510)
					{
						a0_38 += (fp + -48) / 0x0E02;
						a0_38->b0E00 = 0x0A;
						a0_38->b0E01 = 0x00;
						a5.u0 = 0x0A;
					}
					debug_send_line.isra.0(a0_38, out a0);
					a4 = fp + -560;
					a3 = s3_48;
					a2 = s2_47;
					a1 = s1_44;
				}
			}
		}
	}
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a7Out = a7;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	t4Out = t4;
	return a0;
}

// 23093E84: Register word32 mbedtls_debug_print_ret(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a5, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_506147) a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_506151 s6Out, Register out ptr32 s7Out, Register out Eq_506153 s8Out, Register out ptr32 s9Out, Register out (ptr32 Eq_506155) s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_flush_output
//      mbedtls_ssl_write_record
//      mbedtls_ssl_resend
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_send_alert_message
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_write_change_cipher_spec
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_write
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_read_record
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_parse_change_cipher_spec
//      mbedtls_ssl_parse_finished
//      mbedtls_ssl_read
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
word32 mbedtls_debug_print_ret(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a5, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, struct Eq_506147 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_506151 & s6Out, ptr32 & s7Out, union Eq_506151 & s8Out, ptr32 & s9Out, struct Eq_506155 & s10Out, ptr32 & s11Out)
{
	word32 a0_16 = *a3;
	if (a3 != 0x00)
	{
		a3 = *((word32) a3 + 16);
		if (a3 != 0x00)
		{
			a3 = g_t4200ECE4;
			if (a3 >= a1)
			{
				a3.u0 = 0xF9000700;
				if (a5 != 0xF9000700)
				{
					struct Eq_514837 * a0_37;
					Eq_2 s1_46;
					ptr32 s2_49;
					Eq_2 s3_50;
					word32 s0_139;
					word32 a1_140;
					word32 a2_141;
					word32 a3_142;
					word32 a4_143;
					word32 a7_144;
					snprintf(ra, fp + -544, 0x0200, &g_t230C8978, dwLoc0208, dwLoc01E8, dwLoc01BC, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s0_139, out s1_46, out a0_37, out a1_140, out a2_141, out a3_142, out a4_143, out a5, out a7_144, out s2_49, out s3_50, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11);
					debug_send_line.isra.0(a0_37, out a0_16);
					a4 = fp + -544;
					a3 = s3_50;
					a2 = s2_49;
					a1 = s1_46;
				}
			}
		}
	}
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return a0_16;
}

