pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23093F06: Register word32 mbedtls_debug_print_buf(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a5, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_504760 a3Out, Register out (ptr32 Eq_504761) a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_write_record
//      mbedtls_ssl_resend
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
word32 mbedtls_debug_print_buf(Eq_2 ra, Eq_2 a1, Eq_2 a5, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_504760 & a3Out, struct Eq_504761 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out)
{
	Eq_2 a0_211 = *a5;
	if (a5 != 0x00)
	{
		a5 = *((word32) a5 + 16);
		if (a5 != 0x00)
		{
			a5 = g_t4200ECE4;
			if (a5 >= a1)
			{
				struct Eq_514837 * a0_52;
				word32 a1_560;
				word32 s1_559;
				word32 s5_568;
				word32 s8_571;
				word32 s9_572;
				word32 s10_573;
				word32 s11_574;
				word32 s6_569;
				word32 s7_570;
				word32 a2_561;
				word32 a5_564;
				word32 s2_565;
				word32 s3_566;
				word32 s4_567;
				word32 a3_562;
				word32 a4_563;
				ui32 s0_101;
				Eq_2 ra_59 = snprintf(ra, fp + -576, 0x0200, &g_t230C88DC, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_101, out s1_559, out a0_52, out a1_560, out a2_561, out a3_562, out a4_563, out a5_564, out a7, out s2_565, out s3_566, out s4_567, out s5_568, out s6_569, out s7_570, out s8_571, out s9_572, out s10_573, out s11_574);
				word32 a0_575;
				debug_send_line.isra.0(a0_52, out a0_575);
				Eq_2 ra_113 = memset(ra_59, fp + -596, 0x00, 0x11, out t1, out a0_211, out a1, out a2, out a3, out a4, out a5);
				int32 s7_106 = 0x00;
				ui32 s8_100 = 0x00;
				int32 s6_108 = 0x0200;
				word32 s9_111 = 0x230C9000;
				word32 s10_180 = 0x230C0000;
				while (s8_100 != s0_101)
				{
					word32 a5_102 = 0x01000000;
					if (s8_100 == 0x01000000)
						goto l23093FC0;
					if ((s8_100 & 0x0F) == 0x00)
					{
						if (s8_100 != 0x00)
						{
							struct Eq_514837 * a0_115;
							word32 s10_638;
							word32 s11_639;
							word32 s2_631;
							word32 s5_634;
							word32 s7_635;
							word32 s8_636;
							word32 s9_637;
							word32 s3_632;
							word32 s4_633;
							word32 s1_624;
							word32 a3_627;
							word32 a4_628;
							word32 a5_629;
							word32 a7_630;
							word32 a1_625;
							word32 a2_626;
							word32 s0_623;
							Eq_2 ra_122 = snprintf(ra_113, fp + -576 + s7_106, s6_108 - s7_106, s9_111 + -1800, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_623, out s1_624, out a0_115, out a1_625, out a2_626, out a3_627, out a4_628, out a5_629, out a7_630, out s2_631, out s3_632, out s4_633, out s5_634, out s6_108, out s7_635, out s8_636, out s9_637, out s10_638, out s11_639);
							word32 a0_640;
							debug_send_line.isra.0(a0_115, out a0_640);
							word32 a4_645;
							word32 a5_646;
							word32 a0_641;
							word32 a1_642;
							word32 a2_643;
							word32 a3_644;
							ra_113 = memset(ra_122, fp + -596, 0x00, 0x11, out t1, out a0_641, out a1_642, out a2_643, out a3_644, out a4_645, out a5_646);
							s7_106 = 0x00;
						}
						word32 a0_170;
						word32 s7_187;
						word32 s2_617;
						word32 s5_620;
						word32 s9_621;
						word32 s11_622;
						word32 s3_618;
						word32 s4_619;
						word32 s0_610;
						word32 a2_613;
						word32 a3_614;
						word32 a4_615;
						word32 a7_616;
						word32 s1_611;
						word32 a1_612;
						ra_113 = snprintf(ra_113, fp + -576 + s7_106, s6_108 - s7_106, &g_t230C8900, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_610, out s1_611, out a0_170, out a1_612, out a2_613, out a3_614, out a4_615, out a5_102, out a7_616, out s2_617, out s3_618, out s4_619, out s5_620, out s6_108, out s7_187, out s8_100, out s9_621, out s10_180, out s11_622);
						s7_106 = s7_187 + a0_170;
					}
					Eq_2 a4_205 = a5_102 + s8_100;
					byte * a4_215;
					Eq_504760 s11_222;
					int32 s3_224;
					word32 s7_228;
					word32 s8_229;
					word32 s1_603;
					word32 a5_606;
					word32 s2_607;
					word32 s4_608;
					word32 s5_609;
					word32 a2_604;
					word32 a3_605;
					ra_113 = snprintf(ra_113, fp + -576 + s7_106, s6_108 - s7_106, s10_180 + -792, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, a4_205, dwLoc01C8, dwLoc01A4, out s0_101, out s1_603, out a0_211, out a1, out a2_604, out a3_605, out a4_215, out a5_606, out a7, out s2_607, out s3_224, out s4_608, out s5_609, out s6_108, out s7_228, out s8_229, out s9_111, out s10_180, out s11_222);
					a4 = (word32) *a4_215;
					dwLoc01EC = a4_205;
					a2 = dwLoc01AC;
					s7_106 = (word32) a0_211 + s7_228;
					a3 = a4 + -32 & 0x00FF;
					if (s11_222 < a3)
						a4 = (struct Eq_504761 *) 46;
					(s3_224 + (fp + -64))->b0DEC = (byte) a4;
					a5 = fp + -64;
					s8_100 = s8_229 + 0x01;
				}
				if (s0_101 != 0x00)
				{
					int32 s3_248 = 0x0200;
					word32 s6_249 = 0x230BF000;
					while (true)
					{
						Eq_2 a0_255 = fp + -576 + s7_106;
						Eq_2 a1_257 = s3_248 - s7_106;
						if ((s0_101 & 0x0F) == 0x00)
							break;
						word32 a0_262;
						word32 s0_270;
						word32 s7_279;
						word32 s11_589;
						word32 a7_582;
						word32 s5_585;
						word32 s8_586;
						word32 s9_587;
						word32 s10_588;
						word32 s2_583;
						word32 s4_584;
						word32 a2_578;
						word32 a3_579;
						word32 a4_580;
						word32 a5_581;
						word32 s1_576;
						word32 a1_577;
						ra_113 = snprintf(ra_113, a0_255, a1_257, s6_249 + -672, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_270, out s1_576, out a0_262, out a1_577, out a2_578, out a3_579, out a4_580, out a5_581, out a7_582, out s2_583, out s3_248, out s4_584, out s5_585, out s6_249, out s7_279, out s8_586, out s9_587, out s10_588, out s11_589);
						s7_106 = s7_279 + a0_262;
						s0_101 = s0_270 + 0x01;
					}
l23093FC0:
					struct Eq_514837 * a0_298;
					Eq_2 s2_310;
					ptr32 s4_312;
					Eq_504760 s5_313;
					word32 s3_596;
					word32 s8_599;
					word32 s9_600;
					word32 s10_601;
					word32 s11_602;
					word32 s6_597;
					word32 s7_598;
					word32 a1_592;
					word32 a2_593;
					word32 a3_594;
					word32 a4_595;
					word32 s0_590;
					word32 s1_591;
					snprintf(ra_113, fp + -576 + s7_106, 0x0200 - s7_106, &g_t230C88F8, dwLoc0258, dwLoc0238, dwLoc020C, dwLoc01F0, dwLoc01EC, dwLoc01C8, dwLoc01A4, out s0_590, out s1_591, out a0_298, out a1_592, out a2_593, out a3_594, out a4_595, out a5, out a7, out s2_310, out s3_596, out s4_312, out s5_313, out s6_597, out s7_598, out s8_599, out s9_600, out s10_601, out s11_602);
					a4 = fp + -576;
					a3 = s5_313;
					a2 = s4_312;
					a1 = s2_310;
					t1 = debug_send_line.isra.0(a0_298, out a0_211);
				}
			}
		}
	}
	a0Out = a0_211;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a7Out = a7;
	return t1;
}

