pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 230940CE: Register (ptr32 (ptr32 (ptr32 Eq_538791))) mbedtls_debug_print_mpi(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 (ptr32 (ptr32 Eq_538791))) a0, Register Eq_2 a1, Register int32 a5, Register out Eq_2 a1Out, Register out ptr32 a2Out)
// Called from:
//      mbedtls_debug_print_ecp
//      mbedtls_debug_print_crt
struct Eq_538791 *** mbedtls_debug_print_mpi(Eq_2 ra, Eq_2 s1, struct Eq_538791 *** a0, Eq_2 a1, int32 a5, union Eq_2 & a1Out, ptr32 & a2Out)
{
	struct Eq_538791 * a6_5 = *a0;
	if (a6_5 == null || (a6_5->dw0010 == 0x00 || (a5 == 0x00 || g_t4200ECE4 < a1)))
	{
		a1Out = a1;
		a2Out = a2;
		return a0;
	}
	else
	{
		Eq_2 a1_14;
		ptr32 a2_15;
		struct Eq_538791 *** a0_13 = mbedtls_debug_print_mpi.part.1(ra, s1, a1, out a1_14, out a2_15);
		a1Out = a1_14;
		a2Out = a2_15;
		return a0_13;
	}
}

// 230940F2: Register (ptr32 Eq_514837) mbedtls_debug_print_ecp.part.2(Register Eq_2 ra, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_debug_print_ecp
struct Eq_514837 * mbedtls_debug_print_ecp.part.2(Eq_2 ra, ptr32 & a1Out, ptr32 & a2Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_538791 *** s0_43;
	Eq_2 s1_44;
	int32 s4_49;
	word32 a0_150;
	word32 a1_151;
	word32 a2_152;
	word32 a3_153;
	word32 a4_154;
	word32 a5_155;
	word32 a7_156;
	word32 s2_157;
	word32 s3_158;
	word32 s5_159;
	word32 s6_160;
	word32 s7_161;
	word32 s8_162;
	word32 s9_163;
	word32 s10_164;
	word32 s11_165;
	Eq_2 ra_42 = snprintf(ra, fp + -544, 0x0200, &g_t230C8944, dwLoc0208, dwLoc01E8, dwLoc01BC, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s0_43, out s1_44, out a0_150, out a1_151, out a2_152, out a3_153, out a4_154, out a5_155, out a7_156, out s2_157, out s3_158, out s4_49, out s5_159, out s6_160, out s7_161, out s8_162, out s9_163, out s10_164, out s11_165);
	word32 a1_166;
	word32 a2_167;
	mbedtls_debug_print_mpi(ra_42, s1_44, s0_43, s1_44, s4_49, out a1_166, out a2_167);
	struct Eq_538791 *** s0_89;
	Eq_2 s1_90;
	ptr32 s10_91;
	ptr32 s11_92;
	word32 s4_95;
	ptr32 s7_98;
	ptr32 s8_99;
	ptr32 a1_112;
	ptr32 a2_113;
	word32 a0_168;
	word32 a1_169;
	word32 a2_170;
	word32 a3_171;
	word32 a4_172;
	word32 a5_173;
	word32 a7_174;
	word32 s2_175;
	word32 s3_176;
	word32 s5_177;
	word32 s6_178;
	word32 s9_179;
	struct Eq_514837 * a0_111 = mbedtls_debug_print_mpi(snprintf(ra_42, fp + -544, 0x0200, &g_t230C894C, dwLoc0208, dwLoc01E8, dwLoc01BC, dwLoc01A0, dwLoc019C, dwLoc0178, dwLoc0154, out s0_89, out s1_90, out a0_168, out a1_169, out a2_170, out a3_171, out a4_172, out a5_173, out a7_174, out s2_175, out s3_176, out s4_95, out s5_177, out s6_178, out s7_98, out s8_99, out s9_179, out s10_91, out s11_92), s1_90, s0_89, s1_90, s4_95 + 0x0C, out a1_112, out a2_113);
	a1Out = a1_112;
	a2Out = a2_113;
	s7Out = s7_98;
	s8Out = s8_99;
	s10Out = s10_91;
	s11Out = s11_92;
	return a0_111;
}

// 2309418A: Register (ptr32 (ptr32 (ptr32 Eq_538791))) mbedtls_debug_print_ecp(Register Eq_2 ra, Register (ptr32 (ptr32 (ptr32 Eq_538791))) a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out ptr32 s7Out, Register out (ptr32 Eq_538942) s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_debug_print_crt
struct Eq_538791 *** mbedtls_debug_print_ecp(Eq_2 ra, struct Eq_538791 *** a0, Eq_2 a1, union Eq_2 & a1Out, ptr32 & a2Out, ptr32 & s7Out, struct Eq_538942 & s8Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_538791 * a6_5 = *a0;
	if (a6_5 == null || (a6_5->dw0010 == 0x00 || g_t4200ECE4 < a1))
	{
		a1Out = a1;
		a2Out = a2;
		s7Out = s7;
		s8Out = s8;
		s10Out = s10;
		s11Out = s11;
		return a0;
	}
	else
	{
		Eq_2 a1_12;
		ptr32 a2_13;
		ptr32 s10_19;
		ptr32 s11_20;
		ptr32 s7_22;
		struct Eq_538942 * s8_23;
		struct Eq_538791 *** a0_11 = mbedtls_debug_print_ecp.part.2(ra, out a1_12, out a2_13, out s7_22, out s8_23, out s10_19, out s11_20);
		a1Out = a1_12;
		a2Out = a2_13;
		s7Out = s7_22;
		s8Out = s8_23;
		s10Out = s10_19;
		s11Out = s11_20;
		return a0_11;
	}
}

// 230941AC: Register Eq_2 mbedtls_debug_print_crt(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register out (ptr32 (ptr32 (ptr32 Eq_538791))) s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_514837) a0Out, Register out Eq_2 a1Out, Register out Eq_514839 a2Out, Register out ptr32 a3Out, Register out Eq_2 a5Out, Register out Eq_514839 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_debug_print_crt(Eq_2 ra, Eq_2 a1, Eq_2 a4, Eq_2 a5, struct Eq_538791 & s0Out, ptr32 & s1Out, struct Eq_514837 & a0Out, union Eq_2 & a1Out, union Eq_514839 & a2Out, ptr32 & a3Out, union Eq_2 & a5Out, union Eq_514839 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s9Out, union Eq_2 & s10Out, ptr32 & s11Out)
{
	struct Eq_514837 * a0_203 = *a5;
	if (a5 != 0x00)
	{
		a5 = *((word32) a5 + 16);
		if (a5 != 0x00 && a5 != 0x00)
		{
			a5 = g_t4200ECE4;
			if (a5 >= a1)
			{
				do
				{
					struct Eq_514837 * a0_65;
					Eq_2 s1_74;
					Eq_2 s2_77;
					word32 a4_760;
					word32 s11_771;
					word32 s8_768;
					word32 s9_769;
					word32 s10_770;
					word32 s7_767;
					word32 a5_761;
					word32 s4_764;
					word32 s5_765;
					word32 s6_766;
					word32 a7_762;
					word32 s3_763;
					word32 a1_757;
					word32 a2_758;
					word32 a3_759;
					word32 s0_756;
					Eq_2 ra_72 = snprintf(ra, fp + -2112, 0x0200, &g_t230C8908, dwLoc0848, dwLoc0828, dwLoc07FC, dwLoc07E0, a4, dwLoc07B8, dwLoc0794, out s0_756, out s1_74, out a0_65, out a1_757, out a2_758, out a3_759, out a4_760, out a5_761, out a7_762, out s2_77, out s3_763, out s4_764, out s5_765, out s6_766, out s7_767, out s8_768, out s9_769, out s10_770, out s11_771);
					word32 a0_772;
					debug_send_line.isra.0(a0_65, out a0_772);
					Eq_2 s1_109;
					Eq_2 s5_115;
					struct Eq_539039 * s2_112;
					Eq_2 ra_107 = mbedtls_x509_crt_info(ra_72, s1_74, fp + -0x0440, 0x03FF, s2_77, s2_77, dwLoc0860, dwLoc085C, dwLoc0850, dwLoc0848, dwLoc0840, dwLoc083C, dwLoc0838, dwLoc0828, dwLoc0824, dwLoc0804, dwLoc07F4, dwLoc0798, dwLoc06EC, out s0, out s1_109, out s2_112, out s3, out s4, out s5_115, out s7, out s10);
					Eq_2 a2_126 = fp + -0x0440;
					Eq_2 a1_127 = fp + -0x0440;
					s11 = 0x0A;
					while (true)
					{
						word32 a5_132 = (word32) *a2_126;
						if (a5_132 == 0x00)
							break;
						s10 = (word32) a2_126 + 1;
						if (a5_132 == 0x0A)
						{
							Eq_539231 a2_136 = a2_126 - a1_127;
							Eq_2 s9_137 = (word32) a2_136 + 1;
							if (a2_136 > -510)
								s9_137.u0 = 511;
							word32 a5_784;
							word32 a6_785;
							word32 a7_786;
							word32 a4_783;
							word32 a1_780;
							word32 a2_781;
							word32 a3_782;
							memcpy(fp + -1600, a1_127, s9_137, out a1_780, out a2_781, out a3_782, out a4_783, out a5_784, out a6_785, out a7_786);
							(word32) s9_137 + (fp + 0x00FFEFC0) + 0x0A00 = (int32) 0x00;
							word32 a0_787;
							debug_send_line.isra.0(fp + -1600, out a0_787);
							s0 = dwLoc0640;
							a1_127 = s10;
						}
						a2_126 = s10;
					}
					a1 = fp + -1600;
					struct Eq_493903 * a5_194;
					word32 a2_753;
					word32 a3_754;
					word32 a4_755;
					word32 a0_751;
					word32 a1_752;
					word32 t1_750;
					ra = mbedtls_pk_debug(memset(ra_107, fp + -1600, 0x00, 36, out t1_750, out a0_751, out a1_752, out a2_753, out a3_754, out a4_755, out a5_194), (char *) s2_112 + 188, a5_194, dwLoc0850, out a0_203, out a2, out a5);
					if (a0_203 != null)
					{
						s0 = a0_203->ptr0000;
						debug_send_line.isra.0(a0_203, out a0_203);
						a2 = s3;
						a1 = s1_109;
					}
					else
					{
						byte * s8_211 = fp + -1600;
						s10.u0 = 0x01;
						s11 = 0x230C9000;
						do
						{
							a5 = (word32) *s8_211;
							if (a5 == 0x00)
								break;
							struct Eq_514837 * a0_231;
							Eq_2 s1_240;
							struct Eq_539153 * s9_250;
							word32 s6_779;
							word32 a4_776;
							word32 a5_777;
							word32 a7_778;
							word32 a3_775;
							word32 a1_773;
							word32 a2_774;
							struct Eq_539161 * s8_249;
							ra = snprintf(ra, s5_115, 0x10, &g_t230BF954, dwLoc0848, dwLoc0828, dwLoc07FC, dwLoc07E0, a4, dwLoc07B8, dwLoc0794, out s0, out s1_240, out a0_231, out a1_773, out a2_774, out a3_775, out a4_776, out a5_777, out a7_778, out s2_112, out s3, out s4, out s5_115, out s6_779, out s7, out s8_249, out s9_250, out s10, out s11);
							Eq_2 a5_254 = (word32) s8_249->b0000;
							s9_250->b07FF = 0x00;
							if (a5_254 == s10)
								a0_203 = mbedtls_debug_print_mpi(ra, s1_240, s0, s1_240, s8_249->dw0008, out a1, out a2);
							else if (a5_254 == 0x02)
								a0_203 = mbedtls_debug_print_ecp(ra, s0, s1_240, out a1, out a2, out s7, out s8_249, out s10, out s11);
							else
							{
								s0 = a0_231->ptr0000;
								debug_send_line.isra.0(a0_231, out a0_203);
								a2 = s3;
								a1 = s1_240;
							}
							s8_211 = (byte *) (&s8_249->dw0008 + 1);
							a5 = fp + -0x061C;
						} while (s8_211 != fp + -0x061C);
					}
				} while (s2_112->dw0130 != 0x00);
			}
		}
	}
	s0Out = s0;
	s1Out = dwLoc64;
	a0Out = a0_203;
	a1Out = a1;
	a2Out = a2;
	a3Out = dwArg78;
	a5Out = a5;
	s3Out = s3;
	s4Out = s4;
	s7Out = s7;
	s9Out = dwArg18;
	s10Out = s10;
	s11Out = s11;
	return dwLoc24;
}

// 23094378: Register word32 ecp_get_type(Register Eq_2 a5)
// Called from:
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_check_privkey
//      mbedtls_ecp_mul
word32 ecp_get_type(Eq_2 a5)
{
	struct Eq_539278 * a0_5 = *((word32) a5 + 48);
	if (a5 == 0x00)
		return 0x00;
	return (word32) (a0_5->t003C < 1) + 0x01;
}

// 2309438A: Register Eq_2 ecp_safe_invert_jac(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_539316 a4Out, Register out Eq_539317 a5Out, Register out Eq_539318 s2Out, Register out ptr32 s3Out, Register out ptr32 s8Out)
// Called from:
//      ecp_select_comb
//      mbedtls_ecp_mul
Eq_2 ecp_safe_invert_jac(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_539316 & a4Out, union Eq_539317 & a5Out, union Eq_539318 & s2Out, ptr32 & s3Out, ptr32 & s8Out)
{
	word32 a0_27;
	word32 s1_158;
	word32 a3_159;
	word32 a7_160;
	word32 s4_161;
	word32 s8_162;
	Eq_2 a5_32;
	Eq_2 a4_31;
	Eq_2 a2_29;
	ptr32 s3_142;
	Eq_539318 s2_141;
	ptr32 s0_140;
	Eq_2 ra_139 = mbedtls_mpi_sub_mpi(ra, (word32) a1 + 0x0C, fp + ~0x1B, a3, a4, mbedtls_mpi_init(fp + ~0x1B), a2, mstatus, dwArg78, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_140, out s1_158, out a0_27, out a2_29, out a3_159, out a4_31, out a5_32, out a7_160, out s2_141, out s3_142, out s4_161, out s8_162);
	if (a0_27 == 0x00)
	{
		Eq_2 a3_54;
		Eq_2 a4_55;
		word32 a1_163;
		word32 a2_164;
		word32 a5_165;
		word32 a6_166;
		word32 s1_167;
		word32 a0_168;
		word32 a3_169;
		word32 s4_170;
		ra_139 = mbedtls_mpi_safe_cond_assign(ra_139, fp + ~0x1B, s2_141 & (word32) (mbedtls_mpi_cmp_int(0x00, a2_29, out a1_163, out a2_164, out a3_54, out a4_55, out a5_165, out a6_166) != 0x00), a3_54, a4_55, mstatus, dwLoc08, dwArgC8, dwArg0108, dwArg0148, out s0_140, out s1_167, out a0_168, out a2_29, out a3_169, out a4_31, out a5_32, out s2_141, out s3_142, out s4_170);
	}
	ptr32 a2_95;
	Eq_539317 a5_96;
	ptr32 a3_98;
	Eq_539316 a4_99;
	word32 a0_171;
	word32 a1_172;
	word32 a6_173;
	word32 s4_174;
	Eq_2 s1_101 = mbedtls_mpi_free(fp + ~0x1B, a2_29, a4_31, a5_32, mstatus, dwArg0128, dwArg0168, out a0_171, out a1_172, out a2_95, out a3_98, out a4_99, out a5_96, out a6_173, out s4_174);
	s0Out = s0_140;
	s1Out = s1_101;
	a0Out = s1_101;
	a2Out = a2_95;
	a3Out = a3_98;
	a4Out = a4_99;
	a5Out = a5_96;
	s2Out = s2_141;
	s3Out = s3_142;
	s8Out = dwLoc1C;
	return ra_139;
}

// 230943DE: Register Eq_2 ecp_select_comb(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_530592 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_ecp_mul
Eq_2 ecp_select_comb(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_530592 & s2Out, union Eq_2 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out)
{
	uint32 s4_33 = a4 >> 0x01 & 63;
	Eq_2 s1_114 = a2;
	Eq_2 s0_113 = 0x00;
	a4_220 = a4;
	a3_218 = a3;
	do
	{
		Eq_2 a3_218;
		Eq_2 a4_220;
		word32 s1_63;
		word32 s0_269;
		word32 a2_270;
		word32 s4_271;
		ptr32 a5_222;
		Eq_2 s3_234;
		ptr32 a0_213;
		Eq_530592 s2_232;
		ra = mbedtls_mpi_safe_cond_assign(ra, s1_114, (word32) (s4_33 - s0_113 < 1), a3_218, a4_220, mstatus, dwLoc18, dwArgB8, dwArgF8, dwArg0138, out s0_269, out s1_63, out a0_213, out a2_270, out a3_218, out a4_220, out a5_222, out s2_232, out s3_234, out s4_271);
		if (a0_213 != 0x00)
		{
l2309445E:
			0x00 = (int8) dwArg0128;
			s0Out = s4;
			a0Out = a0_213;
			a2Out = dwArgB8;
			a3Out = a3_218;
			a4Out = a4_220;
			a5Out = a5_222;
			s2Out = s2_232;
			s3Out = s3_234;
			s5Out.u0 = <invalid>;
			s6Out.u0 = <invalid>;
			s7Out.u0 = <invalid>;
			s8Out = s5;
			return ra;
		}
		word32 s0_87;
		word32 s1_88;
		word32 a2_268;
		ra = mbedtls_mpi_safe_cond_assign(ra, s1_63 + 0x0C, s2_232, a3_218, a4_220, mstatus, dwLoc18, dwArgB8, dwArgF8, dwArg0138, out s0_87, out s1_88, out a0_213, out a2_268, out a3_218, out a4_220, out a5_222, out s2_232, out s3_234, out s4_33);
		if (a0_213 != 0x00)
			goto l2309445E;
		s0_113 = s0_87 + 0x01 & 0x00FF;
		s1_114 = s1_88 + 36;
	} while (a3 != s0_113);
	0x00 = (int8) dwArg0128;
	ptr32 a0_131;
	Eq_2 a2_133;
	Eq_2 a3_134;
	Eq_2 a4_135;
	ptr32 a5_136;
	ptr32 s0_140;
	Eq_530592 s2_142;
	Eq_2 s3_143;
	ptr32 s8_145;
	word32 s1_272;
	Eq_2 ra_139 = ecp_safe_invert_jac(ra, s3_234, a4 >> 0x07, a3_218, a4_220, mstatus, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, out s0_140, out s1_272, out a0_131, out a2_133, out a3_134, out a4_135, out a5_136, out s2_142, out s3_143, out s8_145);
	s0Out = s0_140;
	a0Out = a0_131;
	a2Out = a2_133;
	a3Out = a3_134;
	a4Out = a4_135;
	a5Out = a5_136;
	s2Out = s2_142;
	s3Out = s3_143;
	s5Out.u0 = <invalid>;
	s6Out.u0 = <invalid>;
	s7Out.u0 = <invalid>;
	s8Out = s8_145;
	return ra_139;
}

// 23094476: Register Eq_2 ecp_modp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0114, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0134, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_539583) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_539589 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      ecp_double_jac
//      ecp_normalize_jac
//      ecp_normalize_jac_many
//      ecp_add_mixed
//      mbedtls_ecp_check_pubkey
//      mbedtls_ecp_mul
Eq_2 ecp_modp(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0114, Eq_2 dwArg0128, Eq_2 dwArg0134, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_539583 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_539589 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a1_13 = *((word32) a5 + 100);
	if (a5 == 0x00)
	{
		0x00 = (int8) dwArg38;
		Eq_2 a0_180;
		Eq_2 a2_182;
		Eq_2 a3_183;
		Eq_2 a4_184;
		Eq_2 a5_185;
		Eq_2 s1_187;
		Eq_2 s2_188;
		Eq_2 s10_193;
		Eq_2 s11_194;
		struct Eq_539583 * s3_195;
		ptr32 s4_196;
		Eq_2 s5_197;
		Eq_2 s6_198;
		Eq_2 s7_199;
		ptr32 s8_200;
		Eq_539589 s9_201;
		word32 a7_472;
		Eq_2 ra_192 = mbedtls_mpi_mod_mpi(ra, a0, a0, (word32) a1_13 + 4, s5, s6, s7, s10, s11, mstatus, dwArg08, dwArg28, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0114, dwArg0128, dwArg0134, out s1_187, out a0_180, out a2_182, out a3_183, out a4_184, out a5_185, out a7_472, out s2_188, out s3_195, out s4_196, out s5_197, out s6_198, out s7_199, out s8_200, out s9_201, out s10_193, out s11_194);
		s1Out = s1_187;
		a0Out = a0_180;
		a2Out = a2_182;
		a3Out = a3_183;
		a4Out = a4_184;
		a5Out = a5_185;
		s2Out = s2_188;
		s3Out = s3_195;
		s4Out = s4_196;
		s5Out = s5_197;
		s6Out = s6_198;
		s7Out = s7_199;
		s8Out = s8_200;
		s9Out = s9_201;
		s10Out = s10_193;
		s11Out = s11_194;
		mstatusOut = mstatus;
		return ra_192;
	}
	Eq_2 a3_118;
	Eq_2 s2_137;
	Eq_2 s1_108 = a1_13;
	if (a5 < 0x00)
	{
		word32 a6_474;
		word32 a1_473;
		if (mbedtls_mpi_cmp_int(0x00, a2, out a1_473, out a2, out a3_118, out a4, out a5, out a6_474) != 0x00)
			goto l230944B0;
	}
	word32 a2_36;
	struct Eq_539658 * a5_39;
	word32 a1_475;
	struct Eq_497022 * a0_34 = mbedtls_mpi_bitlen(a2, a4, a5, out a1_475, out a2_36, out a3_118, out a4, out a5_39);
	s1_108 = a5_39->t0058;
	a5 = a5_39 << 1;
	if (a5_39 << 1 >= a0_34)
	{
		word32 t4_225;
		word32 t1_224;
		word32 t0_223;
		struct Eq_539678 * sp_49;
		Eq_2 a0_56;
		word32 a6_61;
		word32 t3_62;
		word32 a7_219;
		word32 t5_226;
		word32 t6_227;
		Eq_2 a2_114;
		(a5_39 << 1)();
		s2_137 = a0_56;
		if (a0_56 == 0x00)
		{
			do
			{
				Eq_2 a0_129;
				Eq_2 s0_110 = *a5;
				if (a5 >= 0x00)
				{
l230944EA:
					do
					{
						word32 a1_476;
						word32 a6_478;
						word32 a2_477;
						if (mbedtls_mpi_cmp_mpi(a2_114, a4, a5, out a1_476, out a2_477, out a3_118, out a4, out a5, out a6_478) < 0x00)
							goto l230944B6;
						word32 a7_485;
						word32 a1_484;
						ra = mbedtls_mpi_sub_abs(ra, s0_110, s0_110, s1_108, a3_118, a4, a5, mstatus, sp_49->t00B8, sp_49->t00F8, sp_49->t0118, sp_49->t0128, sp_49->t0138, sp_49->t0158, out s0_110, out s1_108, out a0_129, out a1_484, out a2_114, out a3_118, out a4, out a5, out a7_485, out s2_137, out s3, out s4, out s8);
					} while (a0_129 == 0x00);
					break;
				}
				Eq_2 a3_73;
				word32 a1_479;
				word32 a6_480;
				if (mbedtls_mpi_cmp_int(0x00, a2_114, out a1_479, out a2_114, out a3_73, out a4, out a5, out a6_480) == 0x00)
					goto l230944EA;
				word32 s0_481;
				word32 a7_483;
				word32 a1_482;
				ra = mbedtls_mpi_add_mpi(ra, s0_110, s0_110, a3_73, a4, a5, s2_137, mstatus, sp_49->t0098, sp_49->t00B8, sp_49->t00D8, sp_49->t00F8, sp_49->t0108, sp_49->t0118, sp_49->t0138, out s0_481, out s1_108, out a0_129, out a1_482, out a2_114, out a3_118, out a4, out a5, out a7_483, out s2_137, out s3, out s4, out s8);
			} while (a0_129 == 0x00);
			s2_137 = a0_129;
		}
		goto l230944B6;
	}
l230944B0:
	s2_137.u0 = 0xFB000080;
l230944B6:
	0x00 = (int8) dwArg38;
	s1Out = s1_108;
	a0Out = s2_137;
	a2Out = dwArg10;
	a3Out = a3_118;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2_137;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

