pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23094514: Register Eq_2 ecp_double_jac(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_539843 a2Out, Register out Eq_2 a3Out, Register out Eq_539845 a4Out, Register out Eq_539846 a5Out, Register out ptr32 a6Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_539851 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_539855 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      ecp_add_mixed
//      mbedtls_ecp_mul
Eq_2 ecp_double_jac(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_539843 & a2Out, union Eq_2 & a3Out, union Eq_539845 & a4Out, union Eq_539846 & a5Out, ptr32 & a6Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_539851 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_539855 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s6_1002;
	Eq_2 s3_1026;
	Eq_2 s2_1025;
	ptr32 s8_1004;
	Eq_2 s0_101;
	Eq_2 a2_1016;
	Eq_2 a4_1018;
	Eq_2 a5_1019;
	Eq_2 a3_181;
	Eq_2 a4_182;
	Eq_2 ra_113;
	Eq_2 s4_118;
	mbedtls_mpi_init(fp + -96);
	mbedtls_mpi_init(fp + -84);
	mbedtls_mpi_init(fp + -72);
	mbedtls_mpi_init(fp + -60);
	if (*((word32) a0 + 24) == 0x00)
	{
		Eq_2 s1_449;
		Eq_2 s5_453;
		Eq_2 a0_462;
		word32 s4_2758;
		word32 a3_2757;
		word32 s0_2756;
		Eq_2 ra_447 = mbedtls_mpi_mul_mpi(ra, fp + -84, (word32) a2 + 24, (word32) a2 + 24, a3, a4, a0, a2, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2756, out s1_449, out a0_462, out a2_1016, out a3_2757, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2758, out s5_453, out s6_1002, out s8_1004);
		s0_101 = a0_462;
		if (a0_462 == 0x00)
		{
			Eq_2 a0_467;
			Eq_2 a3_470;
			word32 s9_2780;
			word32 s4_2778;
			word32 s5_2779;
			word32 s1_2777;
			Eq_2 ra_480 = ecp_modp(ra_447, s1_449, a2_1016, a4_1018, a5_1019, s2_1025, s5_453, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_2777, out a0_467, out a2_1016, out a3_470, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2778, out s5_2779, out s6_1002, out s7, out s8_1004, out s9_2780, out s10, out s11, out mstatus);
			s0_101 = a0_467;
			if (a0_467 == 0x00)
			{
				Eq_2 a0_499;
				word32 s3_2786;
				word32 a7_2785;
				word32 a3_2784;
				word32 a1_2783;
				word32 s1_2782;
				word32 s0_2781;
				word32 s4_2787;
				Eq_2 ra_507 = mbedtls_mpi_add_mpi(ra_480, a0_467, fp + -72, a3_470, a4_1018, a5_1019, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_2781, out s1_2782, out a0_499, out a1_2783, out a2_1016, out a3_2784, out a4_1018, out a5_1019, out a7_2785, out s2_1025, out s3_2786, out s4_2787, out s8_1004);
				s0_101 = a0_499;
				s3_1026 = (word32) s2_1025 + 4;
				if (a0_499 == 0x00)
				{
					do
					{
						Eq_2 a3_533;
						Eq_2 a4_534;
						Eq_2 a5_535;
						word32 a1_2788;
						word32 a6_2790;
						word32 a2_2789;
						if (mbedtls_mpi_cmp_mpi(a2_1016, a4_1018, a5_1019, out a1_2788, out a2_2789, out a3_533, out a4_534, out a5_535, out a6_2790) < 0x00)
						{
							word32 s0_2848;
							word32 a7_2849;
							Eq_2 a0_573;
							Eq_2 s1_583;
							Eq_2 s4_586;
							Eq_2 a3_576;
							Eq_2 ra_581 = mbedtls_mpi_sub_mpi(ra_507, s0_101, fp + -60, a3_533, a4_534, a5_535, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_2848, out s1_583, out a0_573, out a2_1016, out a3_576, out a4_1018, out a5_1019, out a7_2849, out s2_1025, out s3_1026, out s4_586, out s8_1004);
							while (true)
							{
								s0_101 = a0_573;
								if (a0_573 != 0x00)
									break;
								if (a5_1019 >= 0x00)
								{
l230945DC:
									Eq_2 s1_669;
									Eq_2 s5_673;
									Eq_2 a0_682;
									word32 s4_2855;
									word32 s0_2853;
									word32 a3_2854;
									Eq_2 ra_667 = mbedtls_mpi_mul_mpi(ra_581, s1_583, fp + -72, fp + -60, a3_576, a4_1018, s2_1025, s4_586, s6_1002, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2853, out s1_669, out a0_682, out a2_1016, out a3_2854, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2855, out s5_673, out s6_1002, out s8_1004);
									s0_101 = a0_682;
									if (a0_682 == 0x00)
									{
										Eq_2 a0_696;
										Eq_2 a3_699;
										Eq_2 s1_703;
										Eq_2 s4_713;
										word32 s5_2856;
										word32 s9_2857;
										Eq_2 ra_709 = ecp_modp(ra_667, s1_669, a2_1016, a4_1018, a5_1019, s2_1025, s5_673, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_703, out a0_696, out a2_1016, out a3_699, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_713, out s5_2856, out s6_1002, out s7, out s8_1004, out s9_2857, out s10, out s11, out mstatus);
										s0_101 = a0_696;
										if (a0_696 == 0x00)
										{
											word32 a3_2860;
											word32 s5_2861;
											word32 s1_2859;
											word32 s0_2858;
											Eq_2 a0_728;
											ra_113 = mbedtls_mpi_mul_int(ra_709, fp + -96, s1_703, a3_699, a4_1018, s2_1025, s4_713, s6_1002, mstatus, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArg0118, out s0_2858, out s1_2859, out a0_728, out a2_1016, out a3_2860, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_118, out s5_2861, out s6_1002, out s8_1004);
											while (true)
											{
												s0_101 = a0_728;
												if (a0_728 != 0x00)
													break;
												Eq_2 a5_766;
												word32 a6_2864;
												word32 a1_2862;
												word32 a2_2863;
												if (mbedtls_mpi_cmp_mpi(a2_1016, a4_1018, a5_1019, out a1_2862, out a2_2863, out a3_181, out a4_182, out a5_766, out a6_2864) < 0x00)
													goto l23094610;
												word32 s0_2865;
												word32 s1_2866;
												word32 a1_2867;
												word32 a3_2868;
												word32 a7_2869;
												ra_113 = mbedtls_mpi_sub_abs(ra_113, fp + -96, fp + -96, s3_1026, a3_181, a4_182, a5_766, mstatus, dwArg58, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_2865, out s1_2866, out a0_728, out a1_2867, out a2_1016, out a3_2868, out a4_1018, out a5_1019, out a7_2869, out s2_1025, out s3_1026, out s4_118, out s8_1004);
											}
										}
									}
									break;
								}
								Eq_2 a5_609;
								word32 a6_2852;
								word32 a2_2851;
								word32 a1_2850;
								if (mbedtls_mpi_cmp_int(0x00, a2_1016, out a1_2850, out a2_2851, out a3_576, out a4_1018, out a5_609, out a6_2852) == 0x00)
									goto l230945DC;
								word32 s0_3018;
								word32 a1_3019;
								word32 a7_3020;
								ra_581 = mbedtls_mpi_add_mpi(ra_581, a0_573, fp + -60, a3_576, a4_1018, a5_609, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_3018, out s1_583, out a0_573, out a1_3019, out a2_1016, out a3_576, out a4_1018, out a5_1019, out a7_3020, out s2_1025, out s3_1026, out s4_586, out s8_1004);
							}
							break;
						}
						Eq_2 a0_543;
						word32 a1_2844;
						word32 a3_2845;
						word32 a7_2846;
						word32 s4_2847;
						word32 s0_2842;
						word32 s1_2843;
						ra_507 = mbedtls_mpi_sub_abs(ra_507, fp + -72, fp + -72, s3_1026, a3_533, a4_534, a5_535, mstatus, dwArg58, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_2842, out s1_2843, out a0_543, out a1_2844, out a2_1016, out a3_2845, out a4_1018, out a5_1019, out a7_2846, out s2_1025, out s3_1026, out s4_2847, out s8_1004);
						s0_101 = a0_543;
					} while (a0_543 == 0x00);
				}
			}
		}
	}
	else
	{
		Eq_2 s1_53;
		Eq_2 s5_57;
		Eq_2 a0_66;
		word32 s4_2755;
		word32 a3_2754;
		word32 s0_2753;
		Eq_2 ra_51 = mbedtls_mpi_mul_mpi(ra, fp + -84, a2, a2, a3, a4, a0, a2, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2753, out s1_53, out a0_66, out a2_1016, out a3_2754, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2755, out s5_57, out s6_1002, out s8_1004);
		s0_101 = a0_66;
		if (a0_66 == 0x00)
		{
			Eq_2 a0_73;
			Eq_2 a3_76;
			Eq_2 s1_80;
			Eq_2 s4_90;
			word32 s9_2792;
			word32 s5_2791;
			Eq_2 ra_86 = ecp_modp(ra_51, s1_53, a2_1016, a4_1018, a5_1019, s2_1025, s5_57, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_80, out a0_73, out a2_1016, out a3_76, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_90, out s5_2791, out s6_1002, out s7, out s8_1004, out s9_2792, out s10, out s11, out mstatus);
			s0_101 = a0_73;
			if (a0_73 == 0x00)
			{
				Eq_2 a0_105;
				word32 a3_2794;
				word32 s0_2793;
				word32 s5_2796;
				word32 s3_2795;
				Eq_2 s1_115;
				ra_113 = mbedtls_mpi_mul_int(ra_86, fp + -96, s1_80, a3_76, a4_1018, s2_1025, s4_90, s6_1002, mstatus, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArg0118, out s0_2793, out s1_115, out a0_105, out a2_1016, out a3_2794, out a4_1018, out a5_1019, out s2_1025, out s3_2795, out s4_118, out s5_2796, out s6_1002, out s8_1004);
				s0_101 = a0_105;
				s3_1026 = (word32) s2_1025 + 4;
				if (a0_105 == 0x00)
				{
					do
					{
						Eq_2 a2_140;
						Eq_2 a3_141;
						Eq_2 a4_142;
						Eq_2 a5_143;
						word32 a6_2798;
						word32 a1_2797;
						if (mbedtls_mpi_cmp_mpi(a2_1016, a4_1018, a5_1019, out a1_2797, out a2_140, out a3_141, out a4_142, out a5_143, out a6_2798) < 0x00)
						{
							Eq_2 s6_175 = (word32) s2_1025 + 16;
							word32 a2_2804;
							word32 a5_2805;
							word32 a6_2806;
							word32 a1_2803;
							if (mbedtls_mpi_cmp_int(0x00, a2_140, out a1_2803, out a2_2804, out a3_181, out a4_182, out a5_2805, out a6_2806) != 0x00)
							{
								Eq_2 a2_187 = (word32) s4_118 + 24;
								Eq_2 s1_200;
								Eq_2 s5_204;
								Eq_2 a0_213;
								word32 a3_2812;
								word32 s4_2813;
								word32 s0_2811;
								Eq_2 ra_198 = mbedtls_mpi_mul_mpi(ra_113, s1_115, a2_187, a2_187, a3_181, a4_182, s2_1025, s4_118, s6_175, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2811, out s1_200, out a0_213, out a2_1016, out a3_2812, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2813, out s5_204, out s6_1002, out s8_1004);
								s0_101 = a0_213;
								if (a0_213 == 0x00)
								{
									Eq_2 a0_221;
									Eq_2 a3_224;
									Eq_2 s1_228;
									Eq_2 s4_238;
									word32 s5_2814;
									word32 s9_2815;
									Eq_2 ra_234 = ecp_modp(ra_198, s1_200, a2_1016, a4_1018, a5_1019, s2_1025, s5_204, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_228, out a0_221, out a2_1016, out a3_224, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_238, out s5_2814, out s6_1002, out s7, out s8_1004, out s9_2815, out s10, out s11, out mstatus);
									s0_101 = a0_221;
									if (a0_221 == 0x00)
									{
										Eq_2 s5_266;
										Eq_2 a0_275;
										word32 s0_2816;
										word32 s1_2817;
										word32 a3_2818;
										word32 s4_2819;
										Eq_2 ra_260 = mbedtls_mpi_mul_mpi(ra_234, fp + -72, s1_228, s1_228, a3_224, a4_1018, s2_1025, s4_238, s6_1002, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2816, out s1_2817, out a0_275, out a2_1016, out a3_2818, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2819, out s5_266, out s6_1002, out s8_1004);
										s0_101 = a0_275;
										if (a0_275 == 0x00)
										{
											Eq_2 a0_280;
											Eq_2 a3_283;
											Eq_2 s1_287;
											Eq_2 s4_297;
											word32 s9_2821;
											word32 s5_2820;
											Eq_2 ra_293 = ecp_modp(ra_260, fp + -72, a2_1016, a4_1018, a5_1019, s2_1025, s5_266, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_287, out a0_280, out a2_1016, out a3_283, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_297, out s5_2820, out s6_1002, out s7, out s8_1004, out s9_2821, out s10, out s11, out mstatus);
											s0_101 = a0_280;
											if (a0_280 == 0x00)
											{
												Eq_2 s1_321;
												Eq_2 s5_325;
												Eq_2 a0_334;
												word32 a3_2823;
												word32 s4_2824;
												word32 s0_2822;
												Eq_2 ra_319 = mbedtls_mpi_mul_mpi(ra_293, s1_287, fp + -72, s6_1002, a3_283, a4_1018, s2_1025, s4_297, s6_1002, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2822, out s1_321, out a0_334, out a2_1016, out a3_2823, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2824, out s5_325, out s6_1002, out s8_1004);
												s0_101 = a0_334;
												if (a0_334 == 0x00)
												{
													Eq_2 a0_339;
													Eq_2 a3_342;
													word32 s9_2828;
													word32 s1_2825;
													word32 s4_2826;
													word32 s5_2827;
													Eq_2 ra_352 = ecp_modp(ra_319, s1_321, a2_1016, a4_1018, a5_1019, s2_1025, s5_325, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_2825, out a0_339, out a2_1016, out a3_342, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2826, out s5_2827, out s6_1002, out s7, out s8_1004, out s9_2828, out s10, out s11, out mstatus);
													s0_101 = a0_339;
													if (a0_339 == 0x00)
													{
														word32 a3_2832;
														word32 a7_2833;
														word32 s1_2830;
														word32 a1_2831;
														word32 s0_2829;
														Eq_2 a0_371;
														ra_113 = mbedtls_mpi_add_mpi(ra_352, a0_339, fp + -96, a3_342, a4_1018, a5_1019, s2_1025, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_2829, out s1_2830, out a0_371, out a1_2831, out a2_1016, out a3_2832, out a4_1018, out a5_1019, out a7_2833, out s2_1025, out s3_1026, out s4_118, out s8_1004);
														while (true)
														{
															s0_101 = a0_371;
															if (a0_371 != 0x00)
																break;
															Eq_2 a5_407;
															word32 a6_2836;
															word32 a1_2834;
															word32 a2_2835;
															if (mbedtls_mpi_cmp_mpi(a2_1016, a4_1018, a5_1019, out a1_2834, out a2_2835, out a3_181, out a4_182, out a5_407, out a6_2836) < 0x00)
																goto l23094610;
															word32 a3_2840;
															word32 a7_2841;
															word32 s1_2838;
															word32 a1_2839;
															word32 s0_2837;
															ra_113 = mbedtls_mpi_sub_abs(ra_113, fp + -96, fp + -96, s3_1026, a3_181, a4_182, a5_407, mstatus, dwArg58, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_2837, out s1_2838, out a0_371, out a1_2839, out a2_1016, out a3_2840, out a4_1018, out a5_1019, out a7_2841, out s2_1025, out s3_1026, out s4_118, out s8_1004);
														}
													}
												}
											}
										}
									}
								}
							}
							else
							{
l23094610:
								Eq_2 s6_799 = (word32) s4_118 + 0x0C;
								word32 s0_2807;
								word32 s1_2808;
								word32 a3_2809;
								Eq_2 s5_825;
								Eq_2 a0_834;
								word32 s4_2810;
								Eq_2 ra_819 = mbedtls_mpi_mul_mpi(ra_113, fp + -72, s6_799, s6_799, a3_181, a4_182, s2_1025, s4_118, s6_799, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2807, out s1_2808, out a0_834, out a2_1016, out a3_2809, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2810, out s5_825, out s6_1002, out s8_1004);
								s0_101 = a0_834;
								if (a0_834 == 0x00)
								{
									Eq_2 a0_848;
									word32 s5_2873;
									word32 s9_2874;
									word32 s4_2872;
									word32 a3_2871;
									word32 s1_2870;
									Eq_2 ra_861 = ecp_modp(ra_819, fp + -72, a2_1016, a4_1018, a5_1019, s2_1025, s5_825, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_2870, out a0_848, out a2_1016, out a3_2871, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2872, out s5_2873, out s6_1002, out s7, out s8_1004, out s9_2874, out s10, out s11, out mstatus);
									s0_101 = a0_848;
									if (a0_848 == 0x00)
									{
										Eq_2 a0_879;
										word32 s3_2878;
										word32 s0_2875;
										word32 a3_2876;
										word32 a7_2877;
										Eq_2 s4_892;
										Eq_2 s1_889;
										Eq_2 ra_887 = mbedtls_mpi_shift_l(ra_861, (struct Eq_531059 *) 0x01, a2_1016, a4_1018, a5_1019, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_2875, out s1_889, out a0_879, out a2_1016, out a3_2876, out a4_1018, out a5_1019, out a7_2877, out s2_1025, out s3_2878, out s4_892, out s8_1004);
										s0_101 = a0_879;
										s3_1026 = (word32) s2_1025 + 4;
										if (a0_879 == 0x00)
										{
											do
											{
												Eq_2 a3_913;
												Eq_2 a4_914;
												Eq_2 a5_915;
												word32 a2_2880;
												word32 a6_2881;
												word32 a1_2879;
												if (mbedtls_mpi_cmp_mpi(a2_1016, a4_1018, a5_1019, out a1_2879, out a2_2880, out a3_913, out a4_914, out a5_915, out a6_2881) < 0x00)
												{
													Eq_2 s1_962;
													Eq_2 s5_966;
													Eq_2 a0_975;
													word32 s0_2886;
													word32 a3_2887;
													word32 s4_2888;
													Eq_2 ra_960 = mbedtls_mpi_mul_mpi(ra_887, s1_889, s4_892, fp + -72, a3_913, a4_914, s2_1025, s4_892, s6_1002, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2886, out s1_962, out a0_975, out a2_1016, out a3_2887, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2888, out s5_966, out s6_1002, out s8_1004);
													s0_101 = a0_975;
													if (a0_975 == 0x00)
													{
														Eq_2 a0_983;
														word32 s9_2893;
														word32 s5_2892;
														word32 s4_2891;
														word32 a3_2890;
														word32 s1_2889;
														Eq_2 ra_996 = ecp_modp(ra_960, s1_962, a2_1016, a4_1018, a5_1019, s2_1025, s5_966, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_2889, out a0_983, out a2_1016, out a3_2890, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2891, out s5_2892, out s6_1002, out s7, out s8_1004, out s9_2893, out s10, out s11, out mstatus);
														s0_101 = a0_983;
														if (a0_983 == 0x00)
														{
															word32 a3_2895;
															word32 a7_2896;
															word32 s0_2894;
															Eq_2 a0_1014;
															Eq_2 s1_1024;
															Eq_2 s4_1027;
															Eq_2 ra_1022 = mbedtls_mpi_shift_l(ra_996, (struct Eq_531059 *) 0x01, a2_1016, a4_1018, a5_1019, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_2894, out s1_1024, out a0_1014, out a2_1016, out a3_2895, out a4_1018, out a5_1019, out a7_2896, out s2_1025, out s3_1026, out s4_1027, out s8_1004);
															while (true)
															{
																s0_101 = a0_1014;
																if (a0_1014 != 0x00)
																	break;
																Eq_2 a3_1048;
																Eq_2 a4_1049;
																Eq_2 a5_1050;
																word32 a6_2899;
																word32 a2_2898;
																word32 a1_2897;
																if (mbedtls_mpi_cmp_mpi(a2_1016, a4_1018, a5_1019, out a1_2897, out a2_2898, out a3_1048, out a4_1049, out a5_1050, out a6_2899) < 0x00)
																{
																	Eq_2 s5_1100;
																	Eq_2 a0_1109;
																	word32 s0_2904;
																	word32 s1_2905;
																	word32 a3_2906;
																	word32 s4_2907;
																	Eq_2 ra_1094 = mbedtls_mpi_mul_mpi(ra_1022, fp + -60, fp + -72, fp + -72, a3_1048, a4_1049, s2_1025, s4_1027, s6_1002, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_2904, out s1_2905, out a0_1109, out a2_1016, out a3_2906, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2907, out s5_1100, out s6_1002, out s8_1004);
																	s0_101 = a0_1109;
																	if (a0_1109 == 0x00)
																	{
																		Eq_2 a0_1117;
																		word32 s9_2912;
																		word32 s5_2911;
																		word32 s4_2910;
																		word32 s1_2908;
																		word32 a3_2909;
																		Eq_2 ra_1130 = ecp_modp(ra_1094, fp + -60, a2_1016, a4_1018, a5_1019, s2_1025, s5_1100, s6_1002, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_2908, out a0_1117, out a2_1016, out a3_2909, out a4_1018, out a5_1019, out s2_1025, out s3_1026, out s4_2910, out s5_2911, out s6_1002, out s7, out s8_1004, out s9_2912, out s10, out s11, out mstatus);
																		s0_101 = a0_1117;
																		if (a0_1117 == 0x00)
																		{
																			word32 a3_2915;
																			word32 a7_2916;
																			word32 s0_2913;
																			word32 s1_2914;
																			Eq_2 a0_1148;
																			Eq_2 s4_1161;
