pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23094958: Register Eq_2 ecp_normalize_jac(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 a2Out, Register out Eq_541613 a4Out, Register out Eq_541614 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out Eq_541621 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      ecp_normalize_jac_many
//      mbedtls_ecp_mul
Eq_2 ecp_normalize_jac(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0124, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & a2Out, union Eq_541613 & a4Out, union Eq_541614 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_541621 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	word32 a1_482;
	word32 a2_483;
	word32 a3_484;
	word32 a6_485;
	Eq_541613 a4_26;
	Eq_541614 a5_27;
	Eq_2 a0_22 = mbedtls_mpi_cmp_int(0x00, a2, out a1_482, out a2_483, out a3_484, out a4_26, out a5_27, out a6_485);
	Eq_2 s3_119 = (word32) a1 + 24;
	Eq_2 s2_111 = a0;
	Eq_2 s0_100 = a0_22;
	if (a0_22 != 0x00)
	{
		mbedtls_mpi_init(fp + -56);
		mbedtls_mpi_init(fp + -44);
		Eq_2 a0_44;
		Eq_2 a3_47;
		Eq_2 s4_60;
		word32 s1_486;
		word32 s5_487;
		word32 s8_488;
		Eq_2 a5_108;
		Eq_2 a4_107;
		Eq_2 a2_105;
		Eq_2 ra_59 = mbedtls_mpi_inv_mod(ra, a0_22, (word32) a1 + 24, (word32) a0 + 4, s5, s6, s7, s10, s11, mstatus, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, s1, dwArg64, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0124, out s1_486, out a0_44, out a2_105, out a3_47, out a4_107, out a5_108, out s2_111, out s3_119, out s4_60, out s5_487, out s6, out s7, out s8_488, out s9, out s10, out s11);
		s0_100 = a0_44;
		if (a0_44 == 0x00)
		{
			Eq_2 s5_89;
			Eq_2 a0_98;
			word32 s0_500;
			word32 s1_501;
			word32 a3_502;
			word32 s4_503;
			word32 s8_504;
			Eq_2 ra_83 = mbedtls_mpi_mul_mpi(ra_59, fp + -44, fp + -56, fp + -56, a3_47, a4_107, s2_111, s4_60, s6, mstatus, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_500, out s1_501, out a0_98, out a2_105, out a3_502, out a4_107, out a5_108, out s2_111, out s3_119, out s4_503, out s5_89, out s6, out s8_504);
			s0_100 = a0_98;
			if (a0_98 == 0x00)
			{
				Eq_2 a0_103;
				Eq_2 a3_106;
				Eq_2 s1_110;
				Eq_2 s4_120;
				word32 s5_505;
				word32 s8_506;
				Eq_2 ra_116 = ecp_modp(ra_83, fp + -44, a2_105, a4_107, a5_108, s2_111, s5_89, s6, s7, s10, s11, mstatus, dwLoc38, dwLoc30, dwLoc2C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgE8, dwArgF4, out s1_110, out a0_103, out a2_105, out a3_106, out a4_107, out a5_108, out s2_111, out s3_119, out s4_120, out s5_505, out s6, out s7, out s8_506, out s9, out s10, out s11, out mstatus);
				s0_100 = a0_103;
				if (a0_103 == 0x00)
				{
					Eq_2 s1_144;
					Eq_2 s5_148;
					Eq_2 a0_157;
					word32 s0_507;
					word32 a3_508;
					word32 s4_509;
					word32 s8_510;
					Eq_2 ra_142 = mbedtls_mpi_mul_mpi(ra_116, s1_110, s1_110, fp + -44, a3_106, a4_107, s2_111, s4_120, s6, mstatus, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_507, out s1_144, out a0_157, out a2_105, out a3_508, out a4_107, out a5_108, out s2_111, out s3_119, out s4_509, out s5_148, out s6, out s8_510);
					s0_100 = a0_157;
					if (a0_157 == 0x00)
					{
						Eq_2 a0_162;
						Eq_2 a3_165;
						word32 s1_169;
						Eq_2 s4_179;
						word32 s5_511;
						word32 s8_512;
						Eq_2 ra_175 = ecp_modp(ra_142, s1_144, a2_105, a4_107, a5_108, s2_111, s5_148, s6, s7, s10, s11, mstatus, dwLoc38, dwLoc30, dwLoc2C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgE8, dwArgF4, out s1_169, out a0_162, out a2_105, out a3_165, out a4_107, out a5_108, out s2_111, out s3_119, out s4_179, out s5_511, out s6, out s7, out s8_512, out s9, out s10, out s11, out mstatus);
						s0_100 = a0_162;
						if (a0_162 == 0x00)
						{
							Eq_2 s1_204;
							Eq_2 s5_208;
							Eq_2 a0_217;
							word32 s0_513;
							word32 a3_514;
							word32 s4_515;
							word32 s8_516;
							Eq_2 ra_202 = mbedtls_mpi_mul_mpi(ra_175, s1_169 + 0x0C, s1_169 + 0x0C, fp + -44, a3_165, a4_107, s2_111, s4_179, s6, mstatus, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_513, out s1_204, out a0_217, out a2_105, out a3_514, out a4_107, out a5_108, out s2_111, out s3_119, out s4_515, out s5_208, out s6, out s8_516);
							s0_100 = a0_217;
							if (a0_217 == 0x00)
							{
								Eq_2 a0_222;
								Eq_2 a3_225;
								Eq_2 s1_229;
								Eq_2 s4_239;
								word32 s5_517;
								word32 s8_518;
								Eq_2 ra_235 = ecp_modp(ra_202, s1_204, a2_105, a4_107, a5_108, s2_111, s5_208, s6, s7, s10, s11, mstatus, dwLoc38, dwLoc30, dwLoc2C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgE8, dwArgF4, out s1_229, out a0_222, out a2_105, out a3_225, out a4_107, out a5_108, out s2_111, out s3_119, out s4_239, out s5_517, out s6, out s7, out s8_518, out s9, out s10, out s11, out mstatus);
								s0_100 = a0_222;
								if (a0_222 == 0x00)
								{
									Eq_2 s1_263;
									Eq_2 s5_267;
									Eq_2 a0_276;
									word32 s0_519;
									word32 a3_520;
									word32 s4_521;
									word32 s8_522;
									Eq_2 ra_261 = mbedtls_mpi_mul_mpi(ra_235, s1_229, s1_229, fp + -56, a3_225, a4_107, s2_111, s4_239, s6, mstatus, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_519, out s1_263, out a0_276, out a2_105, out a3_520, out a4_107, out a5_108, out s2_111, out s3_119, out s4_521, out s5_267, out s6, out s8_522);
									s0_100 = a0_276;
									if (a0_276 == 0x00)
									{
										Eq_2 a0_281;
										Eq_2 a3_284;
										word32 s1_523;
										word32 s4_524;
										word32 s5_525;
										word32 s8_526;
										Eq_2 ra_294 = ecp_modp(ra_261, s1_263, a2_105, a4_107, a5_108, s2_111, s5_267, s6, s7, s10, s11, mstatus, dwLoc38, dwLoc30, dwLoc2C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgE8, dwArgF4, out s1_523, out a0_281, out a2_105, out a3_284, out a4_107, out a5_108, out s2_111, out s3_119, out s4_524, out s5_525, out s6, out s7, out s8_526, out s9, out s10, out s11, out mstatus);
										s0_100 = a0_281;
										if (a0_281 == 0x00)
										{
											word32 s1_527;
											word32 a1_528;
											word32 a3_529;
											word32 a7_530;
											word32 s4_531;
											word32 s8_532;
											mbedtls_mpi_lset(ra_294, a3_284, a4_107, mstatus, dwLoc40, dwLoc3C, dwLoc18, dwLoc08, dwArgB8, dwArgF8, dwArg0138, out s1_527, out a1_528, out a2_105, out a3_529, out a4_107, out a5_108, out a7_530, out s2_111, out s3_119, out s4_531, out s8_532);
											s0_100 = s3_119;
										}
									}
								}
							}
						}
					}
				}
			}
		}
		Eq_2 a2_341;
		Eq_2 a5_342;
		Eq_2 a4_345;
		word32 a0_489;
		word32 a1_490;
		word32 a3_491;
		word32 a6_492;
		word32 s4_493;
		mbedtls_mpi_free(fp + -56, a2_105, a4_107, a5_108, mstatus, dwArg0108, dwArg0148, out a0_489, out a1_490, out a2_341, out a3_491, out a4_345, out a5_342, out a6_492, out s4_493);
		word32 a0_494;
		word32 a1_495;
		word32 a2_496;
		word32 a3_497;
		word32 a6_498;
		word32 s4_499;
		mbedtls_mpi_free(fp + -44, a2_341, a4_345, a5_342, mstatus, dwArg0108, dwArg0148, out a0_494, out a1_495, out a2_496, out a3_497, out a4_26, out a5_27, out a6_498, out s4_499);
	}
	a2Out = dwArg0138;
	a4Out = a4_26;
	a5Out = a5_27;
	s2Out = s2_111;
	s3Out = s3_119;
	s4Out = dwArgF4;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArgD4;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return s0_100;
}

