pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23094A24: Register Eq_2 ecp_normalize_jac_many(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_542030 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_542032) s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ecp_mul
Eq_2 ecp_normalize_jac_many(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_542030 & a5Out, union Eq_2 & s2Out, struct Eq_542032 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s8_1017;
	Eq_2 a2_35;
	Eq_542030 a5_38;
	Eq_2 a4_37;
	Eq_2 s2_1005;
	struct Eq_542032 * s3_1006;
	Eq_2 s4_1010;
	Eq_2 s0_53;
	if (a2 <= 0x01)
	{
		word32 s9_1056;
		s0_53 = ecp_normalize_jac(ra, a1, a0, *a1, a2, s5, s6, s7, s10, s11, mstatus, dwLoc5C, dwLoc58, dwLoc48, s2, dwLoc28, dwLoc1C, dwLoc18, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg58, dwArg68, dwArg74, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgC4, dwArgD8, dwArgE8, dwArgF8, out a2_35, out a4_37, out a5_38, out s2_1005, out s3_1006, out s4_1010, out s6, out s7, out s8_1017, out s9_1056, out s10, out s11, out mstatus);
		goto l23094A48;
	}
	word32 a1_34;
	Eq_2 a3_36;
	word32 s4_1055;
	word32 s1_1054;
	word32 s0_1053;
	Eq_2 ra_40 = mycalloc(ra, a1, a2, 0x0C, a3, a4, 0x01, mstatus, s6, s4, dwArgB8, dwArgF8, out s0_1053, out s1_1054, out a1_34, out a2_35, out a3_36, out a4_37, out a5_38, out s2_1005, out s3_1006, out s4_1055, out s8_1017);
	s4_1010 = a2;
	if (a2 == 0x00)
	{
		s0_53.u0 = 0xFB000280;
		goto l23094A48;
	}
	mbedtls_mpi_init(fp + -84);
	mbedtls_mpi_init(fp + -72);
	word32 a0_63;
	word32 a7_1061;
	word32 a6_1060;
	word32 a1_1059;
	word32 s1_1058;
	word32 s0_1057;
	Eq_2 s4_151;
	Eq_2 a3_102;
	Eq_2 a5_108;
	Eq_2 a4_100;
	Eq_2 a2_105;
	Eq_2 s2_114;
	Eq_2 ra_147 = mbedtls_mpi_copy(ra_40, a2, a1_34 + 0x18, a2_35, a3_36, a4_37, mbedtls_mpi_init(fp + -60), mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_1057, out s1_1058, out a0_63, out a1_1059, out a2_105, out a3_102, out a4_100, out a5_108, out a6_1060, out a7_1061, out s2_114, out s3_1006, out s4_151, out s8_1017);
	if (a0_63 == 0x00)
	{
		Eq_2 s6_164 = (word32) s4_151 + 0x0C;
		do
		{
			Eq_2 s5_117;
			word32 a0_126;
			word32 s4_1109;
			word32 a3_1108;
			word32 s0_1106;
			word32 s1_1107;
			Eq_2 ra_111 = mbedtls_mpi_mul_mpi(ra_147, s6_164, (word32) s6_164 - 0x0C, (word32) a2_105 + 24, a3_102, a4_100, s2_114, s4_151, s6_164, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1106, out s1_1107, out a0_126, out a2_105, out a3_1108, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_1109, out s5_117, out s6, out s8_1017);
			if (a0_126 != 0x00)
				goto l23094B08;
			Eq_2 a0_134;
			Eq_2 s5_152;
			word32 s1_1077;
			word32 s9_1078;
			ra_147 = ecp_modp(ra_111, s6, a2_105, a4_100, a5_108, s2_114, s5_117, s6, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_1077, out a0_134, out a2_105, out a3_102, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_151, out s5_152, out s6, out s7, out s8_1017, out s9_1078, out s10, out s11, out mstatus);
			if (a0_134 != 0x00)
				goto l23094B08;
			s6_164 = (word32) s6 + 0x0C;
		} while (s2_114 != (word32) s5_152 + 1);
		word32 a0_172;
		word32 s9_1080;
		word32 s1_1079;
		word32 s5_196;
		Eq_2 s4_188;
		Eq_2 a3_175;
		word32 ra_187 = mbedtls_mpi_inv_mod(ra_147, a0_134, s2_114 + s4_151, s3_1006 + 4, s5_152, s6 + 0x0C, s7, s10, s11, mstatus, s2, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, s3, s1, dwArg58, dwArg78, dwArg88, dwArg98, dwArg0104, out s1_1079, out a0_172, out a2_105, out a3_175, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_188, out s5_196, out s6, out s7, out s8_1017, out s9_1080, out s10, out s11);
		if (a0_172 != 0x00)
			goto l23094B08;
		a5_108 = s2_114 << 0x02;
		s6 = (word32) s4_188 - 0x0C;
		s7.u0 = 0x0C;
l23094AEA:
		Eq_2 a3_312;
		Eq_2 ra_322;
		Eq_2 s4_326;
		word32 a0_309;
		if (s5_196 == 0x00)
		{
			word32 s0_1085;
			word32 s1_1086;
			word32 a1_1087;
			word32 a6_1088;
			word32 a7_1089;
			ra_322 = mbedtls_mpi_copy(ra_187, fp + -72, fp + -84, a2_105, a3_175, a4_100, a5_108, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s0_1085, out s1_1086, out a0_309, out a1_1087, out a2_105, out a3_312, out a4_100, out a5_108, out a6_1088, out a7_1089, out s2_114, out s3_1006, out s4_326, out s8_1017);
			goto l23094AF6;
		}
		Eq_2 s5_233;
		word32 a0_242;
		word32 s4_1084;
		word32 a3_1083;
		word32 s1_1082;
		word32 s0_1081;
		Eq_2 ra_227 = mbedtls_mpi_mul_mpi(ra_187, fp + -72, fp + -84, (word32) s6 + ((byte) s7.u0 + s5_196), a3_175, a4_100, s2_114, s4_188, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1081, out s1_1082, out a0_242, out a2_105, out a3_1083, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_1084, out s5_233, out s6, out s8_1017);
		if (a0_242 != 0x00)
			goto l23094B08;
		word32 a0_249;
		Eq_2 a3_252;
		struct Eq_542726 * s1_256;
		Eq_2 s4_266;
		word32 s9_1132;
		word32 s5_1131;
		Eq_2 ra_262 = ecp_modp(ra_227, fp + -72, a2_105, a4_100, a5_108, s2_114, s5_233, s6, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_256, out a0_249, out a2_105, out a3_252, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_266, out s5_1131, out s6, out s7, out s8_1017, out s9_1132, out s10, out s11, out mstatus);
		if (a0_249 == 0x00)
		{
			Eq_2 s5_295;
			word32 a0_304;
			word32 s4_1136;
			word32 a3_1135;
			word32 s1_1134;
			word32 s0_1133;
			Eq_2 ra_289 = mbedtls_mpi_mul_mpi(ra_262, fp + -84, fp + -84, s1_256->dwFFFFFFFC + 0x18, a3_252, a4_100, s2_114, s4_266, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1133, out s1_1134, out a0_304, out a2_105, out a3_1135, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_1136, out s5_295, out s6, out s8_1017);
			if (a0_304 != 0x00)
				goto l23094B08;
			word32 s5_1138;
			word32 s1_1137;
			word32 s9_1139;
			ra_322 = ecp_modp(ra_289, fp + -84, a2_105, a4_100, a5_108, s2_114, s5_295, s6, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_1137, out a0_309, out a2_105, out a3_312, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_326, out s5_1138, out s6, out s7, out s8_1017, out s9_1139, out s10, out s11, out mstatus);
l23094AF6:
			if (a0_309 == 0x00)
			{
				Eq_2 s5_390;
				word32 a0_399;
				word32 s1_1091;
				word32 a3_1092;
				word32 s4_1093;
				word32 s0_1090;
				Eq_2 ra_384 = mbedtls_mpi_mul_mpi(ra_322, fp + -60, fp + -72, fp + -72, a3_312, a4_100, s2_114, s4_326, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1090, out s1_1091, out a0_399, out a2_105, out a3_1092, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_1093, out s5_390, out s6, out s8_1017);
				if (a0_399 != 0x00)
					goto l23094B08;
				word32 a0_407;
				Eq_2 a3_410;
				struct Eq_542378 * s1_414;
				Eq_2 s4_424;
				word32 s5_1094;
				word32 s9_1095;
				Eq_2 ra_420 = ecp_modp(ra_384, fp + -60, a2_105, a4_100, a5_108, s2_114, s5_390, s6, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_414, out a0_407, out a2_105, out a3_410, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_424, out s5_1094, out s6, out s7, out s8_1017, out s9_1095, out s10, out s11, out mstatus);
				if (a0_407 == 0x00)
				{
					Eq_2 a1_436 = s1_414->tFFFFFFFC;
					struct Eq_542471 * s1_448;
					Eq_2 s5_452;
					word32 a0_461;
					word32 s4_1112;
					word32 a3_1111;
					word32 s0_1110;
					Eq_2 ra_446 = mbedtls_mpi_mul_mpi(ra_420, a1_436, a1_436, fp + -60, a3_410, a4_100, s2_114, s4_424, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1110, out s1_448, out a0_461, out a2_105, out a3_1111, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_1112, out s5_452, out s6, out s8_1017);
					if (a0_461 == 0x00)
					{
						word32 a0_466;
						Eq_2 a3_469;
						struct Eq_542499 * s1_473;
						Eq_2 s4_483;
						word32 s9_1114;
						word32 s5_1113;
						Eq_2 ra_479 = ecp_modp(ra_446, s1_448->tFFFFFFFC, a2_105, a4_100, a5_108, s2_114, s5_452, s6, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_473, out a0_466, out a2_105, out a3_469, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_483, out s5_1113, out s6, out s7, out s8_1017, out s9_1114, out s10, out s11, out mstatus);
						if (a0_466 == 0x00)
						{
							int32 a1_495 = s1_473->dwFFFFFFFC;
							struct Eq_542532 * s1_508;
							Eq_2 s5_512;
							word32 a0_521;
							word32 s4_1117;
							word32 a3_1116;
							word32 s0_1115;
							Eq_2 ra_506 = mbedtls_mpi_mul_mpi(ra_479, a1_495 + 0x0C, a1_495 + 0x0C, fp + -60, a3_469, a4_100, s2_114, s4_483, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1115, out s1_508, out a0_521, out a2_105, out a3_1116, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_1117, out s5_512, out s6, out s8_1017);
							if (a0_521 == 0x00)
							{
								word32 a0_527;
								Eq_2 a3_530;
								struct Eq_542563 * s1_534;
								Eq_2 s4_544;
								word32 s9_1119;
								word32 s5_1118;
								Eq_2 ra_540 = ecp_modp(ra_506, s1_508->dwFFFFFFFC + 0x0C, a2_105, a4_100, a5_108, s2_114, s5_512, s6, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_534, out a0_527, out a2_105, out a3_530, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_544, out s5_1118, out s6, out s7, out s8_1017, out s9_1119, out s10, out s11, out mstatus);
								if (a0_527 == 0x00)
								{
									int32 a1_556 = s1_534->dwFFFFFFFC;
									struct Eq_542598 * s1_569;
									Eq_2 s5_573;
									word32 a0_582;
									word32 s4_1122;
									word32 a3_1121;
									word32 s0_1120;
									Eq_2 ra_567 = mbedtls_mpi_mul_mpi(ra_540, a1_556 + 0x0C, a1_556 + 0x0C, fp + -72, a3_530, a4_100, s2_114, s4_544, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1120, out s1_569, out a0_582, out a2_105, out a3_1121, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_1122, out s5_573, out s6, out s8_1017);
									if (a0_582 == 0x00)
									{
										word32 a0_588;
										Eq_2 a3_591;
										word32 s5_606;
										word32 s9_1125;
										word32 s4_1124;
										word32 s1_1123;
										Eq_2 ra_601 = ecp_modp(ra_567, s1_569->dwFFFFFFFC + 0x0C, a2_105, a4_100, a5_108, s2_114, s5_573, s6, s7, s10, s11, mstatus, dwLoc58, dwLoc50, dwLoc4C, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_1123, out a0_588, out a2_105, out a3_591, out a4_100, out a5_108, out s2_114, out s3_1006, out s4_1124, out s5_606, out s6, out s7, out s8_1017, out s9_1125, out s10, out s11, out mstatus);
										if (a0_588 == 0x00)
										{
											word32 a0_619;
											Eq_2 a3_622;
											word32 s1_1126;
											Eq_2 ra_626 = mbedtls_mpi_shrink(ra_601, s3_1006[8], a3_591, a4_100, mstatus, dwLoc50, dwLoc4C, dwLoc28, dwArgA8, dwArgE8, dwArg0128, out s1_1126, out a0_619, out a2_105, out a3_622, out a4_100, out a5_108, out s2_114, out s3_1006, out s8_1017);
											if (a0_619 == 0x00)
											{
												word32 a0_644;
												struct Eq_542682 * s1_652;
												word32 a3_1127;
												ra_187 = mbedtls_mpi_shrink(ra_626, s3_1006[8], a3_622, a4_100, mstatus, dwLoc50, dwLoc4C, dwLoc28, dwArgA8, dwArgE8, dwArg0128, out s1_652, out a0_644, out a2_105, out a3_1127, out a4_100, out a5_108, out s2_114, out s3_1006, out s8_1017);
												if (a0_644 == 0x00)
												{
													word32 a6_1130;
													word32 a1_1129;
													word32 a0_1128;
													mbedtls_mpi_free(s1_652->dwFFFFFFFC + 0x18, a2_105, a4_100, a5_108, mstatus, dwArgE8, dwArg0128, out a0_1128, out a1_1129, out a2_105, out a3_175, out a4_100, out a5_108, out a6_1130, out s4_188);
													if (s5_606 != 0x00)
													{
														s5_196 = s5_606 + ~0x00;
														goto l23094AEA;
													}
												}
											}
										}
									}
								}
							}
						}
					}
				}
			}
			goto l23094B08;
		}
	}
l23094B08:
	Eq_2 a2_691;
	Eq_2 a5_692;
	Eq_2 a4_695;
	word32 s4_1066;
	word32 a6_1065;
	word32 a3_1064;
	word32 a1_1063;
	word32 a0_1062;
	mbedtls_mpi_free(fp + -84, a2_105, a4_100, a5_108, mstatus, dwArgE8, dwArg0128, out a0_1062, out a1_1063, out a2_691, out a3_1064, out a4_695, out a5_692, out a6_1065, out s4_1066);
	Eq_2 a2_703;
	Eq_2 a5_704;
	Eq_2 a4_707;
	word32 s4_1071;
	word32 a6_1070;
	word32 a3_1069;
	word32 a1_1068;
	word32 a0_1067;
	mbedtls_mpi_free(fp + -72, a2_691, a4_695, a5_692, mstatus, dwArgE8, dwArg0128, out a0_1067, out a1_1068, out a2_703, out a3_1069, out a4_707, out a5_704, out a6_1070, out s4_1071);
	Eq_2 s4_722;
	word32 a1_1073;
	word32 a0_1072;
	word32 a3_1074;
	word32 a5_1075;
	word32 a6_1076;
	Eq_2 a4_719;
	Eq_2 a2_715;
	mbedtls_mpi_free(fp + -60, a2_703, a4_707, a5_704, mstatus, dwArgE8, dwArg0128, out a0_1072, out a1_1073, out a2_715, out a3_1074, out a4_719, out a5_1075, out a6_1076, out s4_722);
	Eq_2 a5_725 = 0x0C;
	Eq_2 s1_728 = s4_722;
	s2_1005 = (word32) s4_722 + ((word32) s2_114 + 0x0C);
	do
	{
		Eq_2 s4_747;
		word32 a1_1097;
		word32 a3_1098;
		word32 a6_1099;
		word32 a0_1096;
		s1_728 = mbedtls_mpi_free(s1_728, a2_715, a4_719, a5_725, mstatus, dwArgE8, dwArg0128, out a0_1096, out a1_1097, out a2_715, out a3_1098, out a4_719, out a5_725, out a6_1099, out s4_747);
	} while (s2_1005 != s1_728);
	word32 a6_1104;
	word32 t3_1105;
	word32 a3_1103;
	word32 a1_1102;
	word32 s1_1100;
	word32 a0_1101;
	vPortFree(s4_747, a2_715, a5_725, mstatus, dwArgF8, dwArg0138, out s0_53, out s1_1100, out a0_1101, out a1_1102, out a2_35, out a3_1103, out a4_37, out a5_38, out a6_1104, out s4_1010, out t3_1105);
l23094A48:
	s1Out = dwArg28;
	a0Out = s0_53;
	a2Out = a2_35;
	a3Out = dwArg08;
	a4Out = a4_37;
	a5Out = a5_38;
	s2Out = s2_1005;
	s3Out = s3_1006;
	s4Out = s4_1010;
	s5Out = s4;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8_1017;
	s9Out = dwLoc5C;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return dwArg68;
}

