pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23094DE2: Register Eq_2 mbedtls_ecp_set_zero(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_543438 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      ecp_add_mixed
//      mbedtls_ecp_point_read_binary
Eq_2 mbedtls_ecp_set_zero(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_543438 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	word32 a2_157;
	word32 a7_158;
	ptr32 a1_106;
	Eq_2 a3_109;
	Eq_2 a4_111;
	Eq_543438 a5_113;
	ptr32 s1_122;
	ptr32 s2_124;
	ptr32 s3_126;
	ptr32 s4_128;
	ptr32 s8_130;
	Eq_2 ra_119 = mbedtls_mpi_lset(ra, a3, a4, mstatus, dwLoc10, s0, dwArg18, dwArg28, dwArgE8, dwArg0128, dwArg0168, out s1_122, out a1_106, out a2_157, out a3_109, out a4_111, out a5_113, out a7_158, out s2_124, out s3_126, out s4_128, out s8_130);
	if (a0 == 0x00)
	{
		a0 = (word32) a0 + 0x0C;
		word32 a2_159;
		word32 a7_160;
		ra_119 = mbedtls_mpi_lset(ra_119, a3_109, a4_111, mstatus, dwLoc10, s0, dwArg18, dwArg28, dwArgE8, dwArg0128, dwArg0168, out s1_122, out a1_106, out a2_159, out a3_109, out a4_111, out a5_113, out a7_160, out s2_124, out s3_126, out s4_128, out s8_130);
		if (a0 == 0x0C)
		{
			ptr32 a1_66;
			ptr32 a2_67;
			Eq_2 a3_68;
			Eq_2 a4_69;
			Eq_543438 a5_70;
			ptr32 s1_74;
			ptr32 s2_75;
			ptr32 s3_76;
			ptr32 s4_77;
			ptr32 s8_78;
			word32 a7_161;
			Eq_2 ra_73 = mbedtls_mpi_lset(ra_119, a3_109, a4_111, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArgF8, dwArg0138, dwArg0178, out s1_74, out a1_66, out a2_67, out a3_68, out a4_69, out a5_70, out a7_161, out s2_75, out s3_76, out s4_77, out s8_78);
			s1Out = s1_74;
			a0Out = (word32) a0 + 24;
			a1Out = a1_66;
			a2Out = a2_67;
			a3Out = a3_68;
			a4Out = a4_69;
			a5Out = a5_70;
			s2Out = s2_75;
			s3Out = s3_76;
			s4Out = s4_77;
			s8Out = s8_78;
			return ra_73;
		}
	}
	s1Out = s1_122;
	a0Out = a0;
	a1Out = a1_106;
	a2Out = dwArg10;
	a3Out = a3_109;
	a4Out = a4_111;
	a5Out = a5_113;
	s2Out = s2_124;
	s3Out = s3_126;
	s4Out = s4_128;
	s8Out = s8_130;
	return ra_119;
}

// 23094E16: Register Eq_2 ecp_add_mixed(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out ptr32 t1Out, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_543555 a4Out, Register out ptr32 a5Out, Register out Eq_543557 a6Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_519072 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out Eq_543568 t4Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ecp_mul
Eq_2 ecp_add_mixed(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, ptr32 & t1Out, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_543555 & a4Out, ptr32 & a5Out, union Eq_543557 & a6Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_519072 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, union Eq_543568 & t4Out, ptr32 & mstatusOut)
{
	Eq_2 s0_102;
	ptr32 a2_1639;
	ptr32 a5_1640;
	Eq_543557 a6_1644;
	Eq_2 s6_1278 = (word32) a2 + 24;
	Eq_2 s1_13 = a0;
	Eq_2 s4_15 = a1;
	Eq_2 s2_1024 = a2;
	Eq_2 a1_41 = a3;
	word32 a6_2297;
	word32 a1_2296;
	Eq_2 a2_35;
	Eq_2 a5_38;
	Eq_2 a4_126;
	Eq_2 a3_128;
	if (mbedtls_mpi_cmp_int(0x00, a2, out a1_2296, out a2_35, out a3_128, out a4_126, out a5_38, out a6_2297) != 0x00)
	{
		if (*((word32) a3 + 32) == 0x00)
		{
l23094E4C:
			mbedtls_mpi_init(fp + -0x0084);
			mbedtls_mpi_init(fp + -0x0078);
			mbedtls_mpi_init(fp + -0x006C);
			mbedtls_mpi_init(fp + -96);
			mbedtls_mpi_init(fp + -84);
			mbedtls_mpi_init(fp + -72);
			mbedtls_mpi_init(fp + -60);
			Eq_2 s5_143;
			Eq_2 a0_152;
			word32 s4_2305;
			word32 s1_2303;
			word32 a3_2304;
			word32 s0_2302;
			Eq_2 a5_1006;
			Eq_2 a4_1005;
			Eq_2 a2_1003;
			ra = mbedtls_mpi_mul_mpi(ra, fp + -0x0084, (word32) a2 + 24, (word32) a2 + 24, a3_128, a4_126, a2, a1, (word32) a2 + 24, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2302, out s1_2303, out a0_152, out a2_1003, out a3_2304, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2305, out s5_143, out s6_1278, out s8);
			s0_102 = a0_152;
			if (a0_152 == 0x00)
			{
				Eq_2 a0_162;
				Eq_2 a3_165;
				Eq_2 s4_179;
				word32 s9_2342;
				word32 s1_2340;
				word32 s5_2341;
				ra = ecp_modp(ra, fp + -0x0084, a2_1003, a4_1005, a5_1006, s2_1024, s5_143, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2340, out a0_162, out a2_1003, out a3_165, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_179, out s5_2341, out s6_1278, out s7, out s8, out s9_2342, out s10, out s11, out mstatus);
				s0_102 = a0_162;
				if (a0_162 == 0x00)
				{
					Eq_2 s5_207;
					Eq_2 a0_216;
					word32 a3_2345;
					word32 s4_2346;
					word32 s0_2343;
					word32 s1_2344;
					ra = mbedtls_mpi_mul_mpi(ra, fp + -0x0078, fp + -0x0084, s6_1278, a3_165, a4_1005, s2_1024, s4_179, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2343, out s1_2344, out a0_216, out a2_1003, out a3_2345, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2346, out s5_207, out s6_1278, out s8);
					s0_102 = a0_216;
					if (a0_216 == 0x00)
					{
						Eq_2 a0_221;
						Eq_2 a3_224;
						Eq_2 s4_238;
						Eq_2 s5_239;
						word32 s9_2348;
						word32 s1_2347;
						ra = ecp_modp(ra, fp + -0x0078, a2_1003, a4_1005, a5_1006, s2_1024, s5_207, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2347, out a0_221, out a2_1003, out a3_224, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_238, out s5_239, out s6_1278, out s7, out s8, out s9_2348, out s10, out s11, out mstatus);
						s0_102 = a0_221;
						if (a0_221 == 0x00)
						{
							Eq_2 s5_266;
							Eq_2 a0_275;
							word32 s4_2352;
							word32 s1_2350;
							word32 a3_2351;
							word32 s0_2349;
							ra = mbedtls_mpi_mul_mpi(ra, fp + -0x0084, fp + -0x0084, s5_239, a3_224, a4_1005, s2_1024, s4_238, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2349, out s1_2350, out a0_275, out a2_1003, out a3_2351, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2352, out s5_266, out s6_1278, out s8);
							s0_102 = a0_275;
							if (a0_275 == 0x00)
							{
								Eq_2 a0_280;
								Eq_2 a3_283;
								Eq_2 s4_297;
								word32 s5_298;
								word32 s1_2353;
								word32 s9_2354;
								ra = ecp_modp(ra, fp + -0x0084, a2_1003, a4_1005, a5_1006, s2_1024, s5_266, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2353, out a0_280, out a2_1003, out a3_283, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_297, out s5_298, out s6_1278, out s7, out s8, out s9_2354, out s10, out s11, out mstatus);
								s0_102 = a0_280;
								if (a0_280 == 0x00)
								{
									Eq_2 s5_325;
									Eq_2 a0_334;
									word32 s4_2358;
									word32 s0_2355;
									word32 s1_2356;
									word32 a3_2357;
									ra = mbedtls_mpi_mul_mpi(ra, fp + -0x0078, fp + -0x0078, s5_298 + 0x0C, a3_283, a4_1005, s2_1024, s4_297, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2355, out s1_2356, out a0_334, out a2_1003, out a3_2357, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2358, out s5_325, out s6_1278, out s8);
									s0_102 = a0_334;
									if (a0_334 == 0x00)
									{
										Eq_2 a0_339;
										Eq_2 a3_342;
										word32 s5_2361;
										word32 s9_2362;
										word32 s1_2359;
										word32 s4_2360;
										ra = ecp_modp(ra, fp + -0x0078, a2_1003, a4_1005, a5_1006, s2_1024, s5_325, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2359, out a0_339, out a2_1003, out a3_342, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2360, out s5_2361, out s6_1278, out s7, out s8, out s9_2362, out s10, out s11, out mstatus);
										s0_102 = a0_339;
										if (a0_339 == 0x00)
										{
											Eq_2 a0_371;
											word32 s1_2364;
											word32 s4_2366;
											word32 a7_2365;
											word32 s0_2363;
											Eq_2 a3_374;
											ra = mbedtls_mpi_sub_mpi(ra, a0_339, fp + -0x0084, a3_342, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2363, out s1_2364, out a0_371, out a2_1003, out a3_374, out a4_1005, out a5_1006, out a7_2365, out s2_1024, out s3, out s4_2366, out s8);
											s0_102 = a0_371;
											if (a0_371 == 0x00)
											{
												do
												{
													if (a5_1006 >= 0x00)
													{
l23094F8C:
														s7 = (word32) s2_1024 + 0x0C;
														Eq_2 a0_455;
														word32 s0_2370;
														word32 a3_2371;
														word32 a7_2372;
														Eq_2 s4_468;
														Eq_2 s1_465;
														ra = mbedtls_mpi_sub_mpi(ra, s0_102, fp + -0x0078, a3_374, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2370, out s1_465, out a0_455, out a2_1003, out a3_2371, out a4_1005, out a5_1006, out a7_2372, out s2_1024, out s3, out s4_468, out s8);
														s0_102 = a0_455;
														if (a0_455 == 0x00)
														{
															do
															{
																if (a5_1006 >= 0x00)
																{
l23094FA8:
																	Eq_2 a0_1524;
																	Eq_2 a2_531;
																	Eq_2 a3_532;
																	Eq_2 a4_533;
																	word32 a6_2377;
																	word32 a1_2375;
																	word32 a5_2376;
																	if (mbedtls_mpi_cmp_int(0x00, a2_1003, out a1_2375, out a2_531, out a3_532, out a4_533, out a5_2376, out a6_2377) != 0x00)
																	{
																		Eq_2 s5_640;
																		Eq_2 a0_649;
																		word32 s0_2382;
																		word32 s1_2383;
																		word32 a3_2384;
																		word32 s4_2385;
																		ra = mbedtls_mpi_mul_mpi(ra, fp + -60, s6_1278, fp + -0x0084, a3_532, a4_533, s2_1024, s4_468, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2382, out s1_2383, out a0_649, out a2_1003, out a3_2384, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2385, out s5_640, out s6_1278, out s8);
																		s0_102 = a0_649;
																		if (a0_649 == 0x00)
																		{
																			Eq_2 a0_654;
																			Eq_2 a3_657;
																			Eq_2 s4_671;
																			word32 s9_2388;
																			word32 s1_2386;
																			word32 s5_2387;
																			ra = ecp_modp(ra, fp + -60, a2_1003, a4_1005, a5_1006, s2_1024, s5_640, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2386, out a0_654, out a2_1003, out a3_657, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_671, out s5_2387, out s6_1278, out s7, out s8, out s9_2388, out s10, out s11, out mstatus);
																			s0_102 = a0_654;
																			if (a0_654 == 0x00)
																			{
																				Eq_2 s5_699;
																				Eq_2 a0_708;
																				word32 a3_2391;
																				word32 s4_2392;
																				word32 s1_2390;
																				word32 s0_2389;
																				ra = mbedtls_mpi_mul_mpi(ra, fp + -0x006C, fp + -0x0084, fp + -0x0084, a3_657, a4_1005, s2_1024, s4_671, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2389, out s1_2390, out a0_708, out a2_1003, out a3_2391, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2392, out s5_699, out s6_1278, out s8);
																				s0_102 = a0_708;
																				if (a0_708 == 0x00)
																				{
																					Eq_2 a0_713;
																					Eq_2 a3_716;
																					Eq_2 s4_730;
																					word32 s1_2393;
																					word32 s5_2394;
																					word32 s9_2395;
																					ra = ecp_modp(ra, fp + -0x006C, a2_1003, a4_1005, a5_1006, s2_1024, s5_699, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2393, out a0_713, out a2_1003, out a3_716, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_730, out s5_2394, out s6_1278, out s7, out s8, out s9_2395, out s10, out s11, out mstatus);
																					s0_102 = a0_713;
																					if (a0_713 == 0x00)
																					{
																						Eq_2 s5_758;
																						Eq_2 a0_767;
																						word32 s1_2397;
																						word32 a3_2398;
																						word32 s4_2399;
																						word32 s0_2396;
																						ra = mbedtls_mpi_mul_mpi(ra, fp + -96, fp + -0x006C, fp + -0x0084, a3_716, a4_1005, s2_1024, s4_730, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2396, out s1_2397, out a0_767, out a2_1003, out a3_2398, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2399, out s5_758, out s6_1278, out s8);
																						s0_102 = a0_767;
																						if (a0_767 == 0x00)
																						{
																							Eq_2 a0_772;
																							Eq_2 a3_775;
																							Eq_2 s4_789;
																							word32 s1_2400;
																							word32 s5_2401;
																							word32 s9_2402;
																							ra = ecp_modp(ra, fp + -96, a2_1003, a4_1005, a5_1006, s2_1024, s5_758, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2400, out a0_772, out a2_1003, out a3_775, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_789, out s5_2401, out s6_1278, out s7, out s8, out s9_2402, out s10, out s11, out mstatus);
																							s0_102 = a0_772;
																							if (a0_772 == 0x00)
																							{
																								Eq_2 s5_817;
																								Eq_2 a0_826;
																								word32 s0_2403;
																								word32 s1_2404;
																								word32 a3_2405;
																								word32 s4_2406;
																								ra = mbedtls_mpi_mul_mpi(ra, fp + -0x006C, fp + -0x006C, s2_1024, a3_775, a4_1005, s2_1024, s4_789, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2403, out s1_2404, out a0_826, out a2_1003, out a3_2405, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2406, out s5_817, out s6_1278, out s8);
																								s0_102 = a0_826;
																								if (a0_826 == 0x00)
																								{
																									Eq_2 a0_831;
																									Eq_2 a3_834;
																									Eq_2 s4_848;
																									word32 s9_2409;
																									word32 s1_2407;
																									word32 s5_2408;
																									ra = ecp_modp(ra, fp + -0x006C, a2_1003, a4_1005, a5_1006, s2_1024, s5_817, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2407, out a0_831, out a2_1003, out a3_834, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_848, out s5_2408, out s6_1278, out s7, out s8, out s9_2409, out s10, out s11, out mstatus);
																									s0_102 = a0_831;
																									if (a0_831 == 0x00)
																									{
																										Eq_2 a0_863;
																										word32 s1_873;
																										word32 s0_2410;
																										word32 a3_2411;
																										word32 s5_2412;
																										Eq_2 s4_876;
																										ra = mbedtls_mpi_mul_int(ra, fp + -0x0084, fp + -0x006C, a3_834, a4_1005, s2_1024, s4_848, s6_1278, mstatus, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgE8, out s0_2410, out s1_873, out a0_863, out a2_1003, out a3_2411, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_876, out s5_2412, out s6_1278, out s8);
																										s0_102 = a0_863;
																										if (a0_863 == 0x00)
																										{
																											do
																											{
																												Eq_2 a3_899;
																												Eq_2 a4_900;
																												Eq_2 a5_901;
																												word32 a6_2415;
																												word32 a1_2413;
																												word32 a2_2414;
																												if (mbedtls_mpi_cmp_mpi(a2_1003, a4_1005, a5_1006, out a1_2413, out a2_2414, out a3_899, out a4_900, out a5_901, out a6_2415) < 0x00)
																												{
																													Eq_2 s5_952;
																													Eq_2 a0_961;
																													word32 s0_2421;
																													word32 s1_2422;
																													word32 a3_2423;
																													word32 s4_2424;
																													ra = mbedtls_mpi_mul_mpi(ra, s3, fp + -0x0078, fp + -0x0078, a3_899, a4_900, s2_1024, s4_876, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2421, out s1_2422, out a0_961, out a2_1003, out a3_2423, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2424, out s5_952, out s6_1278, out s8);
																													s0_102 = a0_961;
																													if (a0_961 == 0x00)
																													{
																														Eq_2 a0_969;
																														Eq_2 a3_972;
																														word32 s9_2428;
																														word32 s5_2427;
																														word32 s1_2425;
																														word32 s4_2426;
																														ra = ecp_modp(ra, s3, a2_1003, a4_1005, a5_1006, s2_1024, s5_952, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2425, out a0_969, out a2_1003, out a3_972, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2426, out s5_2427, out s6_1278, out s7, out s8, out s9_2428, out s10, out s11, out mstatus);
																														s0_102 = a0_969;
																														if (a0_969 == 0x00)
																														{
																															Eq_2 a0_1001;
																															word32 s0_2429;
																															word32 s1_2430;
																															word32 a7_2431;
																															word32 s2_2432;
																															word32 s4_2433;
																															Eq_2 a3_1004;
																															ra = mbedtls_mpi_sub_mpi(ra, a0_969, s3, a3_972, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2429, out s1_2430, out a0_1001, out a2_1003, out a3_1004, out a4_1005, out a5_1006, out a7_2431, out s2_2432, out s3, out s4_2433, out s8);
																															s0_102 = a0_1001;
																															s2_1024 = s3;
																															if (a0_1001 == 0x00)
																															{
																																do
																																{
																																	if (a5_1006 >= 0x00)
																																	{
l23095082:
																																		word32 s0_2437;
																																		word32 s1_2438;
																																		word32 a7_2439;
																																		word32 s4_2440;
																																		Eq_2 a0_1085;
																																		Eq_2 a3_1088;
																																		ra = mbedtls_mpi_sub_mpi(ra, s0_102, s2_1024, a3_1004, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2437, out s1_2438, out a0_1085, out a2_1003, out a3_1088, out a4_1005, out a5_1006, out a7_2439, out s2_1024, out s3, out s4_2440, out s8);
																																		while (true)
																																		{
																																			s0_102 = a0_1085;
																																			if (a0_1085 != 0x00)
																																				break;
																																			if (a5_1006 >= 0x00)
																																			{
l23095098:
																																				word32 s0_2444;
																																				word32 s1_2445;
																																				word32 a7_2446;
																																				Eq_2 a0_1167;
																																				Eq_2 s4_1180;
																																				Eq_2 a3_1170;
