pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
																																				ra = mbedtls_mpi_sub_mpi(ra, a0_1085, fp + -0x006C, a3_1088, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2444, out s1_2445, out a0_1167, out a2_1003, out a3_1170, out a4_1005, out a5_1006, out a7_2446, out s2_1024, out s3, out s4_1180, out s8);
																																				while (true)
																																				{
																																					s0_102 = a0_1167;
																																					if (a0_1167 != 0x00)
																																						break;
																																					if (a5_1006 >= 0x00)
																																					{
l230950AE:
																																						Eq_2 s5_1268;
																																						Eq_2 a0_1277;
																																						word32 s4_2453;
																																						word32 s0_2450;
																																						word32 s1_2451;
																																						word32 a3_2452;
																																						ra = mbedtls_mpi_mul_mpi(ra, fp + -0x006C, fp + -0x006C, fp + -0x0078, a3_1170, a4_1005, s2_1024, s4_1180, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2450, out s1_2451, out a0_1277, out a2_1003, out a3_2452, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2453, out s5_1268, out s6_1278, out s8);
																																						s0_102 = a0_1277;
																																						if (a0_1277 == 0x00)
																																						{
																																							Eq_2 a0_1300;
																																							Eq_2 a3_1303;
																																							Eq_2 s4_1317;
																																							word32 s1_2454;
																																							word32 s5_2455;
																																							word32 s9_2456;
																																							ra = ecp_modp(ra, fp + -0x006C, a2_1003, a4_1005, a5_1006, s2_1024, s5_1268, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2454, out a0_1300, out a2_1003, out a3_1303, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_1317, out s5_2455, out s6_1278, out s7, out s8, out s9_2456, out s10, out s11, out mstatus);
																																							s0_102 = a0_1300;
																																							if (a0_1300 == 0x00)
																																							{
																																								Eq_2 s5_1345;
																																								Eq_2 a0_1354;
																																								word32 a3_2459;
																																								word32 s4_2460;
																																								word32 s0_2457;
																																								word32 s1_2458;
																																								ra = mbedtls_mpi_mul_mpi(ra, fp + -96, fp + -96, s7, a3_1303, a4_1005, s2_1024, s4_1317, s6_1278, mstatus, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out s0_2457, out s1_2458, out a0_1354, out a2_1003, out a3_2459, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2460, out s5_1345, out s6_1278, out s8);
																																								s0_102 = a0_1354;
																																								if (a0_1354 == 0x00)
																																								{
																																									Eq_2 a0_1359;
																																									Eq_2 a3_1362;
																																									word32 s1_2461;
																																									word32 s4_2462;
																																									word32 s5_2463;
																																									word32 s9_2464;
																																									ra = ecp_modp(ra, fp + -96, a2_1003, a4_1005, a5_1006, s2_1024, s5_1345, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc80, dwLoc7C, dwLoc68, s6, s0, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA4, out s1_2461, out a0_1359, out a2_1003, out a3_1362, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2462, out s5_2463, out s6_1278, out s7, out s8, out s9_2464, out s10, out s11, out mstatus);
																																									s0_102 = a0_1359;
																																									if (a0_1359 == 0x00)
																																									{
																																										word32 s0_2465;
																																										word32 s1_2466;
																																										word32 a7_2467;
																																										Eq_2 a0_1391;
																																										Eq_2 s4_1404;
																																										Eq_2 a3_1394;
																																										ra = mbedtls_mpi_sub_mpi(ra, a0_1359, fp + -72, a3_1362, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2465, out s1_2466, out a0_1391, out a2_1003, out a3_1394, out a4_1005, out a5_1006, out a7_2467, out s2_1024, out s3, out s4_1404, out s8);
																																										while (true)
																																										{
																																											s0_102 = a0_1391;
																																											if (a0_1391 != 0x00)
																																												break;
																																											if (a5_1006 >= 0x00)
																																											{
l23095100:
																																												Eq_2 a0_1474;
																																												word32 s4_1478;
																																												Eq_2 a3_1482;
																																												word32 s1_2471;
																																												word32 a1_2472;
																																												word32 a6_2473;
																																												word32 a7_2474;
																																												word32 s0_2470;
																																												ra = mbedtls_mpi_copy(ra, s4_1404, s2_1024, a2_1003, a3_1394, a4_1005, a5_1006, mstatus, dwLoc78, dwArg58, dwArg98, dwArgD8, out s0_2470, out s1_2471, out a0_1474, out a1_2472, out a2_1003, out a3_1482, out a4_1005, out a5_1006, out a6_2473, out a7_2474, out s2_1024, out s3, out s4_1478, out s8);
																																												s0_102 = a0_1474;
																																												if (a0_1474 != 0x00)
																																													break;
																																												Eq_2 a0_1499;
																																												word32 s4_1503;
																																												Eq_2 a3_1507;
																																												word32 a7_2479;
																																												word32 a6_2478;
																																												word32 a1_2477;
																																												word32 s0_2475;
																																												word32 s1_2476;
																																												ra = mbedtls_mpi_copy(ra, s4_1478 + 0x0C, fp + -72, a2_1003, a3_1482, a4_1005, a5_1006, mstatus, dwLoc78, dwArg58, dwArg98, dwArgD8, out s0_2475, out s1_2476, out a0_1499, out a1_2477, out a2_1003, out a3_1507, out a4_1005, out a5_1006, out a6_2478, out a7_2479, out s2_1024, out s3, out s4_1503, out s8);
																																												s0_102 = a0_1499;
																																												if (a0_1499 != 0x00)
																																													break;
																																												word32 s4_2486;
																																												word32 s0_2480;
																																												word32 s1_2481;
																																												word32 a1_2482;
																																												word32 a3_2483;
																																												word32 a6_2484;
																																												word32 a7_2485;
																																												ra = mbedtls_mpi_copy(ra, s4_1503 + 24, fp + -60, a2_1003, a3_1507, a4_1005, a5_1006, mstatus, dwLoc78, dwArg58, dwArg98, dwArgD8, out s0_2480, out s1_2481, out a0_1524, out a1_2482, out a2_1003, out a3_2483, out a4_1005, out a5_1006, out a6_2484, out a7_2485, out s2_1024, out s3, out s4_2486, out s8);
																																												goto l2309515C;
																																											}
																																											word32 a1_2468;
																																											word32 a6_2469;
																																											if (mbedtls_mpi_cmp_int(0x00, a2_1003, out a1_2468, out a2_1003, out a3_1394, out a4_1005, out a5_1006, out a6_2469) == 0x00)
																																												goto l23095100;
																																											word32 s0_2487;
																																											word32 s1_2488;
																																											word32 a1_2489;
																																											word32 a7_2490;
																																											ra = mbedtls_mpi_add_mpi(ra, a0_1391, fp + -72, a3_1394, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2487, out s1_2488, out a0_1391, out a1_2489, out a2_1003, out a3_1394, out a4_1005, out a5_1006, out a7_2490, out s2_1024, out s3, out s4_1404, out s8);
																																										}
																																									}
																																								}
																																							}
																																						}
																																						break;
																																					}
																																					Eq_2 a5_1203;
																																					word32 a1_2447;
																																					word32 a2_2448;
																																					word32 a6_2449;
																																					if (mbedtls_mpi_cmp_int(0x00, a2_1003, out a1_2447, out a2_2448, out a3_1170, out a4_1005, out a5_1203, out a6_2449) == 0x00)
																																						goto l230950AE;
																																					word32 a1_2493;
																																					word32 a7_2494;
																																					word32 s0_2491;
																																					word32 s1_2492;
																																					ra = mbedtls_mpi_add_mpi(ra, a0_1167, fp + -0x006C, a3_1170, a4_1005, a5_1203, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2491, out s1_2492, out a0_1167, out a1_2493, out a2_1003, out a3_1170, out a4_1005, out a5_1006, out a7_2494, out s2_1024, out s3, out s4_1180, out s8);
																																				}
																																				break;
																																			}
																																			word32 a1_2441;
																																			word32 a2_2442;
																																			word32 a6_2443;
																																			if (mbedtls_mpi_cmp_int(0x00, a2_1003, out a1_2441, out a2_2442, out a3_1088, out a4_1005, out a5_1006, out a6_2443) == 0x00)
																																				goto l23095098;
																																			word32 s4_2499;
																																			word32 s0_2495;
																																			word32 s1_2496;
																																			word32 a1_2497;
																																			word32 a7_2498;
																																			ra = mbedtls_mpi_add_mpi(ra, a0_1085, s2_1024, a3_1088, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2495, out s1_2496, out a0_1085, out a1_2497, out a2_1003, out a3_1088, out a4_1005, out a5_1006, out a7_2498, out s2_1024, out s3, out s4_2499, out s8);
																																		}
																																		break;
																																	}
																																	word32 a2_2435;
																																	word32 a6_2436;
																																	word32 a1_2434;
																																	if (mbedtls_mpi_cmp_int(0x00, a2_1003, out a1_2434, out a2_2435, out a3_1004, out a4_1005, out a5_1006, out a6_2436) == 0x00)
																																		goto l23095082;
																																	Eq_2 a0_1048;
																																	word32 s0_2500;
																																	word32 s1_2501;
																																	word32 a1_2502;
																																	word32 a7_2503;
																																	word32 s4_2504;
																																	ra = mbedtls_mpi_add_mpi(ra, s0_102, s2_1024, a3_1004, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2500, out s1_2501, out a0_1048, out a1_2502, out a2_1003, out a3_1004, out a4_1005, out a5_1006, out a7_2503, out s2_1024, out s3, out s4_2504, out s8);
																																	s0_102 = a0_1048;
																																} while (a0_1048 == 0x00);
																															}
																														}
																													}
																													break;
																												}
																												Eq_2 a0_909;
																												word32 s0_2416;
																												word32 s1_2417;
																												word32 a1_2418;
																												word32 a3_2419;
																												word32 a7_2420;
																												ra = mbedtls_mpi_sub_abs(ra, fp + -0x0084, fp + -0x0084, s1_873 + 4, a3_899, a4_900, a5_901, mstatus, s5, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, out s0_2416, out s1_2417, out a0_909, out a1_2418, out a2_1003, out a3_2419, out a4_1005, out a5_1006, out a7_2420, out s2_1024, out s3, out s4_876, out s8);
																												s0_102 = a0_909;
																											} while (a0_909 == 0x00);
																										}
																									}
																								}
																							}
																						}
																					}
																				}
																			}
																		}
																	}
																	else
																	{
																		Eq_2 a3_542;
																		Eq_2 a4_543;
																		word32 a1_2378;
																		word32 a2_2379;
																		word32 a5_2380;
																		word32 a6_2381;
																		if (mbedtls_mpi_cmp_int(0x00, a2_531, out a1_2378, out a2_2379, out a3_542, out a4_543, out a5_2380, out a6_2381) == 0x00)
																		{
																			word32 s9_2514;
																			word32 s5_2513;
																			word32 s4_2512;
																			word32 a6_2511;
																			word32 s1_2509;
																			word32 a3_2510;
																			ra = ecp_double_jac(ra, s1_465, s1_465, s2_1024, a3_542, a4_543, s2_1024, s6_1278, s7, s10, s11, mstatus, dwLoc88, dwLoc78, dwLoc68, s6, dwLoc38, dwLoc28, dwLoc18, dwLoc0C, dwLoc08, dwArg08, dwArg18, s7, s5, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, out s1_2509, out a0_1524, out a2_1003, out a3_2510, out a4_1005, out a5_1006, out a6_2511, out s2_1024, out s3, out s4_2512, out s5_2513, out s6_1278, out s7, out s8, out s9_2514, out s10, out s11, out mstatus);
																		}
																		else
																		{
																			word32 s1_2505;
																			word32 a1_2506;
																			word32 a3_2507;
																			word32 s4_2508;
																			ra = mbedtls_ecp_set_zero(ra, s0_102, s4_468, a3_542, a4_543, mstatus, dwLoc90, dwLoc8C, dwLoc78, dwLoc68, s6, dwArg58, dwArg68, dwArg98, dwArgA8, dwArgD8, dwArgE8, out s1_2505, out a0_1524, out a1_2506, out a2_1003, out a3_2507, out a4_1005, out a5_1006, out s2_1024, out s3, out s4_2508, out s8);
																		}
l2309515C:
																		s0_102 = a0_1524;
																	}
																	break;
																}
																Eq_2 a3_489;
																Eq_2 a4_490;
																Eq_2 a5_491;
																word32 a1_2373;
																word32 a6_2374;
																if (mbedtls_mpi_cmp_int(0x00, a2_1003, out a1_2373, out a2_1003, out a3_489, out a4_490, out a5_491, out a6_2374) == 0x00)
																	goto l23094FA8;
																Eq_2 a0_502;
																word32 a7_2518;
																word32 a3_2517;
																word32 a1_2516;
																word32 s0_2515;
																ra = mbedtls_mpi_add_mpi(ra, s0_102, fp + -0x0078, a3_489, a4_490, a5_491, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2515, out s1_465, out a0_502, out a1_2516, out a2_1003, out a3_2517, out a4_1005, out a5_1006, out a7_2518, out s2_1024, out s3, out s4_468, out s8);
																s0_102 = a0_502;
															} while (a0_502 == 0x00);
														}
														break;
													}
													word32 a2_2368;
													word32 a6_2369;
													word32 a1_2367;
													if (mbedtls_mpi_cmp_int(0x00, dwArg54, out a1_2367, out a2_2368, out a3_374, out a4_1005, out a5_1006, out a6_2369) == 0x00)
														goto l23094F8C;
													Eq_2 a0_417;
													word32 s4_2523;
													word32 a7_2522;
													word32 a1_2521;
													word32 s1_2520;
													word32 s0_2519;
													ra = mbedtls_mpi_add_mpi(ra, s0_102, fp + -0x0084, a3_374, a4_1005, a5_1006, s2_1024, mstatus, dwArg08, s5, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, out s0_2519, out s1_2520, out a0_417, out a1_2521, out a2_1003, out a3_374, out a4_1005, out a5_1006, out a7_2522, out s2_1024, out s3, out s4_2523, out s8);
													s0_102 = a0_417;
												} while (a0_417 == 0x00);
											}
										}
									}
								}
							}
						}
					}
				}
			}
			Eq_2 a2_1562;
			Eq_2 a5_1563;
			Eq_2 a4_1566;
			word32 a0_2306;
			word32 a1_2307;
			word32 a3_2308;
			word32 a6_2309;
			word32 s4_2310;
			mbedtls_mpi_free(fp + -0x0084, a2_1003, a4_1005, a5_1006, mstatus, dwArgB8, dwArgF8, out a0_2306, out a1_2307, out a2_1562, out a3_2308, out a4_1566, out a5_1563, out a6_2309, out s4_2310);
			Eq_2 a2_1574;
			Eq_2 a5_1575;
			Eq_2 a4_1578;
			word32 a6_2314;
			word32 s4_2315;
			word32 a1_2312;
			word32 a3_2313;
			word32 a0_2311;
			mbedtls_mpi_free(fp + -0x0078, a2_1562, a4_1566, a5_1563, mstatus, dwArgB8, dwArgF8, out a0_2311, out a1_2312, out a2_1574, out a3_2313, out a4_1578, out a5_1575, out a6_2314, out s4_2315);
			Eq_2 a2_1586;
			Eq_2 a5_1587;
			Eq_2 a4_1590;
			word32 a1_2317;
			word32 a6_2319;
			word32 s4_2320;
			word32 a3_2318;
			word32 a0_2316;
			mbedtls_mpi_free(fp + -0x006C, a2_1574, a4_1578, a5_1575, mstatus, dwArgB8, dwArgF8, out a0_2316, out a1_2317, out a2_1586, out a3_2318, out a4_1590, out a5_1587, out a6_2319, out s4_2320);
			Eq_2 a2_1598;
			Eq_2 a5_1599;
			Eq_2 a4_1602;
			word32 a3_2323;
			word32 a6_2324;
			word32 s4_2325;
			word32 a0_2321;
			word32 a1_2322;
			mbedtls_mpi_free(fp + -96, a2_1586, a4_1590, a5_1587, mstatus, dwArgB8, dwArgF8, out a0_2321, out a1_2322, out a2_1598, out a3_2323, out a4_1602, out a5_1599, out a6_2324, out s4_2325);
			Eq_2 a2_1615;
			Eq_2 a5_1616;
			Eq_2 a4_1619;
			word32 s4_2330;
			word32 a6_2329;
			word32 a0_2326;
			word32 a1_2327;
			word32 a3_2328;
			mbedtls_mpi_free(s3, a2_1598, a4_1602, a5_1599, mstatus, dwArgB8, dwArgF8, out a0_2326, out a1_2327, out a2_1615, out a3_2328, out a4_1619, out a5_1616, out a6_2329, out s4_2330);
			Eq_2 a2_1627;
			Eq_2 a5_1628;
			Eq_2 a4_1631;
			word32 a1_2332;
			word32 a6_2334;
			word32 s4_2335;
			word32 a3_2333;
			word32 a0_2331;
			mbedtls_mpi_free(fp + -72, a2_1615, a4_1619, a5_1616, mstatus, dwArgB8, dwArgF8, out a0_2331, out a1_2332, out a2_1627, out a3_2333, out a4_1631, out a5_1628, out a6_2334, out s4_2335);
			word32 a0_2336;
			word32 a1_2337;
			word32 a3_2338;
			word32 a4_2339;
			s1_13 = mbedtls_mpi_free(fp + -60, a2_1627, a4_1631, a5_1628, mstatus, dwArgB8, dwArgF8, out a0_2336, out a1_2337, out a2_1639, out a3_2338, out a4_2339, out a5_1640, out a6_1644, out s4_15);
l23094F3A:
			Eq_543568 t4_1655 = *((word32) dwLoc48 + 376);
			Eq_519072 s9_1656 = *((word32) dwLoc48 + 408);
			ptr32 s5_1657 = *((word32) dwLoc48 + 440);
			ptr32 a3_1659 = *((word32) dwLoc48 + 504);
			t1Out = dwLoc6C;
			s0Out = s0_102;
			s1Out = s1_13;
			a0Out = dwLoc8C;
			a2Out = a2_1639;
			a3Out = a3_1659;
			a4Out = dwLoc70;
			a5Out = a5_1640;
			a6Out = a6_1644;
			s2Out = s2_1024;
			s3Out = s3;
			s4Out = s4_15;
			s5Out = s5_1657;
			s6Out = s6_1278;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9_1656;
			s10Out = s10;
			s11Out = s11;
			t4Out = t4_1655;
			mstatusOut = mstatus;
			return ra;
		}
		word32 a6_2301;
		word32 a1_2300;
		if (mbedtls_mpi_cmp_int(0x00, a2_35, out a1_2300, out a2_35, out a3_128, out a4_126, out a5_38, out a6_2301) != 0x00)
		{
			if (*((word32) a3 + 32) != 0x00)
			{
				word32 a1_2524;
				if (mbedtls_mpi_cmp_int(0x01, a2_35, out a1_2524, out a2_1639, out a3_128, out a4_126, out a5_1640, out a6_1644) != 0x00)
				{
					s0_102.u0 = 0xFB000080;
					goto l23094F3A;
				}
			}
			goto l23094E4C;
		}
		a1_41 = a2;
	}
	Eq_2 a0_80;
	word32 a4_2299;
	word32 a3_2298;
	ra = mbedtls_ecp_copy(ra, a1, a1_41, a2_35, a3_128, a4_126, a5_38, mstatus, dwLoc88, dwLoc80, dwLoc78, dwArg48, dwArg58, dwArg88, dwArg98, dwArgC8, dwArgD8, out s1_13, out a0_80, out a2_1639, out a3_2298, out a4_2299, out a5_1640, out a6_1644, out s2_1024, out s3, out s4_15, out s8);
	s0_102 = a0_80;
	goto l23094F3A;
}

