pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 230951E0: Register Eq_2 ecp_mul_comb(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ecp_mul
Eq_2 ecp_mul_comb(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, union Eq_2 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_1150;
	mbedtls_mpi_init(fp + -412);
	mbedtls_mpi_init(fp + -400);
	Eq_2 dwLoc014C_1537 = a4;
	Eq_2 s10_231 = a2;
	Eq_2 dwLoc01C8_1550 = (word32) a0 + 76;
	Eq_2 a5_1435 = 0x01;
	word32 a5_2791;
	Eq_2 a4_1438;
	if (mbedtls_mpi_get_bit(0x00, (word32) a0 + 76, out a4_1438, out a5_2791) != 0x01)
	{
		s0_1150.u0 = 0xFB000080;
l23095356:
		a2Out = a2;
		a4Out = a4_1438;
		a5Out = a5_1435;
		mstatusOut = mstatus;
		return s0_1150;
	}
	word32 s4_60 = (word32) (*((word32) a0 + 92) > 383);
	word32 a6_2793;
	word32 a1_2792;
	Eq_2 a4_117;
	Eq_2 a3_120;
	Eq_2 a5_110;
	Eq_2 a2_1192;
	Eq_2 a0_61 = mbedtls_mpi_cmp_mpi(a2, a4_1438, 383, out a1_2792, out a2_1192, out a3_120, out a4_117, out a5_110, out a6_2793);
	Eq_2 s4_68 = s4_60 + 0x04;
	Eq_2 s7_1018 = a0_61;
	if (a0_61 == 0x00)
	{
		word32 a1_2794;
		word32 a6_2795;
		if (mbedtls_mpi_cmp_mpi(a2_1192, a4_117, a5_110, out a1_2794, out a2_1192, out a3_120, out a4_117, out a5_110, out a6_2795) == 0x00)
		{
			s4_68 = s4_60 + 0x05;
			s7_1018.u0 = 0x01;
		}
	}
	else
		s7_1018.u0 = 0x00;
	Eq_2 s5_84 = *((word32) a0 + 92);
	if (s4_68 >= s5_84)
		s4_68.u0 = 0x02;
	Eq_2 s3_1014;
	Eq_2 s2_1006;
	Eq_2 a4_1194;
	Eq_2 s6_228 = 0x01 << (byte) s4_68.u0 - 1;
	Eq_2 s9_1020 = s6_228 & 0x00FF;
	Eq_2 s5_214 = (byte) s4_68.u0 + ((word32) s5_84 - 1) >> s4_68;
	if (s7_1018 == 0x00 || *((word32) a0 + 116) == 0x00)
	{
		Eq_2 a3_127;
		Eq_2 s0_132;
		word32 s1_2796;
		word32 a1_2797;
		word32 s3_2798;
		word32 s4_2799;
		word32 s8_2800;
		Eq_2 ra_131 = mycalloc(ra, a0, s6_228, 36, a3_120, a4_117, a5_110, mstatus, dwLoc01B0, dwLoc01AC, dwLocB8, dwLoc78, out s0_132, out s1_2796, out a1_2797, out a2_1192, out a3_127, out a4_1194, out a5_110, out s2_1006, out s3_2798, out s4_2799, out s8_2800);
		if (s6_228 == 0x00)
		{
			s0_1150.u0 = 0xFB000280;
l23095342:
			Eq_2 a2_1422;
			Eq_2 a5_1423;
			Eq_2 a4_1426;
			word32 s4_2820;
			word32 a0_2816;
			word32 a6_2819;
			word32 a3_2818;
			word32 a1_2817;
			mbedtls_mpi_free(fp + -412, a2_1192, a4_1194, a5_110, mstatus, dwLoc88, dwLoc48, out a0_2816, out a1_2817, out a2_1422, out a3_2818, out a4_1426, out a5_1423, out a6_2819, out s4_2820);
			word32 a0_2821;
			word32 s4_2825;
			word32 a6_2824;
			word32 a3_2823;
			word32 a1_2822;
			mbedtls_mpi_free(fp + -400, a2_1422, a4_1426, a5_1423, mstatus, dwLoc88, dwLoc48, out a0_2821, out a1_2822, out a2, out a3_2823, out a4_1438, out a5_1435, out a6_2824, out s4_2825);
			if (s0_1150 != 0x00)
			{
				word32 a0_2826;
				word32 s4_2828;
				word32 a3_2827;
				mbedtls_ecp_point_free(s2_1006, a2, a4_1438, a5_1435, mstatus, dwLoc01C0, dwLoc98, dwLoc88, dwLoc58, dwLoc48, out a0_2826, out a2, out a3_2827, out a4_1438, out a5_1435, out s4_2828);
			}
			goto l23095356;
		}
		Eq_2 a0_146;
		word32 a6_2801;
		Eq_2 s8_1492;
		Eq_2 s1_155;
		Eq_2 s4_158;
		Eq_2 a3_149;
		Eq_2 ra_154 = mbedtls_ecp_copy(ra_131, s6_228, s0_132, a2_1192, a3_127, a4_1194, a5_110, mstatus, (word32) a0 + 76, dwLoc01C0, dwLoc01B8, dwLocF8, dwLocE8, dwLocB8, dwLocA8, dwLoc78, dwLoc68, out s1_155, out a0_146, out a2_1192, out a3_149, out a4_1194, out a5_110, out a6_2801, out s2_1006, out s3_1014, out s4_158, out s8_1492);
		s0_1150 = a0_146;
		if (a0_146 != 0x00)
			goto l2309531E;
		Eq_2 s11_169 = 0x00;
		Eq_2 a4_170 = 0x01;
		while (true)
		{
			Eq_2 a6_173 = a4_170 >> s8_1492;
			if (a6_173 != 0x00)
				break;
			Eq_2 a3_182 = (word32) s3_1014 + ((word32) a4_170 + 36);
			Eq_2 a0_189;
			word32 s8_2928;
			Eq_2 a6_195;
			ra_154 = mbedtls_ecp_copy(ra_154, a3_182, (word32) s3_1014 + ((a4_170 >> 0x01) + 36), a2_1192, a3_182, a4_170, 36, mstatus, (word32) a0 + 76, a6_173, dwLoc01B8, dwLocF8, dwLocE8, dwLocB8, dwLocA8, dwLoc78, dwLoc68, out s1_155, out a0_189, out a2_1192, out a3_149, out a4_1194, out a5_110, out a6_195, out s2_1006, out s3_1014, out s4_158, out s8_2928);
			0x00 = (int8) dwLocB8;
			dwLoc01C0 = a6_173;
			s0_1150 = a0_189;
			if (a0_189 != 0x00)
				goto l2309531E;
			while (true)
			{
				s8_1492 = dwLoc012C;
				if (s5_214 == a6_195)
					break;
				dwLoc01C0 = a6_195;
				word32 a6_238;
				Eq_2 a0_257;
				word32 s8_2929;
				ra_154 = ecp_double_jac(ra_154, s1_155, s1_155, a3_149, a3_149, a4_1194, s2_1006, s6_228, s7_1018, s10_231, s11_169, mstatus, (word32) a0 + 76, dwLoc01B8, dwLoc01A8, dwLoc0198, dwLoc0178, dwLoc0168, dwLoc0158, a4, a5, dwLoc0138, dwLoc0128, dwLoc011C, dwLoc0118, dwLoc0108, dwLocFC, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocB8, dwLocA8, dwLoc98, out s1_155, out a0_257, out a2_1192, out a3_149, out a4_1194, out a5_110, out a6_238, out s2_1006, out s3_1014, out s4_158, out s5_214, out s6_228, out s7_1018, out s8_2929, out s9_1020, out s10_231, out s11_169, out mstatus);
				s0_1150 = a0_257;
				if (a0_257 != 0x00)
					goto l2309531E;
				0x00 = (int8) dwLocB8;
				a6_195 = a6_238 + 0x01;
			}
			((s11_169 << 0x02) + (fp + -64))->t0EF8 = a3_149;
			a2_1192 = (word32) s11_169 + 1;
			a4_170 = a4_1194 << 1 & 0x00FF;
			s11_169 = a2_1192 & 0x00FF;
		}
		Eq_2 a0_293;
		word32 a3_2802;
		Eq_2 s1_1314;
		Eq_2 s6_1328;
		Eq_2 s5_1329;
		Eq_2 s10_1334;
		Eq_2 s11_1335;
		Eq_2 s8_1480;
		Eq_2 s4_1349;
		Eq_2 ra_1330 = ecp_normalize_jac_many(ra_154, s1_155, s1_155, fp + -328, s11_169, a3_149, a4_170, s2_1006, s3_1014, s4_158, s5_214, s6_228, s7_1018, s10_231, s11_169, mstatus, dwLoc01CC, (word32) a0 + 76, dwLoc01B8, dwLoc01AC, dwLoc01A8, dwLoc0198, dwLoc0178, dwLoc0168, dwLoc015C, dwLoc0158, a5, dwLoc013C, dwLoc0138, dwLoc0128, dwLoc011C, dwLoc0118, dwLoc010C, dwLoc0108, dwLocFC, dwLocF8, dwLocE8, dwLocD8, dwLocCC, dwLocC8, dwLocA8, dwLoc98, out s1_1314, out a0_293, out a2_1192, out a3_2802, out a4_1194, out a5_110, out s2_1006, out s3_1014, out s4_1349, out s5_1329, out s6_1328, out s7_1018, out s8_1480, out s9_1020, out s10_1334, out s11_1335, out mstatus);
		s0_1150 = a0_293;
		if (a0_293 != 0x00)
			goto l2309531E;
		Eq_2 a2_1491 = 0x00;
		a4_1194.u0 = 0x01;
		int32 a7_1300 = 36;
		while (true)
		{
			Eq_2 a3_1306 = a4_1194;
			if (a4_1194 >> s8_1480 != 0x00)
				break;
			word32 t4_1303 = a2_1491 + a4_1194 & 0x00FF;
			Eq_2 a6_1304 = (word32) s3_1014 + ((byte) a4_1194.u0 + a7_1300);
			while (true)
			{
				ui32 a2_1307 = t4_1303 - a3_1306;
				Eq_2 t1_1309 = (word32) a3_1306 - 1;
				if (a3_1306 == 0x00)
					break;
				ui32 a2_1311 = (word32) t1_1309 + a7_1300;
				dwLoc013C = t4_1303;
				dwLoc01BC = a4_1194;
				dwLoc01C0 = t1_1309;
				Eq_2 a0_1336;
				Eq_2 t1_1355;
				word32 s8_2805;
				word32 s0_2803;
				word32 a3_2804;
				ra_1330 = ecp_add_mixed(ra_1330, s0_1150, (word32) a6_1304 + a2_1311, (word32) s3_1014 + a2_1311, a6_1304, s5_1329, s6_1328, s7_1018, s10_1334, s11_1335, mstatus, (word32) a0 + 76, dwLoc01B8, dwLoc0198, dwLoc018C, dwLoc0188, dwLoc017C, dwLoc0178, dwLoc0168, dwLoc0158, a4, a5, dwLoc0138, dwLoc012C, dwLoc0128, dwLoc0118, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, out t1_1355, out s0_2803, out s1_1314, out a0_1336, out a2_1192, out a3_2804, out a4_1194, out a5_110, out a6_1304, out s2_1006, out s3_1014, out s4_1349, out s5_1329, out s6_1328, out s7_1018, out s8_2805, out s9_1020, out s10_1334, out s11_1335, out t4_1303, out mstatus);
				s0_1150 = a0_1336;
				if (a0_1336 != 0x00)
					goto l2309531E;
				0x00 = (int8) dwArg00;
				(word32) s3 + (fp + -64) + 3832 = (word32) a0 + 76;
				s8_1480 = a6_1304;
				s0_1150 = dwArg04;
				a3_1306 = t1_1355;
				a7_1300 = 36;
			}
			a4_1194 = a4_1194 << 1 & 0x00FF;
			a2_1491 = a2_1307 & 0x00FF;
		}
		Eq_2 a0_346;
		struct Eq_545488 * s1_356;
		word32 s6_373;
		word32 s8_2830;
		word32 s4_2829;
		ra = ecp_normalize_jac_many(ra_1330, s1_1314, s1_1314, fp + -328, a2_1491, a4_1194, a4_1194, s2_1006, s3_1014, s4_1349, s5_1329, s6_1328, s7_1018, s10_1334, s11_1335, mstatus, dwLoc01CC, (word32) a0 + 76, dwLoc01B8, dwLoc01AC, dwLoc01A8, dwLoc0198, dwLoc0178, dwLoc0168, dwLoc015C, dwLoc0158, a5, dwLoc013C, dwLoc0138, dwLoc0128, dwLoc011C, dwLoc0118, dwLoc010C, dwLoc0108, dwLocFC, dwLocF8, dwLocE8, dwLocD8, dwLocCC, dwLocC8, dwLocA8, dwLoc98, out s1_356, out a0_346, out a2_1192, out a3_120, out a4_1194, out a5_110, out s2_1006, out s3_1014, out s4_2829, out s5_214, out s6_373, out s7_1018, out s8_2830, out s9_1020, out s10_231, out s11, out mstatus);
		s0_1150 = a0_346;
		if (a0_346 != 0x00)
			goto l2309531E;
		if (s7_1018 != 0x00)
		{
			s1_356->t0074 = s3_1014;
			s1_356->dw0078 = s6_373;
		}
	}
	Eq_2 a5_383;
	Eq_2 a4_384;
	mbedtls_mpi_get_bit(0x00, a5_110, out a4_384, out a5_383);
	Eq_2 a0_396;
	Eq_2 a3_404;
	word32 s0_2831;
	word32 s4_2836;
	word32 a7_2835;
	word32 s8_2837;
	word32 a6_2834;
	word32 a1_2833;
	word32 s1_2832;
	Eq_2 ra_408 = mbedtls_mpi_copy(ra, fp + -412, s10_231, a2_1192, a3_120, a4_384, a5_383, mstatus, dwLoc01B8, dwLocE8, dwLocA8, dwLoc68, out s0_2831, out s1_2832, out a0_396, out a1_2833, out a2_1192, out a3_404, out a4_1194, out a5_110, out a6_2834, out a7_2835, out s2_1006, out s3_1014, out s4_2836, out s8_2837);
	s0_1150 = a0_396;
	if (a0_396 != 0x00)
		goto l2309531E;
	Eq_2 a0_422;
	Eq_2 a3_425;
	word32 s8_436;
	word32 a7_2840;
	word32 s1_2839;
	word32 s4_2841;
	word32 s0_2838;
	Eq_2 ra_430 = mbedtls_mpi_sub_mpi(ra_408, a0_396, fp + -400, a3_404, a4_1194, a5_110, s2_1006, mstatus, dwLoc0138, dwLoc0118, dwLocF8, dwLocD8, dwLocC8, dwLocB8, dwLoc98, out s0_2838, out s1_2839, out a0_422, out a2_1192, out a3_425, out a4_1194, out a5_110, out a7_2840, out s2_1006, out s3_1014, out s4_2841, out s8_436);
	s0_1150 = a0_422;
	if (a0_422 == 0x00)
	{
		Eq_2 a0_450;
		Eq_2 s4_463;
		word32 a3_2844;
		word32 s1_2843;
		word32 s0_2842;
		Eq_2 ra_458 = mbedtls_mpi_safe_cond_assign(ra_430, fp + -400, (word32) (s8_436 != ~0x00), a3_425, a4_1194, mstatus, dwLoc01B8, dwLocE8, dwLocA8, dwLoc68, out s0_2842, out s1_2843, out a0_450, out a2_1192, out a3_2844, out a4_1194, out a5_110, out s2_1006, out s3_1014, out s4_463);
		s0_1150 = a0_450;
		if (a0_450 != 0x00)
			goto l2309531E;
		struct Eq_545612 * s0_477 = fp + -328;
		word32 a5_2851;
		word32 a4_2850;
		word32 a1_2847;
		word32 a0_2846;
		word32 t1_2845;
		word32 a3_2849;
		word32 a2_2848;
		Eq_2 ra_484 = memset(ra_458, fp + -328, 0x00, (word32) s5_214 + 1, out t1_2845, out a0_2846, out a1_2847, out a2_2848, out a3_2849, out a4_2850, out a5_2851);
		Eq_2 s10_1012 = fp + -328;
		Eq_2 s6_488 = 0x00;
		while (s5_214 != s6_488)
		{
			Eq_2 a5_491 = s6_488;
			s11.u0 = 0x00;
			do
			{
				word32 a5_499;
				word32 a4_2927;
				*s10_1012 = (byte) (mbedtls_mpi_get_bit(a5_491, a5_491, out a4_2927, out a5_499) << s11 | (word32) (*s10_1012));
				dwLoc01C8_1550 = a5_491;
				s11 = (byte) s11.u0 + 1;
				a5_491 = (word32) s5_214 + a5_499;
			} while (s11 < s4_463);
			s6_488 = (word32) s6_488 + 1;
			s10_1012 = (word32) s10_1012 + 1;
		}
		struct Eq_545612 * a7_517 = (word32) s6_488 + (fp + -328);
		ui32 a1_518 = 0x00;
		while (s0_477 != a7_517)
		{
			ui32 a2_522 = (word32) s0_477[1];
			ui32 a4_526 = a2_522 ^ a1_518;
			ui32 a6_523 = (word32) s0_477->b0000;
			ui32 a5_527 = ~a4_526;
			++s0_477;
			s0_477[0x0FFF] = (struct Eq_545612) (byte) ((a5_527 & 0x01) << 7 | a6_523);
			int32 a4_531 = (int32) (byte) a4_526;
			int32 a3_537 = (int32) (byte) (a6_523 + (a5_527 & 0x01));
			s0_477->b0000 = (byte) (a4_531 ^ a3_537);
			a1_518 = (a2_522 & a1_518 | a4_531 & a3_537) & 0x00FF;
		}
		mbedtls_ecp_point_init.part.2(fp + -364);
		Eq_2 a0_575;
		Eq_2 a3_578;
		word32 s0_2852;
		Eq_2 a5_1048;
		Eq_2 a2_1057;
		Eq_2 s8_1019;
		Eq_2 s5_1016;
		Eq_2 s6_1017;
		Eq_2 a4_1051;
		Eq_2 ra_1011 = ecp_select_comb(ra_484, s3_1014, s9_1020, (word32) ((word32) s6_488 + (fp + -64) + -264), mstatus, dwLoc0158, dwLoc0138, dwLoc0118, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocB8, dwLocA8, dwLoc98, dwLoc88, dwLoc68, out s0_2852, out a0_575, out a2_1057, out a3_578, out a4_1051, out a5_1048, out s2_1006, out s3_1014, out s5_1016, out s6_1017, out s7_1018, out s8_1019);
		s0_1150 = a0_575;
		if (a0_575 == 0x00)
		{
			s5_1016 = (word32) s2_1006 + 24;
			word32 s4_2855;
			word32 a7_2854;
			word32 a1_2853;
			Eq_2 s1_1053;
			Eq_2 a3_1050;
			ra_1011 = mbedtls_mpi_lset(ra_1011, a3_578, a4_1051, mstatus, dwLoc01D0, dwLoc01CC, dwLoc01A8, dwLoc0198, dwLocD8, dwLoc98, dwLoc58, out s1_1053, out a1_2853, out a2_1057, out a3_1050, out a4_1051, out a5_1048, out a7_2854, out s2_1006, out s3_1014, out s4_2855, out s8_1019);
			s0_1150 = (word32) s2_1006 + 24;
			if (s2_1006 != 0x18)
				goto l23095672;
			if (a5_1048 != 0x00)
			{
				mbedtls_mpi_init(fp + -388);
				mbedtls_mpi_init(fp + -376);
				s10_1012.u0 = 0x0C;
				s11 = (word32) s1_1053 + 4;
				s1_1502 = s1_1053;
l230954F4:
				Eq_2 s1_1502;
				word32 a3_2856;
				Eq_2 s4_658;
				Eq_2 a5_1026;
				Eq_2 a4_1002;
				Eq_2 a2_1000;
				mbedtls_mpi_fill_random(ra_1011, (word32) s2_1006 + 24, s1_1502, fp + -388, dwLoc012C, a4, a3_1050, a4_1051, mstatus, out a2_1000, out a3_2856, out a4_1002, out a5_1026, out s2_1006, out s3_1014, out s4_658, out s8_1019, out mstatus);
				do
				{
					word32 a1_2857;
					word32 a3_2858;
					word32 a6_2859;
					if (mbedtls_mpi_cmp_mpi(a2_1000, a4_1002, a5_1026, out a1_2857, out a2_1057, out a3_2858, out a4_1051, out a5_1048, out a6_2859) < 0x00)
					{
						s10_1012 = (byte) s10_1012.u0 - 1;
						if (s10_1012 == 0x00)
						{
							s0_1150.u0 = 0xFB000300;
							goto l23095672;
						}
						else
						{
							word32 a5_2862;
							word32 a2_2861;
							word32 a1_2860;
							word32 a6_2863;
							if (mbedtls_mpi_cmp_int(0x01, a2_1057, out a1_2860, out a2_2861, out a3_1050, out a4_1051, out a5_2862, out a6_2863) <= 0x00)
								goto l230954F4;
							Eq_2 a0_754;
							word32 a5_2866;
							word32 s4_2867;
							word32 a3_2865;
							word32 s1_2864;
							ra_1011 = mbedtls_mpi_mul_mpi(ra_1011, (word32) s2_1006 + 24, (word32) s2_1006 + 24, fp + -388, a3_1050, a4_1051, s2_1006, s4_658, s6_1017, mstatus, dwLoc0128, dwLoc0118, dwLoc0108, dwLocE8, dwLocD8, dwLocC8, dwLocA8, dwLoc98, dwLoc88, dwLoc38, out s0_1150, out s1_2864, out a0_754, out a2_1000, out a3_2865, out a4_1002, out a5_2866, out s2_1006, out s3_1014, out s4_2867, out s5_1016, out s6_1017, out s8_1019);
							a5_1026 = a0_754;
							if (a0_754 == 0x00)
							{
								Eq_2 a0_761;
								Eq_2 a3_764;
								Eq_2 s4_778;
								word32 a5_2869;
								word32 s1_2868;
								ra_1011 = ecp_modp(ra_1011, s5_1016, a2_1000, a4_1002, a0_754, s2_1006, s5_1016, s6_1017, s7_1018, s10_1012, (word32) s1_1053 + 4, mstatus, dwLoc01C8_1550, dwLoc01C0, dwLoc01BC, dwLoc01A8, dwLoc0198, dwLoc018C, dwLoc0188, dwLoc0178, dwLoc0168, dwLoc0158, a5, dwLoc0138, dwLoc0128, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocBC, dwLocA8, dwLoc9C, out s1_2868, out a0_761, out a2_1000, out a3_764, out a4_1002, out a5_2869, out s2_1006, out s3_1014, out s4_778, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s10_1012, out s11, out mstatus);
								a5_1026 = a0_761;
								if (a0_761 == 0x00)
								{
									Eq_2 a0_815;
									word32 a5_2872;
									word32 s1_2870;
									word32 s4_2873;
									word32 a3_2871;
									ra_1011 = mbedtls_mpi_mul_mpi(ra_1011, fp + -376, fp + -388, fp + -388, a3_764, a4_1002, s2_1006, s4_778, s6_1017, mstatus, dwLoc0128, dwLoc0118, dwLoc0108, dwLocE8, dwLocD8, dwLocC8, dwLocA8, dwLoc98, dwLoc88, dwLoc38, out s0_1150, out s1_2870, out a0_815, out a2_1000, out a3_2871, out a4_1002, out a5_2872, out s2_1006, out s3_1014, out s4_2873, out s5_1016, out s6_1017, out s8_1019);
									a5_1026 = a0_815;
									if (a0_815 == 0x00)
									{
										Eq_2 a0_820;
										Eq_2 a3_823;
										Eq_2 s4_837;
										word32 a5_2875;
										word32 s1_2874;
										ra_1011 = ecp_modp(ra_1011, fp + -376, a2_1000, a4_1002, a0_815, s2_1006, s5_1016, s6_1017, s7_1018, s10_1012, s11, mstatus, dwLoc01C8_1550, dwLoc01C0, dwLoc01BC, dwLoc01A8, dwLoc0198, dwLoc018C, dwLoc0188, dwLoc0178, dwLoc0168, dwLoc0158, a5, dwLoc0138, dwLoc0128, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocBC, dwLocA8, dwLoc9C, out s1_2874, out a0_820, out a2_1000, out a3_823, out a4_1002, out a5_2875, out s2_1006, out s3_1014, out s4_837, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s10_1012, out s11, out mstatus);
										a5_1026 = a0_820;
										if (a0_820 == 0x00)
										{
											Eq_2 a0_874;
											word32 a5_2878;
											word32 s4_2879;
											word32 s1_2876;
											word32 a3_2877;
											ra_1011 = mbedtls_mpi_mul_mpi(ra_1011, s2_1006, s2_1006, fp + -376, a3_823, a4_1002, s2_1006, s4_837, s6_1017, mstatus, dwLoc0128, dwLoc0118, dwLoc0108, dwLocE8, dwLocD8, dwLocC8, dwLocA8, dwLoc98, dwLoc88, dwLoc38, out s0_1150, out s1_2876, out a0_874, out a2_1000, out a3_2877, out a4_1002, out a5_2878, out s2_1006, out s3_1014, out s4_2879, out s5_1016, out s6_1017, out s8_1019);
											a5_1026 = a0_874;
											if (a0_874 == 0x00)
											{
												Eq_2 a0_879;
												Eq_2 a3_882;
												Eq_2 s4_896;
												word32 a5_2881;
												word32 s1_2880;
												ra_1011 = ecp_modp(ra_1011, s2_1006, a2_1000, a4_1002, a0_874, s2_1006, s5_1016, s6_1017, s7_1018, s10_1012, s11, mstatus, dwLoc01C8_1550, dwLoc01C0, dwLoc01BC, dwLoc01A8, dwLoc0198, dwLoc018C, dwLoc0188, dwLoc0178, dwLoc0168, dwLoc0158, a5, dwLoc0138, dwLoc0128, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocBC, dwLocA8, dwLoc9C, out s1_2880, out a0_879, out a2_1000, out a3_882, out a4_1002, out a5_2881, out s2_1006, out s3_1014, out s4_896, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s10_1012, out s11, out mstatus);
												a5_1026 = a0_879;
												if (a0_879 == 0x00)
												{
													Eq_2 a0_933;
													word32 a5_2884;
													word32 s1_2882;
													word32 s4_2885;
													word32 a3_2883;
													ra_1011 = mbedtls_mpi_mul_mpi(ra_1011, fp + -376, fp + -376, fp + -388, a3_882, a4_1002, s2_1006, s4_896, s6_1017, mstatus, dwLoc0128, dwLoc0118, dwLoc0108, dwLocE8, dwLocD8, dwLocC8, dwLocA8, dwLoc98, dwLoc88, dwLoc38, out s0_1150, out s1_2882, out a0_933, out a2_1000, out a3_2883, out a4_1002, out a5_2884, out s2_1006, out s3_1014, out s4_2885, out s5_1016, out s6_1017, out s8_1019);
													a5_1026 = a0_933;
													if (a0_933 == 0x00)
													{
														Eq_2 a0_938;
														Eq_2 a3_941;
														word32 a5_2887;
														word32 s4_2888;
														word32 s1_2886;
														ra_1011 = ecp_modp(ra_1011, fp + -376, a2_1000, a4_1002, a0_933, s2_1006, s5_1016, s6_1017, s7_1018, s10_1012, s11, mstatus, dwLoc01C8_1550, dwLoc01C0, dwLoc01BC, dwLoc01A8, dwLoc0198, dwLoc018C, dwLoc0188, dwLoc0178, dwLoc0168, dwLoc0158, a5, dwLoc0138, dwLoc0128, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocBC, dwLocA8, dwLoc9C, out s1_2886, out a0_938, out a2_1000, out a3_941, out a4_1002, out a5_2887, out s2_1006, out s3_1014, out s4_2888, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s10_1012, out s11, out mstatus);
														a5_1026 = a0_938;
														if (a0_938 == 0x00)
														{
															Eq_2 s4_983;
															Eq_2 a0_993;
															word32 a3_2890;
															word32 a5_2891;
															word32 s1_2889;
															ra_1011 = mbedtls_mpi_mul_mpi(ra_1011, (word32) s2_1006 + 0x0C, (word32) s2_1006 + 0x0C, fp + -376, a3_941, a4_1002, s2_1006, (word32) s2_1006 + 0x0C, s6_1017, mstatus, dwLoc0128, dwLoc0118, dwLoc0108, dwLocE8, dwLocD8, dwLocC8, dwLocA8, dwLoc98, dwLoc88, dwLoc38, out s0_1150, out s1_2889, out a0_993, out a2_1000, out a3_2890, out a4_1002, out a5_2891, out s2_1006, out s3_1014, out s4_983, out s5_1016, out s6_1017, out s8_1019);
															a5_1026 = a0_993;
															if (a0_993 == 0x00)
															{
																Eq_2 a0_998;
																word32 a3_2893;
																word32 a5_2894;
																word32 s4_2895;
																word32 s1_2892;
																ra_1011 = ecp_modp(ra_1011, s4_983, a2_1000, a4_1002, a0_993, s2_1006, s5_1016, s6_1017, s7_1018, s10_1012, s11, mstatus, dwLoc01C8_1550, dwLoc01C0, dwLoc01BC, dwLoc01A8, dwLoc0198, dwLoc018C, dwLoc0188, dwLoc0178, dwLoc0168, dwLoc0158, a5, dwLoc0138, dwLoc0128, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocBC, dwLocA8, dwLoc9C, out s1_2892, out a0_998, out a2_1000, out a3_2893, out a4_1002, out a5_2894, out s2_1006, out s3_1014, out s4_2895, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s10_1012, out s11, out mstatus);
																a5_1026 = a0_998;
															}
														}
													}
												}
											}
										}
									}
								}
							}
							break;
						}
					}
					Eq_2 a0_686;
					word32 a1_2924;
					word32 a3_2925;
					word32 a5_2926;
					ra_1011 = mbedtls_mpi_shift_r(ra_1011, (uint32 **) 0x01, a2_1057, a5_1048, mstatus, dwLoc01D0, dwLoc01CC, dwLoc01A8, dwLoc0198, dwLocD8, dwLoc98, dwLoc58, out s1_1502, out a0_686, out a1_2924, out a2_1000, out a3_2925, out a4_1002, out a5_2926, out s2_1006, out s3_1014, out s4_658, out s8_1019);
					a5_1026 = a0_686;
				} while (a0_686 == 0x00);
				Eq_2 a2_1035;
				Eq_2 a5_1036;
				Eq_2 a4_1039;
				word32 a6_2899;
				word32 a0_2896;
				word32 s4_2900;
				word32 a1_2897;
				word32 a3_2898;
				mbedtls_mpi_free(fp + -388, a2_1000, a4_1002, a5_1026, mstatus, dwLoc88, dwLoc48, out a0_2896, out a1_2897, out a2_1035, out a3_2898, out a4_1039, out a5_1036, out a6_2899, out s4_2900);
				dwLoc014C_1537 = a5_1026;
				word32 a1_2902;
				word32 s4_2905;
				word32 a2_2903;
				word32 a6_2904;
				word32 a0_2901;
				s1_1053 = mbedtls_mpi_free(fp + -376, a2_1035, a4_1039, a5_1036, mstatus, dwLoc88, dwLoc48, out a0_2901, out a1_2902, out a2_2903, out a3_1050, out a4_1051, out a5_1048, out a6_2904, out s4_2905);
				a2_1057 = dwLocEC;
				if (a5_1048 != 0x00)
				{
					s0_1150 = a5_1048;
					goto l23095672;
				}
			}
			a2_1057 = dwLocEC;
			Eq_2 s4_1058 = ~0x00;
			do
			{
				s6_1017 = (word32) s6_1017 - 1;
				if (s6_1017 == s4_1058)
					goto l23095672;
				word32 s4_2919;
				word32 s1_2916;
				word32 a6_2918;
				word32 a3_2917;
				Eq_2 a0_1100;
				ra_1011 = ecp_double_jac(ra_1011, s1_1053, s1_1053, s2_1006, a3_1050, a4_1051, s2_1006, s6_1017, s7_1018, s10_1012, s11, mstatus, dwLoc01C8_1550, dwLoc01B8, dwLoc01A8, dwLoc0198, dwLoc0178, dwLoc0168, dwLoc0158, dwLoc014C_1537, a5, dwLoc0138, dwLoc0128, dwLoc011C, dwLoc0118, dwLoc0108, dwLocFC, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocB8, dwLocA8, dwLoc98, out s1_2916, out a0_1100, out a2_1057, out a3_2917, out a4_1051, out a5_1048, out a6_2918, out s2_1006, out s3_1014, out s4_2919, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s10_1012, out s11, out mstatus);
				if (a0_1100 != 0x00)
					break;
				Eq_2 s0_1121;
				word32 a3_2920;
