pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
				ra_1011 = ecp_select_comb(ra_1011, s3_1014, s9_1020, (word32) *((word32) s6_1017 + (fp + -328)), mstatus, dwLoc0158, dwLoc0138, dwLoc0118, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocB8, dwLocA8, dwLoc98, dwLoc88, dwLoc68, out s0_1121, out a0_1100, out a2_1057, out a3_2920, out a4_1051, out a5_1048, out s2_1006, out s3_1014, out s5_1016, out s6_1017, out s7_1018, out s8_1019);
				if (a0_1100 != 0x00)
					break;
				word32 t1_2921;
				word32 a6_2922;
				word32 t4_2923;
				ra_1011 = ecp_add_mixed(ra_1011, s0_1121, s2_1006, s2_1006, fp + -364, s5_1016, s6_1017, s7_1018, s10_1012, s11, mstatus, dwLoc01C8_1550, dwLoc01B8, dwLoc0198, dwLoc018C, dwLoc0188, dwLoc017C, dwLoc0178, dwLoc0168, dwLoc0158, dwLoc014C_1537, a5, dwLoc0138, dwLoc012C, dwLoc0128, dwLoc0118, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, out t1_2921, out s0_1150, out s1_1053, out a0_1100, out a2_1057, out a3_1050, out a4_1051, out a5_1048, out a6_2922, out s2_1006, out s3_1014, out s4_1058, out s5_1016, out s6_1017, out s7_1018, out s8_1019, out s9_1020, out s10_1012, out s11, out t4_2923, out mstatus);
			} while (a0_1100 == 0x00);
			s0_1150 = a0_1100;
		}
l23095672:
		Eq_2 a3_1193;
		word32 a0_2906;
		word32 s4_2907;
		mbedtls_ecp_point_free.part.4(fp + -364, a2_1057, a4_1051, a5_1048, mstatus, dwLoc01C0, dwLoc98, dwLoc88, dwLoc58, dwLoc48, out a0_2906, out a2_1192, out a3_1193, out a4_1194, out a5_110, out s4_2907);
		if (s0_1150 == 0x00)
		{
			Eq_2 a0_1221;
			Eq_2 s1_1231;
			word32 s0_2908;
			word32 s8_2910;
			word32 a3_2909;
			Eq_2 ra_1229 = ecp_safe_invert_jac(ra_1011, s2_1006, s8_1019, a3_1193, a4_1194, mstatus, dwLoc0158, dwLoc0138, dwLoc0118, dwLoc0108, dwLocF8, dwLocE8, dwLocD8, dwLocC8, dwLocB8, dwLocA8, dwLoc88, dwLoc68, out s0_2908, out s1_1231, out a0_1221, out a2_1192, out a3_2909, out a4_1194, out a5_110, out s2_1006, out s3_1014, out s8_2910);
			s0_1150 = a0_1221;
			if (a0_1221 == 0x00)
			{
				word32 s10_2914;
				word32 s8_2913;
				word32 s11_2915;
				word32 s6_2912;
				word32 s4_2911;
				s0_1150 = ecp_normalize_jac(ra_1229, s1_1231, s1_1231, s2_1006, a2_1192, s5_1016, s6_1017, s7_1018, s10_1012, s11, mstatus, dwLoc01CC, dwLoc01C8_1550, dwLoc01B8, dwLoc01A8, dwLoc0198, dwLoc018C, dwLoc0188, dwLoc016C, dwLoc0168, dwLoc0158, a5, dwLoc0138, dwLoc0128, dwLoc0118, dwLoc0108, dwLocFC, dwLocE8, dwLocDC, dwLocD8, dwLocC8, dwLocAC, dwLoc98, dwLoc88, dwLoc78, out a2_1192, out a4_1194, out a5_110, out s2_1006, out s3_1014, out s4_2911, out s6_2912, out s7_1018, out s8_2913, out s9_1020, out s10_2914, out s11_2915, out mstatus);
			}
		}
		goto l2309531E;
	}
l2309531E:
	if (s7_1018 == 0x00)
	{
		Eq_2 s1_1368 = 0x00;
		int32 s4_1369 = 36;
		do
		{
			word32 a5_2808;
			word32 a3_2807;
			word32 a0_2806;
			s1_1368 = mbedtls_ecp_point_free((word32) s3_1014 + ((word32) s1_1368 + s4_1369), a2_1192, a4_1194, a5_110, mstatus, dwLoc01C0, dwLoc98, dwLoc88, dwLoc58, dwLoc48, out a0_2806, out a2_1192, out a3_2807, out a4_1194, out a5_2808, out s4_1369);
			a5_110 = s1_1368 & 0x00FF;
		} while ((s1_1368 & 0x00FF) < s9_1020);
		word32 t3_2815;
		word32 s4_2814;
		word32 a6_2813;
		word32 a3_2812;
		word32 a1_2811;
		word32 s1_2809;
		word32 a0_2810;
		vPortFree(s3_1014, a2_1192, s1_1368 & 0x00FF, mstatus, dwLoc78, dwLoc38, out s0_1150, out s1_2809, out a0_2810, out a1_2811, out a2_1192, out a3_2812, out a4_1194, out a5_110, out a6_2813, out s4_2814, out t3_2815);
	}
	goto l23095342;
}

// 230956B0: Register Eq_2 mbedtls_ecp_point_read_binary(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      pk_parse_key_sec1_der
//      mbedtls_pk_parse_subpubkey
Eq_2 mbedtls_ecp_point_read_binary(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	if (a3 != 0x00)
	{
		Eq_2 a5_6 = (word32) *a2;
		if (a5_6 != 0x00)
		{
			ptr32 a0_182;
			word32 a5_267;
			word32 a4_266;
			Eq_2 a1_185;
			Eq_2 a3_190;
			Eq_2 a0_25 = mbedtls_mpi_size(a2, a4, a5_6, out a1_185, out a3_190, out a4_266, out a5_267);
			Eq_2 s1_18 = a2;
			Eq_2 s2_21 = a3;
			Eq_2 s0_210 = a1;
			Eq_2 a4_193 = (word32) *a2;
			Eq_2 a5_197 = 0x04;
			Eq_2 s3_219 = a0_25;
			if (a4_193 == 0x04)
			{
				a5_197 = (a0_25 << 0x01) + 0x01;
				if (a3 == a5_197)
				{
					word32 s8_271;
					word32 s4_270;
					word32 a7_269;
					word32 a2_268;
					ra = mbedtls_mpi_read_binary(ra, (word32) a2 + 1, a0_25, a3_190, a4_193, mstatus, s2, dwLoc08, dwArgB8, dwArgC8, dwArgF8, dwArg0108, dwArg0138, dwArg0148, out s0_210, out s1_18, out a0_182, out a1_185, out a2_268, out a3_190, out a4_193, out a5_197, out a7_269, out s2_21, out s3_219, out s4_270, out s8_271);
					if (a0_182 == 0x00)
					{
						word32 s8_275;
						word32 s4_274;
						word32 a7_273;
						word32 a2_272;
						ra = mbedtls_mpi_read_binary(ra, (word32) s1_18 + ((word32) s3_219 + 1), s3_219, a3_190, a4_193, mstatus, s2, dwLoc08, dwArgB8, dwArgC8, dwArgF8, dwArg0108, dwArg0138, dwArg0148, out s0_210, out s1_18, out a0_182, out a1_185, out a2_272, out a3_190, out a4_193, out a5_197, out a7_273, out s2_21, out s3_219, out s4_274, out s8_275);
						if (a0_182 == 0x00)
						{
							Eq_2 a1_108;
							Eq_2 a2_109;
							Eq_2 a3_110;
							Eq_2 a4_111;
							Eq_2 a5_112;
							Eq_2 s1_116;
							Eq_2 s2_117;
							Eq_2 s3_118;
							Eq_2 s4_119;
							word32 a7_276;
							word32 s8_277;
							Eq_2 ra_115 = mbedtls_mpi_lset(ra, a3_190, a4_193, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArgF8, dwArg0138, dwArg0178, out s1_116, out a1_108, out a2_109, out a3_110, out a4_111, out a5_112, out a7_276, out s2_117, out s3_118, out s4_119, out s8_277);
							s0Out = s0_210;
							s1Out = s1_116;
							a0Out = (word32) s0_210 + 24;
							a1Out = a1_108;
							a2Out = a2_109;
							a3Out = a3_110;
							a4Out = a4_111;
							a5Out = a5_112;
							s2Out = s2_117;
							s3Out = s3_118;
							s4Out = s4_119;
							return ra_115;
						}
					}
				}
				else
					a0_182 = 0xFB000080;
			}
			else
				a0_182 = 0xFB000180;
			s0Out = s0_210;
			s1Out = s1_18;
			a0Out = a0_182;
			a1Out = a1_185;
			a2Out = dwArg48;
			a3Out = a3_190;
			a4Out = a4_193;
			a5Out = a5_197;
			s2Out = s2_21;
			s3Out = s3_219;
			s4Out = dwArg04;
			return ra;
		}
		a5.u0 = 0x01;
		if (a3 == 0x01)
		{
			Eq_2 a1_130;
			Eq_2 a2_131;
			Eq_2 a3_132;
			Eq_2 a4_133;
			Eq_2 a5_134;
			Eq_2 s1_138;
			Eq_2 s2_139;
			Eq_2 s3_140;
			Eq_2 s4_141;
			ptr32 a0_150;
			word32 s8_278;
			Eq_2 ra_137 = mbedtls_ecp_set_zero(ra, s0, a1, a3, a4, mstatus, dwArg00, dwArg04, dwArg18, dwArg28, dwArg38, dwArgE8, dwArgF8, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out s1_138, out a0_150, out a1_130, out a2_131, out a3_132, out a4_133, out a5_134, out s2_139, out s3_140, out s4_141, out s8_278);
			s0Out = s0;
			s1Out = s1_138;
			a0Out = a0_150;
			a1Out = a1_130;
			a2Out = a2_131;
			a3Out = a3_132;
			a4Out = a4_133;
			a5Out = a5_134;
			s2Out = s2_139;
			s3Out = s3_140;
			s4Out = s4_141;
			return ra_137;
		}
	}
	s0Out = s0;
	s1Out = s1;
	a0Out = 0xFB000080;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	return ra;
}

// 2309574C: Register Eq_2 mbedtls_ecp_check_pubkey(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      pk_parse_key_sec1_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_ecp_mul
Eq_2 mbedtls_ecp_check_pubkey(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_108;
	Eq_2 s3_130 = a1;
	Eq_2 s1_12 = a0;
	Eq_2 a2_23;
	word32 a6_823;
	Eq_2 a5_26;
	Eq_2 a4_25;
	ptr32 a1_22;
	Eq_2 a3_24;
	if (mbedtls_mpi_cmp_int(0x01, a2, out a1_22, out a2_23, out a3_24, out a4_25, out a5_26, out a6_823) == 0x00)
	{
		a5_26.u0 = 0x01;
		if (ecp_get_type(a5_26) != 0x01)
		{
			s0_108.u0 = 0xFB000080;
			goto l23095860;
		}
		Eq_2 a2_38;
		word32 a6_824;
		if (mbedtls_mpi_cmp_int(0x00, a2_23, out a1_22, out a2_38, out a3_24, out a4_25, out a5_26, out a6_824) < 0x00)
			goto l23095780;
		Eq_2 a2_49;
		word32 a6_825;
		if (mbedtls_mpi_cmp_int(0x00, a2_38, out a1_22, out a2_49, out a3_24, out a4_25, out a5_26, out a6_825) >= 0x00)
		{
			s2 = (word32) a0 + 4;
			Eq_2 a2_60;
			word32 a6_826;
			if (mbedtls_mpi_cmp_mpi(a2_49, a4_25, a5_26, out a1_22, out a2_60, out a3_24, out a4_25, out a5_26, out a6_826) < 0x00)
			{
				word32 a2_827;
				word32 a6_828;
				if (mbedtls_mpi_cmp_mpi(a2_60, a4_25, a5_26, out a1_22, out a2_827, out a3_24, out a4_25, out a5_26, out a6_828) < 0x00)
				{
					mbedtls_mpi_init(fp + -56);
					mbedtls_mpi_init(fp + -44);
					Eq_2 a0_106;
					word32 s0_829;
					word32 a3_831;
					word32 s4_832;
					word32 s8_833;
					word32 s1_830;
					Eq_2 a5_119;
					Eq_2 a4_118;
					Eq_2 a2_116;
					ra = mbedtls_mpi_mul_mpi(ra, fp + -56, (word32) a1 + 0x0C, (word32) a1 + 0x0C, a3_24, a4_25, (word32) a0 + 4, s4, s6, mstatus, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_829, out s1_830, out a0_106, out a2_116, out a3_831, out a4_118, out a5_119, out s2, out s3_130, out s4_832, out s5, out s6, out s8_833);
					s0_108 = a0_106;
					if (a0_106 == 0x00)
					{
						Eq_2 a0_114;
						Eq_2 a3_117;
						Eq_2 s4_131;
						word32 s9_845;
						word32 s8_844;
						word32 s1_843;
						ra = ecp_modp(ra, fp + -56, a2_116, a4_118, a5_119, s2, s5, s6, s7, s10, s11, mstatus, dwLoc38, dwLoc30, dwLoc2C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgE8, dwArgF4, out s1_843, out a0_114, out a2_116, out a3_117, out a4_118, out a5_119, out s2, out s3_130, out s4_131, out s5, out s6, out s7, out s8_844, out s9_845, out s10, out s11, out mstatus);
						s0_108 = a0_114;
						if (a0_114 == 0x00)
						{
							Eq_2 a0_168;
							word32 s8_850;
							word32 s4_849;
							word32 s0_846;
							word32 a3_848;
							word32 s1_847;
							ra = mbedtls_mpi_mul_mpi(ra, fp + -44, s3_130, s3_130, a3_117, a4_118, s2, s4_131, s6, mstatus, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_846, out s1_847, out a0_168, out a2_116, out a3_848, out a4_118, out a5_119, out s2, out s3_130, out s4_849, out s5, out s6, out s8_850);
							s0_108 = a0_168;
							if (a0_168 == 0x00)
							{
								Eq_2 a0_173;
								Eq_2 a3_176;
								word32 s8_853;
								word32 s9_854;
								word32 s4_852;
								word32 s1_851;
								ra = ecp_modp(ra, fp + -44, a2_116, a4_118, a5_119, s2, s5, s6, s7, s10, s11, mstatus, dwLoc38, dwLoc30, dwLoc2C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgE8, dwArgF4, out s1_851, out a0_173, out a2_116, out a3_176, out a4_118, out a5_119, out s2, out s3_130, out s4_852, out s5, out s6, out s7, out s8_853, out s9_854, out s10, out s11, out mstatus);
								s0_108 = a0_173;
								if (a0_173 == 0x00)
								{
									Eq_2 a3_240;
									Eq_2 s4_219;
									if (a5_119 == 0x00)
									{
										word32 s4_861;
										Eq_2 a0_275;
										ra = mbedtls_mpi_sub_int(ra, a0_173, fp + -44, 0x03, a3_176, s2, mstatus, dwArg38, s1, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out a0_275, out a2_116, out a3_240, out a4_118, out a5_119, out s2, out s3_130, out s4_861);
										while (true)
										{
											s0_108 = a0_275;
											if (a0_275 != 0x00)
												break;
											s4_219 = dwArgA4;
											if (a5_119 >= 0x00)
												goto l2309580C;
											Eq_2 a5_311;
											word32 a1_862;
											word32 a2_863;
											word32 a6_864;
											if (mbedtls_mpi_cmp_int(0x00, a2_116, out a1_862, out a2_863, out a3_240, out a4_118, out a5_311, out a6_864) == 0x00)
												goto l2309580C;
											word32 s0_893;
											word32 s1_894;
											word32 a1_895;
											word32 a7_896;
											word32 s4_897;
											word32 s8_898;
											ra = mbedtls_mpi_add_mpi(ra, a0_275, fp + -44, a3_240, a4_118, a5_311, s2, mstatus, s1, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_893, out s1_894, out a0_275, out a1_895, out a2_116, out a3_240, out a4_118, out a5_119, out a7_896, out s2, out s3_130, out s4_897, out s8_898);
										}
									}
									else
									{
										word32 s0_855;
										word32 s1_856;
										word32 a1_857;
										word32 a3_858;
										word32 a7_859;
										word32 s8_860;
										Eq_2 a0_206;
										ra = mbedtls_mpi_add_mpi(ra, a0_173, fp + -44, a3_176, a4_118, a5_119, s2, mstatus, s1, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_855, out s1_856, out a0_206, out a1_857, out a2_116, out a3_858, out a4_118, out a5_119, out a7_859, out s2, out s3_130, out s4_219, out s8_860);
										while (true)
										{
											s0_108 = a0_206;
											if (a0_206 != 0x00)
												break;
											Eq_2 a5_242;
											word32 a1_899;
											word32 a2_900;
											word32 a6_901;
											if (mbedtls_mpi_cmp_mpi(a2_116, a4_118, a5_119, out a1_899, out a2_900, out a3_240, out a4_118, out a5_242, out a6_901) < 0x00)
											{
l2309580C:
												Eq_2 a0_384;
												word32 s0_865;
												word32 s1_866;
												word32 a3_867;
												word32 s4_868;
												word32 s8_869;
												ra = mbedtls_mpi_mul_mpi(ra, fp + -44, fp + -44, s3_130, a3_240, a4_118, s2, s4_219, s6, mstatus, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_865, out s1_866, out a0_384, out a2_116, out a3_867, out a4_118, out a5_119, out s2, out s3_130, out s4_868, out s5, out s6, out s8_869);
												s0_108 = a0_384;
												if (a0_384 == 0x00)
												{
													Eq_2 a0_398;
													Eq_2 a3_401;
													word32 s1_870;
													word32 s4_871;
													word32 s8_872;
													word32 s9_873;
													ra = ecp_modp(ra, fp + -44, a2_116, a4_118, a5_119, s2, s5, s6, s7, s10, s11, mstatus, dwLoc38, dwLoc30, dwLoc2C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgE8, dwArgF4, out s1_870, out a0_398, out a2_116, out a3_401, out a4_118, out a5_119, out s2, out s3_130, out s4_871, out s5, out s6, out s7, out s8_872, out s9_873, out s10, out s11, out mstatus);
													s0_108 = a0_398;
													if (a0_398 == 0x00)
													{
														word32 s0_874;
														word32 s1_875;
														word32 a1_876;
														word32 a3_877;
														word32 a7_878;
														word32 s4_879;
														word32 s8_880;
														Eq_2 a0_430;
														ra = mbedtls_mpi_add_mpi(ra, a0_398, fp + -44, a3_401, a4_118, a5_119, s2, mstatus, s1, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_874, out s1_875, out a0_430, out a1_876, out a2_116, out a3_877, out a4_118, out a5_119, out a7_878, out s2, out s3_130, out s4_879, out s8_880);
														while (true)
														{
															s0_108 = a0_430;
															if (a0_430 != 0x00)
																break;
															Eq_2 a2_463;
															Eq_2 a3_464;
															Eq_2 a4_465;
															Eq_2 a5_466;
															word32 a1_881;
															word32 a6_882;
															if (mbedtls_mpi_cmp_mpi(a2_116, a4_118, a5_119, out a1_881, out a2_463, out a3_464, out a4_465, out a5_466, out a6_882) < 0x00)
															{
																word32 a1_890;
																word32 a3_891;
																word32 a6_892;
																Eq_2 a0_498 = mbedtls_mpi_cmp_mpi(a2_463, a4_465, a5_466, out a1_890, out a2_116, out a3_891, out a4_118, out a5_119, out a6_892);
																s0_108 = a0_498;
																if (a0_498 != 0x00)
																	s0_108.u0 = 0xFB000380;
																break;
															}
															word32 s0_883;
															word32 s1_884;
															word32 a1_885;
															word32 a3_886;
															word32 a7_887;
															word32 s4_888;
															word32 s8_889;
															ra = mbedtls_mpi_sub_abs(ra, fp + -44, fp + -44, s2, a3_464, a4_465, a5_466, mstatus, dwArg78, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_883, out s1_884, out a0_430, out a1_885, out a2_116, out a3_886, out a4_118, out a5_119, out a7_887, out s2, out s3_130, out s4_888, out s8_889);
														}
													}
												}
												break;
											}
											word32 s0_902;
											word32 s1_903;
											word32 a1_904;
											word32 a3_905;
											word32 a7_906;
											word32 s8_907;
											ra = mbedtls_mpi_sub_abs(ra, fp + -44, fp + -44, s2, a3_240, a4_118, a5_242, mstatus, dwArg78, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_902, out s1_903, out a0_206, out a1_904, out a2_116, out a3_905, out a4_118, out a5_119, out a7_906, out s2, out s3_130, out s4_219, out s8_907);
										}
									}
								}
							}
						}
					}
					Eq_2 a2_516;
					Eq_2 a5_517;
					Eq_2 a4_520;
					word32 a3_836;
					word32 s4_838;
					word32 a6_837;
					word32 a1_835;
					word32 a0_834;
					mbedtls_mpi_free(fp + -56, a2_116, a4_118, a5_119, mstatus, dwArg0108, dwArg0148, out a0_834, out a1_835, out a2_516, out a3_836, out a4_520, out a5_517, out a6_837, out s4_838);
					word32 s4_842;
					word32 a0_839;
					word32 a6_841;
					word32 a2_840;
					s1_12 = mbedtls_mpi_free(fp + -44, a2_516, a4_520, a5_517, mstatus, dwArg0108, dwArg0148, out a0_839, out a1_22, out a2_840, out a3_24, out a4_25, out a5_26, out a6_841, out s4_842);
l23095860:
					s0Out = s0_108;
					s1Out = s1_12;
					a0Out = s0_108;
					a1Out = a1_22;
					a2Out = dwArg0138;
					a3Out = a3_24;
					a4Out = a4_25;
					a5Out = a5_26;
					s2Out = s2;
					s3Out = s3_130;
					s4Out = dwArgF4;
					s5Out = s5;
					s6Out = s6;
					s7Out = s7;
					s10Out = s10;
					s11Out = s11;
					mstatusOut = mstatus;
					return ra;
				}
			}
		}
	}
l23095780:
	s0_108.u0 = 0xFB000380;
	goto l23095860;
}

