pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 230958C2: Register word32 mbedtls_ecp_check_privkey(Register Eq_2 a2, Register Eq_2 a5, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      pk_parse_key_sec1_der
//      mbedtls_ecp_mul
word32 mbedtls_ecp_check_privkey(Eq_2 a2, Eq_2 a5, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	ptr32 a5_18;
	if (ecp_get_type(a5) != 0x01)
	{
		a5_18 = 0xFB000080;
		goto l230958FA;
	}
	Eq_2 a2_24;
	Eq_2 a5_27;
	word32 a1_84;
	word32 a6_85;
	if (mbedtls_mpi_cmp_int(0x01, a2, out a1_84, out a2_24, out a3, out a4, out a5_27, out a6_85) >= 0x00)
	{
		a5_18 = 0x00;
		word32 a1_86;
		word32 a2_87;
		word32 a5_88;
		word32 a6_89;
		if (mbedtls_mpi_cmp_mpi(a2_24, a4, a5_27, out a1_86, out a2_87, out a3, out a4, out a5_88, out a6_89) < 0x00)
		{
l230958FA:
			a0Out = a5_18;
			a2Out = dwArg10;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5_18;
			return a0;
		}
	}
	a5_18 = 0xFB000380;
	goto l230958FA;
}

// 2309590E: Register Eq_2 mbedtls_ecp_mul(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      pk_parse_key_sec1_der
//      mbedtls_ecp_check_pub_priv
Eq_2 mbedtls_ecp_mul(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s4, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s0_43;
	Eq_2 s1_195 = a0;
	Eq_2 s3_203 = a2;
	Eq_2 s2_201 = a3;
	Eq_2 s6_208 = a5;
	Eq_2 a2_36;
	word32 a1_245;
	word32 a3_246;
	word32 a6_247;
	ptr32 a4_182;
	Eq_2 a5_184;
	if (mbedtls_mpi_cmp_int(0x01, a2, out a1_245, out a2_36, out a3_246, out a4_182, out a5_184, out a6_247) == 0x00)
	{
		ptr32 a0_46;
		Eq_2 a2_47;
		word32 a3_248;
		s1_195 = mbedtls_ecp_check_privkey(a2_36, a5_184, out a0_46, out a2_47, out a3_248, out a4_182, out a5_184);
		s0_43 = a0_46;
		if (a0_46 == 0x00)
		{
			ptr32 a0_63;
			Eq_2 s5_79;
			word32 s0_249;
			word32 a1_250;
			word32 a2_251;
			word32 a3_252;
			word32 s4_253;
			ra = mbedtls_ecp_check_pubkey(ra, s1_195, s1_195, a3, a2_47, a1, a5, s7, s10, s11, mstatus, s4, s2, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg48, dwArg58, s1, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0128, dwArg0138, out s0_249, out s1_195, out a0_63, out a1_250, out a2_251, out a3_252, out a4_182, out a5_184, out s2_201, out s3_203, out s4_253, out s5_79, out s6_208, out s7, out s10, out s11, out mstatus);
			s0_43 = a0_63;
			if (a0_63 == 0x00)
			{
				a5_184.u0 = 0x01;
				if (ecp_get_type(a5_184) == 0x01)
				{
					0x00 = (int8) dwArgA8;
					ptr32 a4_123;
					Eq_2 a5_124;
					Eq_2 a2_125;
					ptr32 mstatus_136;
					ptr32 a0_121 = ecp_mul_comb(ra, s1_195, dwArg48, s5_79, s6_208, s3_203, s11, mstatus, dwArg00, dwArg04, out a2_125, out a4_123, out a5_124, out mstatus_136);
					s1Out = s1_195;
					a0Out = a0_121;
					a2Out = a2_125;
					a4Out = a4_123;
					a5Out = a5_124;
					s2Out = s2_201;
					s3Out = s3_203;
					s6Out = s6_208;
					s7Out = s7;
					s10Out = s10;
					s11Out = s11;
					mstatusOut = mstatus_136;
					return ra;
				}
			}
		}
	}
	else
		s0_43 = 0xFB000080;
	0x00 = (int8) dwArgA8;
	s1Out = s1_195;
	a0Out = s0_43;
	a2Out = dwArg48;
	a4Out = a4_182;
	a5Out = a5_184;
	s2Out = s2_201;
	s3Out = s3_203;
	s6Out = s6_208;
	s7Out = s7;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 2309599A: void mbedtls_ecp_check_pub_priv(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 byte) a0, Register (ptr32 byte) a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
// Called from:
//      eckey_check_pair
void mbedtls_ecp_check_pub_priv(Eq_2 ra, Eq_2 s1, byte * a0, byte * a1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	Eq_2 a5_17 = (word32) *a0;
	if (a5_17 == 0x00)
		return;
	Eq_2 a4_19 = (word32) *a1;
	if (a4_19 != a5_17)
		return;
	Eq_2 a2_28;
	Eq_2 a4_30;
	Eq_2 a5_31;
	word32 a3_366;
	word32 a6_367;
	word32 a1_365;
	if (mbedtls_mpi_cmp_mpi(a2, a4_19, a5_17, out a1_365, out a2_28, out a3_366, out a4_30, out a5_31, out a6_367) != 0x00)
		return;
	Eq_2 a2_38;
	Eq_2 a4_40;
	Eq_2 a5_41;
	word32 a3_369;
	word32 a6_370;
	word32 a1_368;
	if (mbedtls_mpi_cmp_mpi(a2_28, a4_30, a5_31, out a1_368, out a2_38, out a3_369, out a4_40, out a5_41, out a6_370) != 0x00)
		return;
	word32 a6_376;
	word32 a5_375;
	word32 a3_373;
	word32 a4_374;
	word32 a2_372;
	word32 a1_371;
	if (mbedtls_mpi_cmp_mpi(a2_38, a4_40, a5_41, out a1_371, out a2_372, out a3_373, out a4_374, out a5_375, out a6_376) != 0x00)
		return;
	mbedtls_ecp_point_init.part.2(fp + -0x00C0);
	Eq_2 a2_62;
	Eq_2 a4_64;
	word32 a5_381;
	word32 a1_379;
	word32 a3_380;
	word32 a0_378;
	word32 t1_377;
	Eq_2 ra_66 = memset(ra, fp + -0x009C, 0x00, 0x007C, out t1_377, out a0_378, out a1_379, out a2_62, out a3_380, out a4_64, out a5_381);
	Eq_2 s1_80;
	Eq_2 s2_81;
	Eq_2 s4_82;
	word32 s0_79 = mbedtls_ecp_group_copy(fp + -0x009C, a2_62, a4_64, mstatus, dwLocA8, dwLoc7C, dwArg48, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, out s1_80, out s2_81, out s4_82);
	word32 a0_95;
	ptr32 mstatus_113;
	word32 s11_388;
	word32 s10_387;
	word32 s6_385;
	word32 s7_386;
	word32 s3_384;
	word32 s1_382;
	word32 s2_383;
	Eq_2 a5_100;
	Eq_2 a4_131;
	Eq_2 a2_129;
	mbedtls_ecp_mul(ra_66, s1_80, fp + -0x00C0, s0_79 + 0x007C, s0_79 + 40, 0x00, s2_81, s4_82, s7, s10, s11, mstatus, dwLocC0, dwLocBC, dwLocB8, dwLocA8, dwLoc98, dwLoc78, s2, dwLoc48, dwLoc3C, dwLoc38, dwLoc28, dwLoc18, dwLoc0C, dwLoc08, dwArg08, s3, s1, dwArg28, dwArg38, dwArg68, dwArg78, out s1_382, out a0_95, out a2_129, out a4_131, out a5_100, out s2_383, out s3_384, out s6_385, out s7_386, out s10_387, out s11_388, out mstatus_113);
	if (a0_95 == 0x00)
	{
		word32 a1_399;
		word32 a3_400;
		word32 a6_401;
		if (mbedtls_mpi_cmp_mpi(a2_129, a4_131, a5_100, out a1_399, out a2_129, out a3_400, out a4_131, out a5_100, out a6_401) != 0x00)
		{
l23095A54:
			goto l23095A5A;
		}
		word32 a1_402;
		word32 a3_403;
		word32 a6_404;
		if (mbedtls_mpi_cmp_mpi(a2_129, a4_131, a5_100, out a1_402, out a2_129, out a3_403, out a4_131, out a5_100, out a6_404) != 0x00)
			goto l23095A54;
		word32 a1_405;
		word32 a3_406;
		word32 a6_407;
		if (mbedtls_mpi_cmp_mpi(a2_129, a4_131, a5_100, out a1_405, out a2_129, out a3_406, out a4_131, out a5_100, out a6_407) != 0x00)
			goto l23095A54;
	}
l23095A5A:
	Eq_2 a2_170;
	Eq_2 a4_172;
	word32 a3_390;
	word32 s4_392;
	word32 a5_391;
	word32 a0_389;
	mbedtls_ecp_point_free.part.4(fp + -0x00C0, a2_129, a4_131, a5_100, mstatus_113, dwLocB0, dwArg78, dwArg88, dwArgB8, dwArgC8, out a0_389, out a2_170, out a3_390, out a4_172, out a5_391, out s4_392);
	word32 a2_394;
	word32 a3_395;
	word32 a1_393;
	word32 a5_397;
	word32 a4_396;
	word32 s2_398;
	mbedtls_ecp_group_free(fp + -0x009C, a2_170, a4_172, mstatus_113, dwLocC0, dwLoc88, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, out a1_393, out a2_394, out a3_395, out a4_396, out a5_397, out s2_398);
}

// 23095A68: void ecp_mod_koblitz.constprop.0(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
// Called from:
//      ecp_mod_p224k1
//      ecp_mod_p256k1
void ecp_mod_koblitz.constprop.0(Eq_2 ra, Eq_2 a2, Eq_2 a5, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	if (a5 < a2)
		return;
	word32 a1_39;
	ui32 a2_40;
	word32 a5_452;
	word32 a3_450;
	word32 a4_451;
	word32 t1_448;
	word32 a0_449;
	Eq_2 ra_44 = memset(ra, fp + -76, 0x00, 44, out t1_448, out a0_449, out a1_39, out a2_40, out a3_450, out a4_451, out a5_452);
	word32 a5_57;
	word32 a7_456;
	word32 a2_454;
	word32 a6_455;
	word32 a1_453;
	Eq_2 a4_56;
	Eq_2 a3_61;
	memcpy(fp + -76, a1_39 + (a2 << 0x02), a2_40 << 2, out a1_453, out a2_454, out a3_61, out a4_56, out a5_57, out a6_455, out a7_456);
	Eq_2 a5_71 = (word32) a4_56 + a5_57;
	Eq_2 a5_73 = a2;
	while (a5_73 < a4_56)
	{
		a3_61 = a5_73 << 0x02;
		a4_56 += a3_61;
		*a4_56 = 0x00;
		a5_73 = (word32) a5_73 + 1;
	}
	Eq_2 a3_101;
	Eq_2 a4_102;
	Eq_2 a5_103;
	Eq_2 s0_107;
	Eq_2 s1_108;
	Eq_2 s2_109;
	word32 a0_121;
	Eq_2 s6_122;
	word32 s5_460;
	word32 s8_461;
	word32 s3_458;
	word32 s4_459;
	word32 a2_457;
	Eq_2 ra_106 = mbedtls_mpi_mul_mpi(ra_44, fp + -100, fp + -100, fp + -88, a3_61, a4_56, fp + -76, s4, s6, mstatus, dwArg38, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0128, out s0_107, out s1_108, out a0_121, out a2_457, out a3_101, out a4_102, out a5_103, out s2_109, out s3_458, out s4_459, out s5_460, out s6_122, out s8_461);
	if (a0_121 == 0x00)
	{
		word32 a4_465;
		word32 a3_464;
		word32 a7_466;
		up32 a5_130;
		Eq_2 s2_136;
		word32 s3_137;
		Eq_2 s4_138;
		word32 a0_147;
		word32 s1_462;
		word32 a1_463;
		Eq_2 s0_134;
		Eq_2 ra_133 = mbedtls_mpi_add_abs(ra_106, s0_107, s1_108, s1_108, fp + -100, a3_101, a4_102, a5_103, s2_109, mstatus, a5_71, dwArg48, dwArg68, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_134, out s1_462, out a0_147, out a1_463, out a3_464, out a4_465, out a5_130, out a7_466, out s2_136, out s3_137, out s4_138);
		if (a0_147 == 0x00)
		{
			word32 t1_467;
			word32 a3_469;
			word32 a0_468;
			word32 a4_470;
			word32 a5_471;
			word32 a1_158;
			ui32 a2_159;
			Eq_2 ra_163 = memset(ra_133, s2_136, 0x00, 44, out t1_467, out a0_468, out a1_158, out a2_159, out a3_469, out a4_470, out a5_471);
			word32 a1_472;
			word32 a2_473;
			word32 a6_474;
			word32 a5_175;
			Eq_2 a3_179;
			word32 a7_475;
			Eq_2 a4_174;
			memcpy(s2_136, a1_158 + s3_137, a2_159 << 2, out a1_472, out a2_473, out a3_179, out a4_174, out a5_175, out a6_474, out a7_475);
			Eq_2 a5_189 = (word32) a4_174 + a5_175;
			a5_191 = a5_189;
			while (true)
			{
				Eq_2 a5_191;
				if (s0_134 >= a5_191)
					break;
				a4_174 = s0_134 << 0x02;
				a5_191 += a4_174;
				*a5_191 = 0x00;
				s0_134 = (word32) s0_134 + 1;
			}
			Eq_2 a3_216;
			Eq_2 a4_217;
			Eq_2 a5_218;
			Eq_2 s0_222;
			Eq_2 s1_223;
			Eq_2 s2_224;
			word32 a0_236;
			word32 a2_476;
			word32 s3_477;
			word32 s4_478;
			word32 s5_479;
			word32 s6_480;
			word32 s8_481;
			Eq_2 ra_221 = mbedtls_mpi_mul_mpi(ra_163, fp + -100, fp + -100, fp + -88, a3_179, a4_174, s2_136, s4_138, s6_122, mstatus, dwArg38, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0128, out s0_222, out s1_223, out a0_236, out a2_476, out a3_216, out a4_217, out a5_218, out s2_224, out s3_477, out s4_478, out s5_479, out s6_480, out s8_481);
			if (a0_236 == 0x00)
			{
				word32 s0_482;
				word32 s1_483;
				word32 a0_484;
				word32 a1_485;
				word32 a3_486;
				word32 a4_487;
				word32 a5_488;
				word32 a7_489;
				word32 s2_490;
				word32 s3_491;
				word32 s4_492;
				mbedtls_mpi_add_abs(ra_221, s0_222, s1_223, s1_223, fp + -100, a3_216, a4_217, a5_218, s2_224, mstatus, a5_189, dwArg48, dwArg68, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_482, out s1_483, out a0_484, out a1_485, out a3_486, out a4_487, out a5_488, out a7_489, out s2_490, out s3_491, out s4_492);
			}
		}
	}
}

// 23095B60: void ecp_mod_p224k1(Register Eq_2 ra, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void ecp_mod_p224k1(Eq_2 ra, Eq_2 a5, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	ecp_mod_koblitz.constprop.0(ra, 0x07, a5, s4, s6, mstatus, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0128);
}

// 23095B6E: void ecp_mod_p256k1(Register Eq_2 ra, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void ecp_mod_p256k1(Eq_2 ra, Eq_2 a5, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	ecp_mod_koblitz.constprop.0(ra, 0x08, a5, s4, s6, mstatus, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0128);
}

