pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23095B7C: Register Eq_2 mbedtls_ecp_group_load(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      pk_use_ecparams
//      mbedtls_ecp_group_copy
Eq_2 mbedtls_ecp_group_load(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ptr32 s1_111;
	ptr32 a1_105;
	ptr32 a0_117;
	ptr32 a3_107;
	ptr32 a2_106;
	ptr32 a5_109;
	ptr32 a4_108;
	Eq_2 a4_134;
	struct Eq_547713 * a5_101;
	word32 a1_18;
	Eq_2 a4_21;
	word32 a2_225;
	word32 a3_226;
	word32 a5_227;
	ptr32 s2_112;
	mbedtls_ecp_group_free(a0, a2, a4, mstatus, dwLoc20, dwArg18, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158, dwArg0168, out a1_18, out a2_225, out a3_226, out a4_21, out a5_227, out s2_112);
	*a0 = (byte) a1_18;
	if (a1_18 != 11)
	{
		if (a1_18 != 0x0C)
		{
			if (a1_18 != 0x03)
			{
				s1_111 = mbedtls_ecp_group_free(a0, dwArg44, a4_21, mstatus, dwLoc20, dwArg18, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158, dwArg0168, out a1_105, out a2_106, out a3_107, out a4_108, out a5_109, out s2_112);
				a0_117 = 0xFB000180;
				goto l23095C14;
			}
			g_t230C8B68 = a0;
			g_t230C8B00 = a0;
			g_t230C8B90 = a0;
			*(union Eq_2 *) 0x10 = a0;
			*(union Eq_2 *) 0x28 = a0;
			*(union Eq_2 *) 88 = a0;
			*(union Eq_2 *) 0x34 = a0;
			*(union Eq_2 *) 0x40 = a0;
			*(union Eq_2 *) 0x05 = a0;
			*(union Eq_2 *) 0x1D = a0;
			*(union Eq_2 *) 77 = a0;
			*(union Eq_2 *) 0x29 = a0;
			g_t230C8B2C = a0;
			*(union Eq_2 *) 0x35 = a0;
			a4_134.u0 = 588024572;
			a5_101 = &g_t230C8B1C;
		}
		else
		{
			g_t230C8AC8 = a0;
			g_t230CBB38 = a0;
			g_t230CBB48 = a0;
			g_t23095BD2 = a0;
			g_t230C8AF0 = a0;
			*(union Eq_2 *) 0x10 = a0;
			*(union Eq_2 *) 88 = a0;
			*(union Eq_2 *) 0x34 = a0;
			*(union Eq_2 *) 0x40 = a0;
			*(union Eq_2 *) 0x05 = a0;
			*(union Eq_2 *) 0x11 = a0;
			*(union Eq_2 *) 0x15 = a0;
			*(union Eq_2 *) 0x1D = a0;
			*(union Eq_2 *) 33 = a0;
			*(union Eq_2 *) 77 = a0;
			*(union Eq_2 *) 0x29 = a0;
			g_t230C8A8C = a0;
			*(union Eq_2 *) 0x35 = a0;
			a4_134.u0 = 588024412;
			a5_101 = &g_t230C8A7C;
		}
	}
	else
	{
		g_t230C8A4C = a0;
		g_t230CBB30 = a0;
		g_t230CBB40 = a0;
		*(union Eq_2 *) 88 = a0;
		g_t23095BC4 = a0;
		g_t230C8A74 = a0;
		*(union Eq_2 *) 0x0F = a0;
		*(union Eq_2 *) 0x33 = a0;
		*(union Eq_2 *) 0x3F = a0;
		*(union Eq_2 *) 0x05 = a0;
		*(union Eq_2 *) 0x11 = a0;
		*(union Eq_2 *) 0x15 = a0;
		*(union Eq_2 *) 0x1D = a0;
		*(union Eq_2 *) 33 = a0;
		*(union Eq_2 *) 77 = a0;
		*(union Eq_2 *) 0x29 = a0;
		g_t230C8A18 = a0;
		*(union Eq_2 *) 0x35 = a0;
		a4_134.u0 = 0x230C89E8;
		a5_101 = &g_t230C8A04;
	}
	a5_101->t003C = a0;
	g_t4200ED40 = a0;
	*(union Eq_2 *) 0x41 = a0;
	*(union Eq_2 *) 0x45 = a0;
	Eq_2 a2_158;
	Eq_2 a4_160;
	Eq_2 a5_161;
	word32 a1_228;
	word32 a3_229;
	mbedtls_mpi_bitlen(dwArg44, a4_134, 0x4200ECF8, out a1_228, out a2_158, out a3_229, out a4_160, out a5_161)->t0058 = a0;
	mbedtls_mpi_bitlen(a2_158, a4_160, a5_161, out a1_105, out a2_106, out a3_107, out a4_108, out a5_109)->t005C = a0;
	*(union Eq_2 *) 0x61 = a0;
	s1_111 = 0x01;
	a0_117 = 0x00;
l23095C14:
	s1Out = s1_111;
	a0Out = a0_117;
	a1Out = a1_105;
	a2Out = a2_106;
	a3Out = a3_107;
	a4Out = a4_108;
	a5Out = a5_109;
	s2Out = s2_112;
	s4Out = dwArg04;
	return a0;
}

Eq_2 g_t23095BC4 = 
	{
		55
	};
Eq_2 g_t23095BD2 = 
	{
		19
	};
// 23095CF2: Register word32 gcm_mult(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_547900 s1Out, Register out Eq_547901 a1Out, Register out Eq_2 a5Out, Register out Eq_547903 a7Out, Register out Eq_547904 s2Out)
// Called from:
//      mbedtls_cipher_auth_encrypt
//      mbedtls_gcm_starts
//      mbedtls_gcm_update
word32 gcm_mult(Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_547900 & s1Out, union Eq_547901 & a1Out, union Eq_2 & a5Out, union Eq_547903 & a7Out, union Eq_547904 & s2Out)
{
	struct Eq_547905 * a3_17 = (word32) a0 + (((word32) (*((word32) a1 + 0x0F)) & 0x0F) << 3);
	int32 t3_13;
	Eq_547917 t1_18 = a3_17->t00C0;
	Eq_547921 a4_19 = a3_17->t00C4;
	uint32 a3_101 = *((word32) *((word32) a5 + 64) + 0x0044);
	for (t3_13 = 0x0F; t3_13 != ~0x00; t3_13 += ~0x00)
	{
		uint32 a6_35 = (word32) *((word32) a1 + t3_13);
		int32 t5_36 = g_a230C8B80[a5 & 0x0F];
		ui32 s0_42 = a5 >> 0x04 | a3_101 << 0x1C;
		ui32 t4_46 = t1_18 << 0x1C | a3_101 >> 0x04;
		Eq_547900 s1_49 = a4_19 << 0x1C | t1_18 >> 0x04;
		Eq_547904 s2_52 = a4_19 >> 0x04;
		if (t3_13 != 0x0F)
		{
			struct Eq_547986 * a3_56 = (word32) a0 + ((a6_35 & 0x0F) << 0x03);
			struct Eq_547992 * a5_58 = t5_36 << 16 ^ s2_52;
			a4_19 = a3_56->dw00C4 ^ a5_58;
			t1_18 = a3_56->dw00C0 ^ s1_49;
			a5 = a5_58 ^ s0_42;
			a3_101 = a5_58->ptr0040->dw0044 ^ t4_46;
		}
		struct Eq_547932 * a6_75 = (word32) a0 + ((a6_35 >> 0x04) << 3);
		Eq_547903 a7_76 = a3_101 << 0x1C | a5 >> 0x04;
		a4_19 = a6_75->dw00C4 ^ a4_19 >> 0x04 ^ g_a230C8B80[a5 & 0x0F] << 16;
		t1_18 = a6_75->dw00C0 ^ (a4_19 << 0x1C | t1_18 >> 0x04);
		a5 = a6_75->dw0040 ^ a7_76;
		a3_101 = a6_75->dw0044 ^ (t1_18 << 0x1C | a3_101 >> 4);
	}
	*a2 = (byte) (a4_19 >> 0x18);
	*((word32) a2 + 1) = (byte) (a4_19 >> 0x10);
	*((word32) a2 + 3) = (byte) a4_19;
	*((word32) a2 + 4) = (byte) (t1_18 >> 0x18);
	*((word32) a2 + 5) = (byte) (t1_18 >> 0x10);
	*((word32) a2 + 6) = (byte) (t1_18 >> 0x08);
	*((word32) a2 + 8) = (byte) (a3_101 >> 0x18);
	*((word32) a2 + 9) = (byte) (a3_101 >> 0x10);
	*((word32) a2 + 0x0A) = (byte) (a3_101 >> 0x08);
	*((word32) a2 + 0x0C) = (byte) (a5 >> 0x18);
	*((word32) s1 + 0x0D) = (byte) (a5 >> 0x10);
	*((word32) s1 + 2) = (byte) (a4_19 >> 0x08);
	*((word32) s1 + 7) = (byte) t1_18;
	*((word32) s1 + 11) = (byte) a3_101;
	*((word32) s1 + 0x0E) = (byte) (a5 >> 0x08);
	*((word32) s1 + 0x0F) = (byte) a5;
	s1Out = s1_49;
	a1Out = a4_19 >> 0x08;
	a5Out = a5;
	a7Out = a7_76;
	s2Out = s2_52;
	return dwArg14;
}

