pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23095E5E: void mbedtls_gcm_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      gcm_ctx_alloc
void mbedtls_gcm_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	memset(ra, a0, 0x00, 0x0188, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 23095E68: void mbedtls_gcm_setkey(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_506254) a1, Register (ptr32 Eq_506254) a3, Register (ptr32 Eq_506254) a5, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8)
// Called from:
//      gcm_aes_setkey_wrap
void mbedtls_gcm_setkey(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_506254 * a1, struct Eq_506254 * a3, struct Eq_506254 * a5, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8)
{
	word32 a4_25;
	if (mbedtls_cipher_info_from_values(a1, a3, (struct Eq_506254 *) 0x01, a3, a5, out a4_25) != 0x00 && a4_25 == 0x10)
	{
		word32 a5_354;
		mbedtls_cipher_free(ra, a0, 0x10, out a5_354);
		word32 a0_38;
		struct Eq_506564 * a4_43;
		struct Eq_506565 * a5_44;
		struct Eq_506254 * s1_46;
		Eq_2 ra_45 = mbedtls_cipher_setup(ra, a0, a3, out s1_46, out a0_38, out a4_43, out a5_44);
		if (a0_38 == 0x00)
		{
			word32 a4_355;
			word32 a5_356;
			if (mbedtls_cipher_setkey(a0, s1_46, 0x01, a4_43, a5_44, out a4_355, out a5_356) == 0x00)
			{
				Eq_2 a5_68;
				word32 a0_80;
				struct Eq_548192 * s0_83;
				word32 s6_372;
				word32 s7_373;
				word32 s8_374;
				word32 s3_369;
				word32 s4_370;
				word32 s5_371;
				word32 a5_366;
				word32 a7_367;
				word32 s2_368;
				word32 s1_363;
				word32 a1_364;
				word32 a3_365;
				word32 a2_360;
				word32 a3_361;
				word32 a4_362;
				word32 t1_357;
				word32 a0_358;
				word32 a1_359;
				mbedtls_cipher_update(memset(ra_45, fp + -32, 0x00, 0x10, out t1_357, out a0_358, out a1_359, out a2_360, out a3_361, out a4_362, out a5_68), a0, fp + -32, 0x10, fp + -32, fp + -36, a5_68, s3, s5, s7, dwLoc08, dwArg38, s1, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, out s0_83, out s1_363, out a0_80, out a1_364, out a3_365, out a5_366, out a7_367, out s2_368, out s3_369, out s4_370, out s5_371, out s6_372, out s7_373, out s8_374);
				if (a0_80 == 0x00)
				{
					s0_83->dw00C4 = 0x00;
					s0_83->dw0044 = 0x00;
					struct Eq_548258 * a4_138 = (word32) bLoc18 << 24 | (word32) bLoc17 << 16 | (word32) bLoc15 | (word32) bLoc16 << 8;
					s0_83->ptr0084 = a4_138;
					uint32 a2_125 = (word32) bLoc1C << 24 | (word32) bLoc1B << 16 | (word32) bLoc19 | (word32) bLoc1A << 8;
					s0_83->dw0100 = a2_125;
					uint32 a5_126 = (word32) bLoc20 << 24 | (word32) bLoc1F << 16 | (word32) bLoc1D | (word32) bLoc1E << 8;
					s0_83->dw0104 = a5_126;
					s0_83->dw00C0 = 0x00;
					s0_83->dw0040 = 0x00;
					struct Eq_548329 * a3_150 = (word32) bLoc14 << 24 | (word32) bLoc13 << 16 | (word32) bLoc11 | (word32) bLoc12 << 8;
					s0_83->ptr0080 = a3_150;
					word32 a6_155;
					int32 a7_156 = 0x04;
					for (a6_155 = 0x03; a6_155 != 0x00; a6_155 += ~0x00)
					{
						a3_150 = a4_138 << 0x1F | a3_150 >> 1;
						struct Eq_548359 * a1_178 = s0_83 + (a7_156 << 0x03) / 264;
						a3_150->ptr0040 = a1_178;
						a4_138 = a2_125 << 0x1F | a4_138 >> 1;
						a4_138->ptr0044 = a1_178;
						a2_125 = a5_126 << 0x1F | a2_125 >> 1;
						a1_178->dw00C0 = a2_125;
						a5_126 = a5_126 >> 1 ^ (a3_150 & 1) + 0xE1000000;
						a1_178->dw00C4 = a5_126;
						a7_156 >>= 0x01;
					}
					word32 a3_187;
					ui32 a2_188 = 0x02;
					for (a3_187 = 0x03; a3_187 != 0x00; a3_187 += ~0x00)
					{
						int32 a1_192 = a2_188 << 0x03;
						struct Eq_548403 * t1_196 = &s0_83->dw00C0 + a1_192;
						struct Eq_548426 * a7_194 = &s0_83->dw0040 + a1_192;
						int32 s1_198 = t1_196->dw0000;
						int32 t2_199 = t1_196->dw0004;
						int32 t0_200 = a7_194->dw0000;
						int32 t6_201 = a7_194->dw0004;
						struct Eq_548406 * a5_203 = &(&s0_83->dw0044 + 1)->ptr0080;
						int32 a4_204 = 0x08;
						do
						{
							struct Eq_548402 * t3_210 = t1_196 + a4_204 / 8;
							t3_210->dw0000 = a5_203->dw0000 ^ s1_198;
							++a5_203;
							t3_210->dw0004 = a5_203->dw007C ^ t2_199;
							struct Eq_548425 * t3_221 = a7_194 + a4_204 / 8;
							t3_221->dw0000 = a5_203->dwFFFFFFF8 ^ t0_200;
							t3_221->dw0004 = a5_203->dwFFFFFFFC ^ t6_201;
							a4_204 += 0x08;
						} while (a1_192 != a4_204);
						a2_188 <<= 1;
					}
				}
			}
		}
	}
}

// 2309603E: Register Eq_2 mbedtls_gcm_starts(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s5, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      mbedtls_cipher_auth_encrypt
Eq_2 mbedtls_gcm_starts(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s5, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgD8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & a7Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 a5_163;
	word32 a2_544;
	word32 a3_545;
	word32 a4_546;
	word32 a5_547;
	word32 a0_535;
	word32 a4_539;
	word32 a5_540;
	word32 t1_541;
	word32 a0_542;
	word32 a1_543;
	word32 a1_536;
	word32 a2_537;
	word32 a3_538;
	word32 t1_534;
	Eq_2 ra_204 = memset(memset(ra, (word32) a0 + 352, 0x00, 0x10, out t1_534, out a0_535, out a1_536, out a2_537, out a3_538, out a4_539, out a5_540), (word32) a0 + 368, 0x00, 0x10, out t1_541, out a0_542, out a1_543, out a2_544, out a3_545, out a4_546, out a5_547);
	((word32) a0 + 320)->u0 = 0x00;
	*((word32) a0 + 328) = 0x00;
	*((word32) a0 + 384) = a1;
	((word32) a0 + 0x0144)->u0 = 0x00;
	*((word32) a0 + 332) = 0x00;
	Eq_2 s1_127 = (word32) a0 + 352;
	Eq_2 s0_117 = a0;
	Eq_2 s5_138 = a2;
	Eq_2 s7_18 = a1;
	Eq_2 s2_137 = a3;
	if (a3 == 0x0C)
	{
		word32 a3_557;
		word32 a4_558;
		word32 a5_559;
		word32 a6_560;
		word32 a7_561;
		word32 a1_555;
		word32 a2_556;
		memcpy((word32) a0 + 352, a2, 0x0C, out a1_555, out a2_556, out a3_557, out a4_558, out a5_559, out a6_560, out a7_561);
		*((word32) a0 + 367) = 0x01;
		a5_163.u0 = 0x01;
	}
	else
	{
		word32 a4_553;
		word32 a5_554;
		word32 t1_548;
		word32 a0_549;
		word32 a1_550;
		word32 a2_551;
		word32 a3_552;
		ra_204 = memset(ra_204, fp + -64, 0x00, 0x10, out t1_548, out a0_549, out a1_550, out a2_551, out a3_552, out a4_553, out a5_554);
		while (s2_137 != 0x00)
		{
			s7_18 = s2_137;
			if (s2_137 > 0x10)
				s7_18.u0 = 0x10;
			Eq_2 a4_103 = s1_127;
			Eq_2 a5_101 = 0x00;
			do
			{
				a4_103 = (word32) a4_103 + 1;
				Mem110[a4_103 + 0x0FFF:byte] = SLICE(CONVERT(Mem104[s5_138 + a5_101:byte], byte, word32) ^ CONVERT(Mem104[a4_103 + 0x00:byte], byte, word32), byte, 0);
				a5_101 = (word32) a5_101 + 1;
			} while (s7_18 != a5_101);
			word32 s2_128;
			word32 a1_572;
			word32 a5_573;
			word32 a7_574;
			s0_117 = gcm_mult(s1_127, s0_117, s1_127, s1_127, a5_101, out s1_127, out a1_572, out a5_573, out a7_574, out s2_128);
			s2_137 = s2_128 - s7_18;
			s5_138 += s7_18;
		}
		Eq_2 a4_139 = s1_127;
		Eq_2 a5_143 = fp + -64;
		do
		{
			a4_139 = (word32) a4_139 + 1;
			*((word32) a4_139 + 0x0FFF) = (byte) ((word32) *a4_139 ^ (word32) (*a5_143));
			a5_143 = (word32) a5_143 + 1;
		} while ((word32) a0 + 368 != a4_139);
		word32 a1_562;
		word32 a7_563;
		word32 s2_564;
		s0_117 = gcm_mult(s1_127, s0_117, s1_127, s1_127, a5_143, out s1_127, out a1_562, out a5_163, out a7_563, out s2_564);
	}
	ptr32 a0_222;
	Eq_2 s4_226;
	word32 a1_566;
	word32 a3_567;
	word32 s2_568;
	word32 s7_569;
	word32 s8_570;
	word32 s1_565;
	Eq_2 s0_225;
	ptr32 s5_230;
	ptr32 s6_235;
	ptr32 a5_232;
	ptr32 a7_238;
	Eq_2 s3_240;
	mbedtls_cipher_update(ra_204, s0_117, s1_127, 0x10, (word32) s0_117 + 336, fp + -0x0044, a5_163, a5, s5_138, s7_18, dwLoc18, dwArg28, s5, dwArg68, dwArg94, dwArgB0, dwArgB4, dwArgD8, out s0_225, out s1_565, out a0_222, out a1_566, out a3_567, out a5_232, out a7_238, out s2_568, out s3_240, out s4_226, out s5_230, out s6_235, out s7_569, out s8_570);
	ptr32 s2_247 = a0_222;
	if (a0_222 == 0x00)
	{
		*((word32) s0_225 + 328) = s3_240;
		*((word32) s0_225 + 332) = 0x00;
		s5_230 = 0x10;
		for (; s3_240 != 0x00; s3_240 -= s1_286)
		{
			Eq_2 s1_252 = s3_240;
			if (s3_240 > 0x10)
				s1_252.u0 = 0x10;
			Eq_2 a4_257 = s4_226;
			Eq_2 a5_258 = 0x00;
			do
			{
				a4_257 = (word32) a4_257 + 1;
				*((word32) a4_257 + 0x0FFF) = (byte) ((word32) *((word32) a5_258 + s6_235) ^ (word32) (*a4_257));
				a5_258 = (word32) a5_258 + 1;
			} while (s1_252 != a5_258);
			Eq_548726 s1_286;
			word32 a1_571;
			s0_225 = gcm_mult(s1_252, s0_225, s4_226, s4_226, a5_258, out s1_286, out a1_571, out a5_232, out a7_238, out s2_247);
			s6_235 = (word32) s1_286 + s6_235;
		}
	}
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = s2_247;
	a5Out = a5_232;
	a7Out = a7_238;
	s2Out = s2_247;
	s3Out = s3_240;
	s4Out = dwArg0168;
	s5Out = s5_230;
	s6Out = s6_235;
	return dwLoc08;
}

// 230961AE: Register Eq_2 mbedtls_gcm_update(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_cipher_update
//      mbedtls_cipher_auth_encrypt
Eq_2 mbedtls_gcm_update(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out)
{
	ptr32 a0_125;
	Eq_2 a5_129;
	Eq_2 s2_120;
	Eq_2 s0_193 = a0;
	Eq_2 s1_204 = a1;
	Eq_2 s6_117 = a2;
	Eq_2 s7_118 = a3;
	if (a2 < a3)
	{
		a5_129 = a3 - a2;
		a0_125 = ~0x13;
		s2_120 = s2;
		if (a5_129 < a1)
			goto l23096222;
	}
	Eq_2 a2_37 = *((word32) a0 + 320);
	word32 a4_40 = a1 + a2_37;
	Eq_2 a3_38 = *((word32) a0 + 0x0144);
	a5_129 = (word32) a3_38 + (word32) (a4_40 < a1);
	if (a5_129 >= a3_38 && (a3_38 != a5_129 || a4_40 >= a2_37) && (a5_129 <= 0x0F && (a5_129 != 0x0F || a4_40 <= ~0x1F)))
	{
		*((word32) a0 + 320) = a4_40;
		*((word32) a0 + 0x0144) = a5_129;
		s2_120.u0 = 0x10;
		s3 = (word32) a0 + 363;
		Eq_2 s4_122 = (word32) a0 + 352;
		s5.u0 = 0x01;
		while (s1_204 != 0x00)
		{
			Eq_2 a4_64 = (word32) s0_193 + 367;
			do
			{
				ui32 a5_69 = (word32) *a4_64 + 0x01 & 0x00FF;
				*a4_64 = (byte) a5_69;
				if (a5_69 != 0x00)
					break;
				a4_64 = (word32) a4_64 - 1;
			} while (a4_64 != s3);
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg120 = <invalid>;
			Eq_2 stackArg152 = <invalid>;
			Eq_2 stackArg184 = <invalid>;
			Eq_2 stackArg228 = <invalid>;
			Eq_2 stackArg256 = <invalid>;
			Eq_2 stackArg260 = <invalid>;
			Eq_2 stackArg296 = <invalid>;
			Eq_2 s0_115;
			Eq_2 s1_116;
			int32 s8_124;
			word32 a3_507;
			ra = mbedtls_cipher_update(ra, s0_193, s4_122, 0x10, fp + -64, fp + -0x0044, a5, s3, s5, s7_118, stackArg56, stackArg120, stackArg152, stackArg184, stackArg228, stackArg256, stackArg260, stackArg296, out s0_115, out s1_116, out a0_125, out a1, out a3_507, out a5_129, out a7, out s2_120, out s3, out s4_122, out s5, out s6_117, out s7_118, out s8_124);
			if (a0_125 != 0x00)
				goto l23096222;
			Eq_2 a5_134 = (word32) s0_115 + 368;
			int32 a4_135 = 0x00;
			do
			{
				byte * a1_142 = (word32) s6_117 + a4_135;
				if (*((word32) s0_115 + 384) == 0x00)
					*a5_134 = (byte) ((word32) *a1_142 ^ (word32) (*a5_134));
				ui32 a3_157 = (word32) (fp + -64 + a4_135) ^ (word32) (*a1_142);
				*((word32) s7_118 + a4_135) = (byte) a3_157;
				if (*((word32) s0_115 + 384) == s5)
					*a5_134 = (byte) (a3_157 ^ (word32) (*a5_134));
				++a4_135;
				a5_134 = (word32) a5_134 + 1;
			} while (s8_124 != a4_135);
			word32 s1_194;
			s0_193 = gcm_mult(s1_116, s0_115, (word32) s0_115 + 368, (word32) s0_115 + 368, a5_134, out s1_194, out a1, out a5_129, out a7, out s2_120);
			s1_204 = s1_194 - s8_124;
			s6_117 = (word32) s6_117 + s8_124;
			s7_118 = (word32) s7_118 + s8_124;
		}
		a0_125 = 0x00;
	}
	else
	{
		a0_125 = ~0x13;
		s2_120 = s2;
	}
l23096222:
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = a0_125;
	a1Out = a1;
	a3Out = s2;
	a5Out = a5_129;
	a7Out = a7;
	s2Out = s2_120;
	s3Out = s3;
	s4Out = dwArg0168;
	s5Out = s5;
	s6Out = s6_117;
	s7Out = s7_118;
	s8Out = dwArg0148;
	return dwLoc08;
}

// 230962D2: Register Eq_2 mbedtls_gcm_finish(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out (ptr32 byte) s1Out, Register out ptr32 a0Out, Register out Eq_548972 a5Out, Register out Eq_548973 s2Out, Register out Eq_548974 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      mbedtls_gcm_crypt_and_tag
Eq_2 mbedtls_gcm_finish(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg0198, ptr32 & s0Out, byte & s1Out, ptr32 & a0Out, union Eq_548972 & a5Out, union Eq_548973 & s2Out, union Eq_548974 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	ptr32 a0_159;
	Eq_2 s5_100 = *((word32) a0 + 320);
	Eq_548983 s7_27 = *((word32) a0 + 328);
	byte * s1_136 = *((word32) a0 + 0x0144) << 3 | s5_100 >> 0x1D;
	Eq_548973 s2_137 = s7_27 >> 0x1D | *((word32) a0 + 332) << 3;
	Eq_548972 a5_156 = 0x0C;
	if (a2 <= ~0x0F)
	{
		word32 a1_321;
		word32 a2_322;
		word32 a3_323;
		word32 a4_324;
		word32 a6_326;
		word32 a5_325;
		word32 a7_327;
		memcpy(a1, (word32) a0 + 336, a2, out a1_321, out a2_322, out a3_323, out a4_324, out a5_325, out a6_326, out a7_327);
		s6 = a2;
		s3 = s5_100 << 0x03;
		a5_156 = s5_100 << 0x03 | s7_27 << 0x03 | (s1_136 | s2_137);
		if (a5_156 != 0x00)
		{
			word32 t1_328;
			word32 a0_329;
			word32 a1_330;
			word32 a2_331;
			word32 a3_332;
			word32 a4_333;
			word32 a5_334;
			ra = memset(ra, fp + -64, 0x00, 0x10, out t1_328, out a0_329, out a1_330, out a2_331, out a3_332, out a4_333, out a5_334);
			s5_100 <<= 11;
			s3 = s5_100 << 11 | (s5_100 << 0x13) >> 0x18;
			Eq_2 a5_110 = fp + -64;
			struct Eq_549074 * a4_112 = (word32) a0 + 368;
			do
			{
				++a4_112;
				a4_112[0x0FFF] = (struct Eq_549074) (byte) ((word32) a4_112->b0000 ^ (word32) (*a5_110));
				a5_110 = (word32) a5_110 + 1;
			} while (a4_112 != (word32) a0 + 384);
			word32 a1_335;
			word32 a5_336;
			word32 a7_337;
			Eq_2 s0_135 = gcm_mult((word32) a0 + 368, a0, (word32) a0 + 368, (word32) a0 + 368, a5_110, out s1_136, out a1_335, out a5_336, out a7_337, out s2_137);
			Eq_2 a1_146 = s0_135;
			s6 = a2 + s0_135;
			do
			{
				a1_146 = (word32) a1_146 + 1;
				a5_156 = (word32) *a1_146 ^ (word32) (*s1_136);
				*((word32) a1_146 + 0x0FFF) = (byte) a5_156;
				++s1_136;
			} while (s6 != a1_146);
		}
		a0_159 = 0x00;
	}
	else
		a0_159 = ~0x13;
	0x00 = (int8) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_136;
	a0Out = a0_159;
	a5Out = a5_156;
	s2Out = s2_137;
	s3Out = s3;
	s4Out = dwArgF4;
	s5Out = s5_100;
	s6Out = s6;
	return ra;
}

// 23096428: Register Eq_2 mbedtls_gcm_crypt_and_tag(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a6, Register Eq_2 s5, Stack Eq_2 dwArg38, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      mbedtls_cipher_auth_encrypt
//      mbedtls_gcm_auth_decrypt
Eq_2 mbedtls_gcm_crypt_and_tag(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a6, Eq_2 s5, Eq_2 dwArg38, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArg0128, Eq_2 dwArg0198, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 a7_41;
	Eq_2 s0_43;
	ptr32 a0_160;
	ptr32 a5_169;
	Eq_2 s1_178;
	Eq_2 s2_180;
	Eq_2 s3_182;
	Eq_2 s4_184;
	ptr32 s5_186;
	ptr32 s6_188;
	Eq_2 ra_175 = mbedtls_gcm_starts(ra, a0, a1, a3, a4, a6, s5, dwLoc08, dwArg38, ra, dwArg80, dwArg84, dwArgA8, out s0_43, out s1_178, out a0_160, out a5_169, out a7_41, out s2_180, out s3_182, out s4_184, out s5_186, out s6_188);
	if (a0_160 == 0x00)
	{
		Eq_2 s0_74;
		word32 a1_216;
		word32 a3_217;
		word32 a7_218;
		word32 s7_219;
		word32 s8_220;
		ra_175 = mbedtls_gcm_update(s0_43, s3_182, a7_41, s4_184, out s0_74, out s1_178, out a0_160, out a1_216, out a3_217, out a5_169, out a7_218, out s2_180, out s3_182, out s4_184, out s5_186, out s6_188, out s7_219, out s8_220);
		if (a0_160 == 0x00)
		{
			0x00 = (int8) dwArg0128;
			ptr32 a0_109;
			ptr32 a5_112;
			ptr32 s0_114;
			Eq_2 s1_115;
			Eq_2 s2_116;
			Eq_2 s4_117;
			ptr32 s5_118;
			Eq_2 s3_126;
			ptr32 s6_127;
			Eq_2 ra_125 = mbedtls_gcm_finish(ra_175, s0_74, s1_178, s2_180, dwArg0198, out s0_114, out s1_115, out a0_109, out a5_112, out s2_116, out s3_126, out s4_117, out s5_118, out s6_127);
			s0Out = s0_114;
			s1Out = s1_115;
			a0Out = a0_109;
			a5Out = a5_112;
			s2Out = s2_116;
			s3Out = s3_126;
			s4Out = s4_117;
			s5Out = s5_118;
			s6Out = s6_127;
			return ra_125;
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_178;
	a0Out = a0_160;
	a5Out = a5_169;
	s2Out = s2_180;
	s3Out = s3_182;
	s4Out = s4_184;
	s5Out = s5_186;
	s6Out = s6_188;
	return ra_175;
}

// 23096488: Register Eq_2 mbedtls_gcm_auth_decrypt(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 a7, Register Eq_2 s5, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out (ptr32 byte) s1Out, Register out Eq_537558 a0Out, Register out Eq_537559 s2Out, Register out (ptr32 (arr byte)) s3Out)
// Called from:
//      mbedtls_cipher_auth_decrypt
Eq_2 mbedtls_gcm_auth_decrypt(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 a7, Eq_2 s5, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArgE8, Eq_2 dwArg0158, union Eq_2 & s0Out, byte & s1Out, union Eq_537558 & a0Out, union Eq_537559 & s2Out, byte (& s3Out)
{
	Eq_537559 s2_50;
	byte (* s3_51)[];
	ptr32 s4_52;
	word32 s5_197;
	word32 s6_198;
	word32 a5_196;
	byte * s0_48;
	Eq_537558 a0_138;
	byte * s1_156;
	Eq_2 ra_47 = mbedtls_gcm_crypt_and_tag(dwLoc18, a0, 0x00, a2, a3, a5, s5, dwLoc08, a7, dwArg44, dwArg68, dwArgE8, dwArg0158, out s0_48, out s1_156, out a0_138, out a5_196, out s2_50, out s3_51, out s4_52, out s5_197, out s6_198);
	Eq_537559 a5_65 = 0x00;
	if (a0_138 == 0x00)
	{
		while (a5_65 != s2_50)
		{
			a5_65 = (word32) a5_65.u0 + 1;
			a0_138 |= CONVERT(Mem36[s4_52 + a5_65:byte], byte, word32) ^ CONVERT(Mem36[s3_51 + a5_65:byte], byte, word32);
		}
		s1_156 += s0_48;
		if (a0_138 != 0x00)
		{
			for (; s0_48 != s1_156; ++s0_48)
				*s0_48 = 0x00;
			a0_138.u0 = ~0x11;
		}
	}
	s0Out = dwArg0158;
	s1Out = s1_156;
	a0Out = a0_138;
	s2Out = s2_50;
	s3Out = s3_51;
	return ra_47;
}

// 230964FC: Register Eq_2 mbedtls_gcm_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5)
// Called from:
//      gcm_ctx_free
Eq_2 mbedtls_gcm_free(Eq_2 ra, Eq_2 a0, Eq_2 a5)
{
	word32 a5_30;
	mbedtls_cipher_free(ra, a0, a5, out a5_30);
	Eq_2 s0_15 = a0;
	while (s0_15 != (word32) a0 + 0x0188)
	{
		*s0_15 = 0x00;
		s0_15 = (word32) s0_15 + 1;
	}
	return (word32) a0 + 0x0188;
}

// 23096520: Register Eq_2 mbedtls_md_info_from_type(Register Eq_2 a0, Register out Eq_493633 a5Out)
// Called from:
//      mbedtls_pk_sign
//      mbedtls_pk_verify_ext
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
Eq_2 mbedtls_md_info_from_type(Eq_2 a0, union Eq_493633 & a5Out)
{
	uint32 a0_5 = (word32) a0 - 3 & 0x00FF;
	if (a0_5 > 0x03)
	{
		a5Out.u0 = 0x03;
		return 0x00;
	}
	else
	{
		Eq_2 a0_13 = *((char *) g_a230C8C00 + a0_5 * 0x04);
		a5Out.u0 = 0x230C8C00;
		return a0_13;
	}
}

// 23096540: Register Eq_2 mbedtls_md_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      tls_prf_sha256
//      mbedtls_ssl_setup
Eq_2 mbedtls_md_init(Eq_2 ra, Eq_2 a0, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 a5_12;
	word32 t1_19;
	word32 a0_20;
	word32 a1_21;
	word32 a2_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 0x0C, out t1_19, out a0_20, out a1_21, out a2_22, out a3_10, out a4_11, out a5_12);
	a3Out = a3_10;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

