pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23096548: Register Eq_2 mbedtls_md_free(Register Eq_2 ra, Register Eq_499487 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      tls_prf_sha256
//      mbedtls_ssl_transform_free
Eq_2 mbedtls_md_free(Eq_2 ra, Eq_499487 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a5Out = a5;
		return a2;
	}
	else
	{
		struct Eq_549310 * sp_14 = fp + ~0x0F;
		struct Eq_549314 * a0_10 = *a5;
		if (a5 != 0x00)
		{
			Eq_2 a0_12 = a0_10->t0004;
			if (a0_12 != 0x00)
			{
				<anonymous> * a5_13 = *((word32) a5 + 36);
				word32 t3_82;
				word32 s4_81;
				word32 a1_79;
				word32 a6_80;
				word32 tp_78;
				word32 s1_77;
				word32 a3_76;
				a5_13();
			}
			Eq_2 s0_23 = *((word32) a5 + 8);
			if (a5 != 0x00)
			{
				Eq_2 a4_29 = (word32) a5 + (*((word32) a4 + 0x0C) << 1);
				while (a5 != a4_29)
				{
					*a5 = 0x00;
					a5 = (word32) a5 + 1;
				}
				word32 t3_169;
				word32 s1_160;
				word32 a0_161;
				word32 a2_163;
				word32 a1_162;
				word32 s4_168;
				word32 a6_167;
				word32 a5_166;
				word32 a4_165;
				word32 a3_164;
				vPortFree(a0_12, a2, a5, mstatus, sp_14->t0158, sp_14->t0198, out s0_23, out s1_160, out a0_161, out a1_162, out a2_163, out a3_164, out a4_165, out a5_166, out a6_167, out s4_168, out t3_169);
			}
			a5 = (word32) s0_23 + 0x0C;
			while (s0_23 != a5)
			{
				*s0_23 = 0x00;
				s0_23 = (word32) s0_23 + 1;
			}
		}
		a5Out = a5;
		return dwArg10;
	}
}

// 23096596: Register Eq_2 mbedtls_md_setup(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_499358 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
Eq_2 mbedtls_md_setup(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_499358 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	if (a1 == 0x00 || a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x050000FF;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
	ptr32 a0_105;
	word32 a1_17 = *((word32) a5 + 32);
	Eq_2 a1_23;
	struct Eq_549410 * a0_24;
	word32 tp_31;
	word32 a6_97;
	word32 t0_101;
	word32 t1_102;
	word32 t3_103;
	Eq_2 s0_25;
	Eq_2 a5_125;
	Eq_2 ra_141;
	Eq_2 s1_148;
	Eq_2 s2_152;
	ptr32 s3_158;
	ptr32 s4_164;
	ptr32 s8_100;
	a5();
	a0_24->t0004 = s0_25;
	if (a0_24 == null)
	{
l230965C8:
		a0_105 = ~0x0500017F;
		goto l230965D4;
	}
	else
	{
		if (s2_152 != 0x00)
		{
			word32 a1_38;
			word32 a2_225;
			ra_141 = mycalloc(ra_141, *((word32) a1_23 + 0x0C), 0x02, a1_23, a3, a4, a5_125, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_25, out s1_148, out a1_38, out a2_225, out a3, out a4, out a5_125, out s2_152, out s3_158, out s4_164, out s8_100);
			*(union Eq_2 *) 0x0A = s0_25;
			if (false)
			{
				a5_125();
				goto l230965C8;
			}
		}
		*s1_148 = s0_25;
		a0_105 = 0x00;
l230965D4:
		0x00 = (int8) dwArg38;
		s1Out = s1_148;
		a0Out = a0_105;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_125;
		s2Out = s2_152;
		s3Out = s3_158;
		s4Out = s4_164;
		s8Out = s8_100;
		mstatusOut = mstatus;
		return ra_141;
	}
}

// 230965E8: Register Eq_2 mbedtls_md_starts(Register Eq_2 ra, Register (ptr32 word32) a0, Register Eq_2 a5, Stack Eq_2 dwArg10, Register out Eq_2 a5Out)
// Called from:
//      mgf_mask
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
Eq_2 mbedtls_md_starts(Eq_2 ra, word32 * a0, Eq_2 a5, Eq_2 dwArg10, union Eq_2 & a5Out)
{
	if (a0 != null)
	{
		word32 a0_6 = *a5;
		if (a5 != 0x00)
		{
			<anonymous> * a5_13 = *((word32) a5 + 16);
			Eq_2 a5_16;
			Eq_2 ra_17;
			a5_13();
			a5Out = a5_16;
			return ra_17;
		}
	}
	a5Out = a5;
	return ra;
}

// 23096608: Register word32 mbedtls_md_update(Register word32 ra, Register (ptr32 word32) a0, Register (ptr32 Eq_496878) a5, Stack Eq_2 dwArg10, Register out (ptr32 Eq_496878) a5Out)
// Called from:
//      mgf_mask
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
word32 mbedtls_md_update(word32 ra, word32 * a0, struct Eq_496878 * a5, Eq_2 dwArg10, struct Eq_496878 & a5Out)
{
	if (a0 != null)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * a5_13 = a5->ptr0014;
			struct Eq_496878 * a5_16;
			word32 ra_17;
			a5_13();
			a5Out = a5_16;
			return ra_17;
		}
	}
	a5Out = a5;
	return ra;
}

// 23096628: Register word32 mbedtls_md_finish(Register word32 ra, Register (ptr32 word32) a0, Register (ptr32 Eq_496880) a5, Stack Eq_2 dwArg10, Register out Eq_2 a2Out, Register out (ptr32 Eq_496880) a5Out)
// Called from:
//      mgf_mask
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
word32 mbedtls_md_finish(word32 ra, word32 * a0, struct Eq_496880 * a5, Eq_2 dwArg10, union Eq_2 & a2Out, struct Eq_496880 & a5Out)
{
	if (a0 != null)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * a5_13 = a5->ptr0018;
			struct Eq_496880 * a5_16;
			word32 ra_17;
			a5_13();
			a2Out = dwArg10;
			a5Out = a5_16;
			return ra_17;
		}
	}
	a2Out = a2;
	a5Out = a5;
	return ra;
}

// 23096648: Register Eq_2 mbedtls_md(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 a3, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
Eq_2 mbedtls_md(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 a3, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a5Out = a0;
		return ra;
	}
	else
	{
		Eq_2 a5_19;
		Eq_2 ra_20;
		Eq_2 a1_21;
		(*((word32) a0 + 28))();
		a1Out = a1_21;
		a5Out = a5_19;
		return ra_20;
	}
}

