pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309666A: Register Eq_2 mbedtls_md_hmac_starts(Register Eq_2 ra, Register Eq_505534 a0, Register (ptr32 Eq_505346) a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_505453 s4, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_505453 s4Out, Register out ptr32 s8Out)
// Called from:
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
Eq_2 mbedtls_md_hmac_starts(Eq_2 ra, Eq_505534 a0, struct Eq_505346 * a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_505453 s4, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_505453 & s4Out, ptr32 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a2Out = a2;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
	struct Eq_549516 * sp_145 = fp + -64;
	word32 a0_20 = *a5;
	if (a5 != 0x00)
	{
		word32 a0_23 = *((word32) a4 + 8);
		if (a4 != 0x00)
		{
			struct Eq_549532 * a5_26 = *((word32) a4 + 0x0C);
			struct Eq_505346 * s1_221 = a1;
			Eq_2 s3_220 = a2;
			if (a4 < a2)
			{
				<anonymous> * a5_31 = a5_26->ptr0010;
				word32 sp_33;
				word32 a0_34;
				word32 ra_36;
				word32 s1_37;
				word32 s2_38;
				word32 s3_39;
				word32 s4_40;
				struct Eq_549596 * a5_41;
				word32 a4_42;
				a5_31();
				<anonymous> * a5_52 = a5_41->ptr0014;
				word32 sp_55;
				word32 a0_56;
				word32 ra_58;
				word32 s1_59;
				word32 s2_60;
				word32 s3_61;
				word32 s4_62;
				struct Eq_549609 * a5_63;
				word32 a4_64;
				word32 a2_66;
				a5_52();
				<anonymous> * a5_74 = a5_63->ptr0018;
				word32 t3_87;
				word32 s8_88;
				word32 a6_89;
				word32 a3_90;
				word32 t1_233;
				word32 t0_232;
				a5_74();
				s3_220 = a5_26->t0008;
			}
			Eq_2 s2_96 = a5_26->ptr0000->t0008;
			word32 s4_101 = s2_96 + a2;
			Eq_2 a2_105;
			word32 a0_116;
			word32 t1_330;
			word32 a4_332;
			word32 a5_333;
			word32 a3_331;
			word32 a0_325;
			word32 a3_327;
			word32 a4_328;
			word32 a5_329;
			word32 a1_326;
			word32 t1_324;
			word32 a1_117;
			word32 a2_118;
			Eq_2 ra_122 = memset(memset(ra, s2_96, 54, a2, out t1_324, out a0_325, out a1_326, out a2_105, out a3_327, out a4_328, out a5_329), s4_101, 92, a2_105, out t1_330, out a0_116, out a1_117, out a2_118, out a3_331, out a4_332, out a5_333);
			Eq_2 a5_125 = 0x00;
			while (s3_220 != a5_125)
			{
				word32 a2_131 = s1_221 + a5_125;
				word32 a3_129 = s2_96 + a5_125;
				a1_117 = (word32) *a2_131;
				*a3_129 = (byte) ((word32) *a3_129 ^ a1_117);
				word32 a3_138 = s4_101 + a5_125;
				a2_118 = (word32) *a2_131;
				*a3_138 = (byte) ((word32) *a3_138 ^ a2_118);
				a5_125 = (word32) a5_125 + 1;
			}
			struct Eq_549516 * a5_146 = sp_145;
			do
			{
				a5_146->b0000 = 0x00;
				struct Eq_549516 * a4_150 = sp_145 + 32;
				++a5_146;
			} while (a5_146 != a4_150);
			<anonymous> * a5_156 = a5_146[16];
			word32 a0_168;
			word32 ra_170;
			word32 s1_171;
			word32 s2_172;
			word32 s3_173;
			word32 s4_174;
			<anonymous> * a4_176;
			word32 a2_178;
			a5_156();
			word32 t3_202;
			word32 s8_203;
			word32 a6_204;
			word32 a3_205;
			word32 t0_206;
			word32 t1_207;
			a4_176();
l23096700:
			s0Out = dwArg0158;
			s1Out = s1;
			a2Out = dwArg0138;
			a4Out = a4;
			a5Out = a5;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArgF4;
			s8Out = dwArgD4;
			return ra;
		}
	}
	goto l23096700;
}

// 2309674C: Register Eq_2 mbedtls_md_hmac_update(Register Eq_2 ra, Register Eq_505524 a0, Register (ptr32 Eq_505483) a4, Register Eq_2 a5, Stack Eq_2 dwArg10, Register out ptr32 a0Out, Register out (ptr32 Eq_505483) a4Out, Register out Eq_2 a5Out)
// Called from:
//      tls_prf_sha256
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_md_hmac_update(Eq_2 ra, Eq_505524 a0, struct Eq_505483 * a4, Eq_2 a5, Eq_2 dwArg10, ptr32 & a0Out, struct Eq_505483 & a4Out, union Eq_2 & a5Out)
{
	if (a0 != 0x00 && a5 != 0x00)
	{
		word32 a0_8 = a4->dw0008;
		if (a4 != null)
		{
			<anonymous> * a5_15 = *((word32) a5 + 20);
			Eq_2 a5_18;
			struct Eq_505483 * a4_19;
			Eq_2 ra_20;
			a5_15();
			a0Out = 0x00;
			a4Out = a4_19;
			a5Out = a5_18;
			return ra_20;
		}
	}
	a0Out = ~0x050000FF;
	a4Out = a4;
	a5Out = a5;
	return ra;
}

// 23096770: Register Eq_2 mbedtls_md_hmac_finish(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_505506 a0, Register Eq_505507 a1, Register ptr32 a4, Register (ptr32 Eq_505489) a5, Register Eq_2 s2, Stack ptr32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_505507 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out (ptr32 Eq_505489) a5Out, Register out Eq_2 s2Out)
// Called from:
//      tls_prf_sha256
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_md_hmac_finish(Eq_2 ra, word32 s0, Eq_2 s1, Eq_505506 a0, Eq_505507 a1, ptr32 a4, struct Eq_505489 * a5, Eq_2 s2, ptr32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_505507 & a1Out, ptr32 & a2Out, ptr32 & a4Out, struct Eq_505489 & a5Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00 && a4 != 0x00)
	{
		word32 a0_8 = a5->dw0008;
		if (a5 != null)
		{
			word32 a0_29;
			word32 a4_30;
			struct Eq_549726 * a5_31;
			word32 ra_32;
			word32 s2_34;
			word32 s1_35;
			word32 a1_36;
			a5();
			<anonymous> * a5_41 = a5_31->ptr0010;
			word32 a0_43;
			<anonymous> * a4_44;
			word32 ra_46;
			word32 s2_48;
			word32 s1_49;
			word32 a2_51;
			a5_41();
			word32 sp_58;
			word32 a0_59;
			<anonymous> * a4_60;
			word32 ra_62;
			word32 s2_64;
			word32 s1_65;
			word32 a2_67;
			a4_44();
			word32 a0_75;
			word32 a4_76;
			struct Eq_549750 * a5_77;
			word32 ra_78;
			word32 s2_80;
			word32 s1_81;
			a4_60();
			<anonymous> * a5_88 = a5_77->ptr0018;
			ptr32 a4_91;
			struct Eq_505489 * a5_92;
			Eq_2 ra_93;
			Eq_2 s2_95;
			Eq_2 s1_96;
			Eq_505507 a1_97;
			a5_88();
			0x00 = (int8) dwArg0128;
			s1Out = s1_96;
			a0Out = 0x00;
			a1Out = a1_97;
			a2Out = dwArg0100;
			a4Out = a4_91;
			a5Out = a5_92;
			s2Out = s2_95;
			return ra_93;
		}
	}
	s1Out = s1;
	a0Out = ~0x050000FF;
	a1Out = a1;
	a2Out = a2;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	return ra;
}

// 230967D4: Register Eq_2 mbedtls_md_hmac_reset(Register Eq_2 ra, Register Eq_505612 a0, Register (ptr32 Eq_505499) a1, Register Eq_2 a5, Register out ptr32 s0Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      tls_prf_sha256
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_md_hmac_reset(Eq_2 ra, Eq_505612 a0, struct Eq_505499 * a1, Eq_2 a5, ptr32 & s0Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00 || a5 == 0x00)
	{
		s0Out = s0;
		a4Out = a4;
		a5Out = a5;
		return ra;
	}
	else
	{
		word32 a0_15 = a1->dw0008;
		if (a1 != null)
		{
			<anonymous> * a5_20 = *((word32) a5 + 16);
			struct Eq_549782 * sp_22;
			word32 a0_23;
			word32 ra_25;
			word32 a1_27;
			<anonymous> * a4_29;
			a5_20();
			word32 a2_34 = sp_22->dw0064;
			word32 a2_43;
			word32 t3_45;
			word32 s8_46;
			a4_29();
		}
		s0Out = s0;
		a4Out = a4;
		a5Out = a5;
		return ra;
	}
}

// 23096814: Register Eq_2 mbedtls_md_process(Register Eq_2 ra, Register word32 a0, Register (ptr32 Eq_517765) a5, Stack Eq_2 dwArg10, Register out ptr32 a0Out, Register out (ptr32 Eq_517765) a5Out)
// Called from:
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_md_process(Eq_2 ra, word32 a0, struct Eq_517765 * a5, Eq_2 dwArg10, ptr32 & a0Out, struct Eq_517765 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * a5_13 = a5->ptr002C;
			struct Eq_517765 * a5_16;
			Eq_2 ra_17;
			a5_13();
			a0Out = 0x00;
			a5Out = a5_16;
			return ra_17;
		}
	}
	a0Out = ~0x050000FF;
	a5Out = a5;
	return ra;
}

// 23096834: Register Eq_2 mbedtls_md_get_size(Register Eq_2 a0)
// Called from:
//      mbedtls_pk_sign
//      mbedtls_pk_verify_ext
//      mgf_mask
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
Eq_2 mbedtls_md_get_size(Eq_2 a0)
{
	if (a0 == 0x00)
		return 0x00;
	return (word32) *((word32) a0 + 8);
}

