pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 230968FC: void sha224_ctx_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void sha224_ctx_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 s2_79;
	word32 a5_78;
	word32 a4_77;
	word32 a3_76;
	word32 a2_75;
	word32 a1_74;
	word32 s1_73;
	word32 s0_72;
	word32 s3_80;
	word32 s4_81;
	word32 s8_82;
	Eq_2 ra_21 = mycalloc(ra, s1, 0x01, 116, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_72, out s1_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s4_81, out s8_82);
	if (true)
	{
		word32 t1_83;
		word32 a3_84;
		word32 a4_85;
		word32 a5_86;
		mbedtls_sha256_init(ra_21, 0x01, out t1_83, out a3_84, out a4_85, out a5_86);
	}
}

// 2309691E: void sha224_wrap(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_502550 a7, Register Eq_2 s2, Stack word32 dwArg08)
void sha224_wrap(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_502550 a7, Eq_2 s2, word32 dwArg08)
{
	mbedtls_sha256(ra, a0, a1, a7, s2, dwArg08);
}

// 23096924: void sha256_wrap(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_502550 a7, Register Eq_2 s2, Stack word32 dwArg08)
void sha256_wrap(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_502550 a7, Eq_2 s2, word32 dwArg08)
{
	mbedtls_sha256(ra, a0, a1, a7, s2, dwArg08);
}

// 2309692A: void sha224_finish_wrap(Register uint32 t1, Register uint32 a2, Register ui32 a5, Register Eq_502550 a7, Stack Eq_2 dwArg28, Stack word32 dwArg88)
void sha224_finish_wrap(uint32 t1, uint32 a2, ui32 a5, Eq_502550 a7, Eq_2 dwArg28, word32 dwArg88)
{
	word32 s1_34;
	word32 a5_35;
	word32 s2_36;
	word32 s3_37;
	word32 s4_38;
	word32 s5_39;
	mbedtls_sha256_finish(t1, a2, a5, a7, dwArg28, dwArg88, out s1_34, out a5_35, out s2_36, out s3_37, out s4_38, out s5_39);
}

// 2309692E: void sha224_update_wrap(Register uint32 t1, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_493410) a3, Register (ptr32 word32) a5, Register Eq_502550 a7, Stack Eq_2 dwArg48, Stack word32 dwArgA8)
void sha224_update_wrap(uint32 t1, Eq_2 a1, Eq_2 a2, struct Eq_493410 * a3, word32 * a5, Eq_502550 a7, Eq_2 dwArg48, word32 dwArgA8)
{
	word32 a2_36;
	word32 a3_37;
	word32 a5_38;
	word32 a7_39;
	mbedtls_sha256_update(t1, a1, a2, a3, a5, a7, dwArg48, dwArgA8, out a2_36, out a3_37, out a5_38, out a7_39);
}

// 23096932: void sha224_starts_wrap(Register Eq_2 a0)
void sha224_starts_wrap(Eq_2 a0)
{
	mbedtls_sha256_starts(a0, (struct Eq_493410 *) 0x01);
}

// 23096938: void sha256_starts_wrap(Register Eq_2 a0)
void sha256_starts_wrap(Eq_2 a0)
{
	mbedtls_sha256_starts(a0, null);
}

// 2309693E: Register Eq_2 oid_sig_alg_from_asn1.part.0(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_oid_get_sig_alg_desc
//      mbedtls_oid_get_sig_alg
Eq_2 oid_sig_alg_from_asn1.part.0(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	Eq_2 s1_12 = a0;
	while (true)
	{
		ptr32 s0_20;
		if (a0 == 0x00)
			break;
		s1_12 = *((word32) a5 + 4);
		s0_20 = (ptr32) *((word32) a2 + 4);
		if (a2 == a5)
		{
			s1_12 = *((word32) a1 + 8);
			word32 a3_80;
			word32 a4_81;
			a0 = memcmp(a0, a1, a2, out a1, out a2, out a3_80, out a4_81, out a5);
			if (a0 == 0x00)
				goto l2309696C;
		}
	}
	s0_20 = 0x00;
l2309696C:
	a0Out = s0_20;
	a1Out = a1;
	a5Out = a5;
	return s1_12;
}

// 23096978: Register Eq_2 mbedtls_oid_get_attr_short_name(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out)
// Called from:
//      mbedtls_x509_dn_gets
Eq_2 mbedtls_oid_get_attr_short_name(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				word32 a3_103;
				word32 a4_104;
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3_103, out a4_104, out a5);
				if (a0 == 0x00)
				{
					*a1 = a5;
					goto l23096992;
				}
			}
		}
		a0.u0 = -46;
l23096992:
		0x00 = (int8) dwArg38;
		a0Out = a0;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		return s1;
	}
}

// 230969C6: Register Eq_2 mbedtls_oid_get_x509_ext_type(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_oid_get_x509_ext_type(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				word32 a3_106;
				word32 a4_107;
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3_106, out a4_107, out a5);
				if (a0 == 0x00)
				{
					*a1 = a5;
					goto l230969E0;
				}
			}
		}
		a0.u0 = -46;
l230969E0:
		0x00 = (int8) dwArg38;
		a0Out = a0;
		a1Out = a1_25;
		a5Out = a5;
		s2Out = a1;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		a1Out = a1;
		a5Out = a5;
		s2Out = s2;
		return s1;
	}
}

// 23096A14: Register Eq_2 mbedtls_oid_get_extended_key_usage(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_oid_get_extended_key_usage(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				word32 a3_103;
				word32 a4_104;
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3_103, out a4_104, out a5);
				if (a0 == 0x00)
				{
					*a1 = a5;
					goto l23096A2E;
				}
			}
		}
		a0.u0 = -46;
l23096A2E:
		0x00 = (int8) dwArg38;
		a0Out = a0;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		return s1;
	}
}

