pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23096A62: Register (ptr32 byte) mbedtls_oid_get_sig_alg_desc(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_550452 a0Out)
// Called from:
//      mbedtls_x509_sig_alg_gets
byte * mbedtls_oid_get_sig_alg_desc(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_550452 & a0Out)
{
	if (a0 != 0x00)
	{
		Eq_550452 a0_21;
		word32 a0_13;
		union Eq_2 * a5_18;
		word32 a1_58;
		byte * s1_19 = oid_sig_alg_from_asn1.part.0(a0, a1, a2, a5, out a0_13, out a1_58, out a5_18);
		if (a0_13 != 0x00)
		{
			*a5_18 = (union Eq_2 *) a1;
			a0_21.u0 = 0x00;
		}
		else
			a0_21.u0 = -46;
		a0Out = a0_21;
		return s1_19;
	}
	else
	{
		a0Out.u0 = -46;
		return s1;
	}
}

// 23096A8C: Register (ptr32 byte) mbedtls_oid_get_sig_alg(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register out Eq_550479 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_get_sig_alg
byte * mbedtls_oid_get_sig_alg(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, union Eq_550479 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	if (a0 != 0x00)
	{
		Eq_550479 a0_24;
		struct Eq_550485 * a0_16;
		Eq_2 a1_17;
		Eq_2 a5_21;
		byte * s1_22 = oid_sig_alg_from_asn1.part.0(a0, a1, a2, a5, out a0_16, out a1_17, out a5_21);
		if (a0_16 != null)
		{
			*s1_22 = (byte) (word32) a0_16->b0010;
			a5_21 = (word32) a0_16->b0011;
			*a2 = (byte) a5_21;
			a0_24.u0 = 0x00;
		}
		else
			a0_24.u0 = -46;
		a0Out = a0_24;
		a1Out = a1_17;
		a5Out = a5_21;
		return s1_22;
	}
	else
	{
		a0Out.u0 = -46;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
}

// 23096AC8: Register Eq_2 mbedtls_oid_get_pk_alg(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      pk_get_pk_alg
Eq_2 mbedtls_oid_get_pk_alg(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			struct Eq_550529 * s0_24 = *((word32) a2 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3, out a4, out a5);
				if (a0 == 0x00)
				{
					a5 = (word32) s0_24->b0010;
					*a1 = (byte) a5;
					goto l23096AE2;
				}
			}
		}
		a0.u0 = -46;
l23096AE2:
		0x00 = (int8) dwArg38;
		a0Out = a0;
		a1Out = a1_25;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = a1;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		return s1;
	}
}

// 23096B18: Register Eq_2 mbedtls_oid_get_ec_grp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      pk_use_ecparams
Eq_2 mbedtls_oid_get_ec_grp(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			struct Eq_550570 * s0_24 = *((word32) a2 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3, out a4, out a5);
				if (a0 == 0x00)
				{
					a5 = (word32) s0_24->b0010;
					*a1 = (byte) a5;
					goto l23096B32;
				}
			}
		}
		a0.u0 = -46;
l23096B32:
		0x00 = (int8) dwArg38;
		a0Out = a0;
		a1Out = a1_25;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = a1;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		return s1;
	}
}

// 23096B68: Register Eq_2 mbedtls_oid_get_md_alg(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 s2Out)
// Called from:
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_oid_get_md_alg(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & s2Out)
{
	if (a0 != 0x00)
	{
		Eq_2 s1_16 = a0;
		a1_25 = a1;
		while (true)
		{
			Eq_2 a1_25;
			if (a0 == 0x00)
				break;
			s1_16 = *((word32) a5 + 4);
			struct Eq_550610 * s0_24 = *((word32) a2 + 4);
			if (a2 == a5)
			{
				s1_16 = *((word32) a1_25 + 8);
				word32 a3_104;
				word32 a4_105;
				a0 = memcmp(a0, a1_25, a2, out a1_25, out a2, out a3_104, out a4_105, out a5);
				if (a0 == 0x00)
				{
					*a1 = (byte) (word32) s0_24->b0010;
					goto l23096B82;
				}
			}
		}
		a0.u0 = -46;
l23096B82:
		0x00 = (int8) dwArg38;
		a0Out = a0;
		s2Out = a1;
		return s1_16;
	}
	else
	{
		a0Out.u0 = -46;
		s2Out = s2;
		return s1;
	}
}

// 23096BB8: Register Eq_2 mbedtls_oid_get_oid_by_md(Register Eq_2 a0, Register (ptr32 Eq_501048) a1, Register ptr32 a2, Register Eq_2 a4)
// Called from:
//      mbedtls_rsa_pkcs1_sign
Eq_2 mbedtls_oid_get_oid_by_md(Eq_2 a0, struct Eq_501048 * a1, ptr32 a2, Eq_2 a4)
{
	do
	{
		struct Eq_501048 * a5_7 = *a4;
		if (a4 == 0x00)
			return -46;
	} while ((word32) a5_7->b0010 != a0);
	*a4 = a1;
	*a5_7->ptr0004 = a2;
	return 0x00;
}

// 23096BE0: Register word32 pem_aes_decrypt(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 a5, Register out ptr32 a4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_pem_read_buffer
word32 pem_aes_decrypt(Eq_2 ra, Eq_2 a4, Eq_2 a5, ptr32 & a4Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 a1_535;
	word32 a1_532;
	word32 a5_534;
	word32 a4_533;
	Eq_2 ra_49 = mbedtls_md5_init(mbedtls_aes_init(ra, fp + -312, out a1_532, out a4_533, out a5_534), fp + -400, out a1_535);
	struct Eq_549817 ** a5_62;
	Eq_2 s2_69;
	word32 s3_536;
	word32 s4_537;
	mbedtls_md5_update(a4, a5, mbedtls_md5_starts(fp + -400), dwLoc01A4, dwLoc0178, dwLoc0118, dwLocFC, dwLoc98, out a5_62, out s2_69, out s3_536, out s4_537);
	word32 s1_127;
	word32 s4_541;
	word32 s3_540;
	word32 s2_539;
	word32 a5_538;
	ptr32 s5_133;
	Eq_2 s2_130;
	ui32 s6_134;
	mbedtls_md5_finish(mbedtls_md5_update(s2_69, 0x08, a5_62, dwLoc01A4, dwLoc0178, dwLoc0118, dwLocFC, dwLoc98, out a5_538, out s2_539, out s3_540, out s4_541), dwLoc0198, dwLoc0138, dwLoc011C, dwLocB8, out s1_127, out s2_130, out s5_133, out s6_134);
	struct Eq_526718 * s0_146 = fp + -432;
	if (s1_127 == 0x10)
	{
		word32 a7_562;
		word32 a2_557;
		word32 a3_558;
		word32 a6_561;
		word32 a4_559;
		word32 a5_560;
		word32 a1_556;
		memcpy(fp + -432, fp + -448, 0x10, out a1_556, out a2_557, out a3_558, out a4_559, out a5_560, out a6_561, out a7_562);
		mbedtls_md5_free(fp + -400);
		byte * a5_333 = fp + -448;
		do
		{
			*a5_333 = 0x00;
			++a5_333;
		} while (a5_333 != fp + -432);
	}
	else
	{
		word32 a6_547;
		word32 a7_548;
		word32 a5_546;
		word32 a4_545;
		word32 a1_542;
		word32 a3_544;
		word32 a2_543;
		memcpy(fp + -432, fp + -448, 0x10, out a1_542, out a2_543, out a3_544, out a4_545, out a5_546, out a6_547, out a7_548);
		struct Eq_549817 ** a5_174;
		Eq_2 s3_182;
		Eq_2 s4_183;
		word32 s2_549;
		mbedtls_md5_update(fp + -448, 0x10, mbedtls_md5_starts(fp + -400), dwLoc01A4, dwLoc0178, dwLoc0118, dwLocFC, dwLoc98, out a5_174, out s2_549, out s3_182, out s4_183);
		struct Eq_549817 ** a5_205;
		Eq_2 s2_212;
		word32 s4_551;
		word32 s3_550;
		mbedtls_md5_update(s3_182, s4_183, a5_174, dwLoc01A4, dwLoc0178, dwLoc0118, dwLocFC, dwLoc98, out a5_205, out s2_212, out s3_550, out s4_551);
		int32 s1_270;
		word32 a5_552;
		word32 s2_553;
		word32 s3_554;
		word32 s4_555;
		s0_146 = mbedtls_md5_finish(mbedtls_md5_update(s2_212, 0x08, a5_205, dwLoc01A4, dwLoc0178, dwLoc0118, dwLocFC, dwLoc98, out a5_552, out s2_553, out s3_554, out s4_555), dwLoc0198, dwLoc0138, dwLoc011C, dwLocB8, out s1_270, out s2_130, out s5_133, out s6_134);
		Eq_2 a2_290 = 0x10;
		if (s1_270 != 32)
			a2_290 = s1_270 + -16;
		word32 a5_567;
		word32 a6_568;
		word32 a7_569;
		word32 a1_563;
		word32 a4_566;
		word32 a2_564;
		word32 a3_565;
		memcpy(fp + -416, fp + -448, a2_290, out a1_563, out a2_564, out a3_565, out a4_566, out a5_567, out a6_568, out a7_569);
		mbedtls_md5_free(fp + -400);
		struct Eq_526718 * a5_312 = fp + -448;
		do
		{
			a5_312->b0000 = 0x00;
			++a5_312;
		} while (a5_312 != s0_146);
	}
	mbedtls_aes_setkey_dec(ra_49, s0_146);
	word32 a1_394;
	ptr32 a4_396;
	ptr32 s10_400;
	ptr32 s11_401;
	ptr32 s7_406;
	ptr32 s9_407;
	word32 s1_399;
	byte * s0_390 = mbedtls_aes_crypt_cbc(0x00, s6_134, s2_130, s5_133, s5_133, dwLocC8, dwLocB8, dwLoc28, out s1_399, out a1_394, out a4_396, out s7_406, out s9_407, out s10_400, out s11_401);
	mbedtls_aes_free(fp + -312);
	while (true)
	{
		s1_399 += ~0x00;
		if (s1_399 == ~0x00)
			break;
		*s0_390 = 0x00;
		++s0_390;
	}
	a4Out = a4_396;
	s7Out = s7_406;
	s9Out = s9_407;
	s10Out = s10_400;
	s11Out = s11_401;
	return a1_394;
}

// 23096D06: Register Eq_2 mbedtls_pem_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a5Out)
// Called from:
//      mbedtls_pk_parse_key
//      mbedtls_x509_crt_parse
Eq_2 mbedtls_pem_init(Eq_2 ra, Eq_2 a0, ptr32 & a5Out)
{
	ptr32 a5_12;
	word32 t1_17;
	word32 a0_18;
	word32 a1_19;
	word32 a2_20;
	word32 a3_21;
	word32 a4_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 0x0C, out t1_17, out a0_18, out a1_19, out a2_20, out a3_21, out a4_22, out a5_12);
	a5Out = a5_12;
	return ra_13;
}

