pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23096D0E: Register Eq_2 mbedtls_pem_read_buffer(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 ptr32) a6, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out (ptr32 ptr32) s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_pk_parse_key
//      mbedtls_x509_crt_parse
Eq_2 mbedtls_pem_read_buffer(Eq_2 ra, Eq_2 s0, ptr32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 * a6, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_2 s2_149;
	ptr32 s0_26;
	if (a0 == 0x00)
	{
		s0_26 = ~0x0100047F;
		s2_149 = s2;
		goto l23096D46;
	}
	s7 = a6;
	s5 = a5;
	s3 = a4;
	s2_149 = a3;
	s6 = a2;
	word32 a3_1241;
	Eq_2 a0_42 = strstr(ra, a3, a1, out a1, out a3_1241, out a4, out a5);
	if (a0_42 == 0x00)
	{
l23096D40:
		s0_26 = ~0x0100007F;
		goto l23096D46;
	}
	word32 a3_1242;
	Eq_2 a0_55 = strstr(ra, a3, a2, out a1, out a3_1242, out a4, out a5);
	if (a0_55 == 0x00 || a0_42 >= a0_55)
		goto l23096D40;
	word32 a2_1243;
	word32 a4_1245;
	word32 a3_1244;
	word32 a5_1246;
	word32 s0_72 = a0_42 + strlen(a1, out a1, out a2_1243, out a3_1244, out a4_1245, out a5_1246);
	if ((word32) s0_72->b0000 == 32)
		s0_72 = &s0_72->b0000 + 1;
	if ((word32) s0_72->b0000 == 0x0D)
		s0_72 = &s0_72->b0000 + 1;
	a4 = (word32) s0_72->b0000;
	a5.u0 = 0x0A;
	if (a4 != 0x0A)
		goto l23096D40;
	word32 a3_1248;
	word32 a5_1250;
	word32 a4_1249;
	word32 a2_1247;
	word32 a2_100 = a0_55 + strlen(a2, out a1, out a2_1247, out a3_1248, out a4_1249, out a5_1250);
	Eq_2 s8_284 = &s0_72->b0000 + 1;
	if ((word32) *a2_100 == 32)
		++a2_100;
	if ((word32) *a2_100 == 0x0D)
		++a2_100;
	if ((word32) *a2_100 == 0x0A)
		++a2_100;
	*a6 = a2_100 - a3;
	a5 = a0_55 - s8_284;
	a4.u0 = 0x15;
	if (a5 > 0x15)
	{
		word32 a3_1252;
		word32 a2_1251;
		if (memcmp(s8_284, 588028072, 22, out a1, out a2_1251, out a3_1252, out a4, out a5) == 0x00)
		{
			a5 = (word32) s0_72->b0017;
			s2_149 = &s0_72->b0017;
			if (a5 == 0x0D)
			{
				a5 = (word32) s0_72->b0018;
				s2_149 = &s0_72->b0018;
			}
			a4.u0 = 0x0A;
			if (a5 != 0x0A)
			{
l23096E12:
				s0_26 = ~0x010000FF;
				goto l23096D46;
			}
			Eq_2 s0_155 = (word32) s2_149 + 1;
			s6 = a0_55 - s0_155;
			a5.u0 = 0x0D;
			if (s6 <= 0x0D)
			{
l23096E28:
				s0_26 = ~0x0100027F;
				goto l23096D46;
			}
			word32 a3_1285;
			word32 a2_1284;
			if (memcmp(s0_155, 0x230C98C0, 0x0E, out a1, out a2_1284, out a3_1285, out a4, out a5) != 0x00)
				goto l23096E28;
			a5.u0 = 0x15;
			if (s6 <= 0x15)
				goto l23096E28;
			s6.u0 = 0x05;
			word32 a3_1287;
			word32 a4_1288;
			word32 a5_1289;
			word32 a2_1286;
			if (memcmp(s0_155, 588028112, 22, out a1, out a2_1286, out a3_1287, out a4_1288, out a5_1289) != 0x00)
			{
				s6.u0 = 0x06;
				word32 a5_1293;
				word32 a3_1291;
				word32 a4_1292;
				word32 a2_1290;
				if (memcmp(s0_155, 588028136, 22, out a1, out a2_1290, out a3_1291, out a4_1292, out a5_1293) != 0x00)
				{
					word32 a2_1294;
					word32 a3_1295;
					if (memcmp(s0_155, 0x230C9900, 22, out a1, out a2_1294, out a3_1295, out a4, out a5) != 0x00)
						goto l23096E28;
					s6.u0 = 0x07;
				}
			}
			a5 = a0_55 - (s2_149 + 23);
			a4.u0 = 0x1F;
			if (a5 <= 0x1F)
			{
l23096E92:
				s0_26 = ~0x010001FF;
l23096D46:
				s0Out = dwArgCC;
				s1Out = dwLoc4C;
				a0Out = s0_26;
				a1Out = a1;
				a2Out = dwArg01A8;
				a3Out = s2;
				a4Out = a4;
				a5Out = a5;
				s2Out = s2_149;
				s3Out = s3;
				s4Out = dwArg0168;
				s5Out = s5;
				s6Out = s6;
				s7Out = s7;
				s8Out = dwArg0148;
				s9Out = s9;
				s10Out = s10;
				s11Out = s11;
				return dwLoc08;
			}
			word32 a0_1297;
			word32 a1_1298;
			word32 a2_1299;
			word32 a3_1300;
			word32 t1_1296;
			word32 a5_1302;
			word32 a4_1301;
			ra = memset(ra, fp + -64, 0x00, 0x10, out t1_1296, out a0_1297, out a1_1298, out a2_1299, out a3_1300, out a4_1301, out a5_1302);
			a5.u0 = 0x00;
			a1.u0 = 32;
			do
			{
				a4 = CONVERT(Mem241[s2_149 + a5 + 23:byte], byte, word32);
				uint32 a3_243 = (byte) a4.u0 - 48;
				if (((byte) a4.u0 - 48 & 0x00FF) > 0x09)
				{
					if (((byte) a4.u0 - 65 & 0x00FF) <= 0x05)
						a3_243 = (uint32) ((byte) a4.u0 - 55);
					else
					{
						if (((byte) a4.u0 - 97 & 0x00FF) > 0x05)
							goto l23096E92;
						a3_243 = (uint32) ((byte) a4.u0 - 87);
					}
				}
				if ((a5 & 1) == 0x00)
					a3_243 <<= 4;
				byte * a4_263 = (a5 >> 0x01) + (fp + -64);
				*a4_263 = (byte) (a3_243 | (word32) (*a4_263));
				a5 = (byte) a5.u0 + 1;
			} while (a5 != 32);
			word32 a3_278 = s2_149 + 56;
			if ((word32) *((byte) s2_149.u0 + 55) != 0x0D)
				a3_278 = s2_149 + 55;
			a4 = (word32) a3_278->b0000;
			a5.u0 = 0x0A;
			if (a4 != 0x0A)
				goto l23096E12;
			s8_284 = a3_278 + 1;
			s7 = (ptr32 *) 0x01;
l23096F14:
			if (s8_284 >= a0_55)
				goto l23096E12;
			int32 a0_303;
			Eq_2 a3_322;
			word32 s4_1255;
			word32 a2_1253;
			word32 a5_1254;
			Eq_2 s1_309 = mbedtls_base64_decode(null, 0x00, fp + -0x0044, s8_284, a0_55 - s8_284, out a0_303, out a1, out a2_1253, out a3_322, out a4, out a5_1254, out s2_149, out s3, out s4_1255, out s5);
			a5.u0 = -44;
			if (a0_303 == -44)
			{
				s0_26 = ~0x0100012B;
				goto l23096D46;
			}
			Eq_2 s1_360;
			Eq_2 s8_364;
			word32 a3_1258;
			word32 s2_1259;
			word32 s4_1260;
			word32 a2_1257;
			word32 s0_1256;
			Eq_2 ra_358 = mycalloc(ra, s1_309, 0x01, a1, a3_322, a4, -44, mstatus, s2, s0, dwArgC8, dwArg0108, out s0_1256, out s1_360, out a1, out a2_1257, out a3_1258, out a4, out a5, out s2_1259, out s3, out s4_1260, out s8_364);
			s2_149.u0 = 0x01;
			if (false)
			{
				s0_26 = ~0x0100017F;
				goto l23096D46;
			}
			word32 a3_1261;
			ptr32 a0_376;
			Eq_2 a2_377;
			struct Eq_551166 * s4_385;
			mbedtls_base64_decode((struct Eq_551101 *) 0x01, a1, fp + -0x0044, s8_364, s1_360, out a0_376, out a1, out a2_377, out a3_1261, out a4, out a5, out s2_149, out s3, out s4_385, out s5);
			s0_26 = a0_376;
			if (a0_376 != 0x00)
			{
				word32 t3_1269;
				word32 a0_1263;
				word32 a2_1264;
				word32 a5_1266;
				word32 s4_1268;
				word32 s1_1262;
				word32 a6_1267;
				word32 a3_1265;
				word32 s0_518;
				vPortFree(s2_149, a2_377, a5, mstatus, dwArg0108, dwArg0148, out s0_518, out s1_1262, out a0_1263, out a1, out a2_1264, out a3_1265, out a4, out a5_1266, out a6_1267, out s4_1268, out t3_1269);
				a5.u0 = ~0x010000FF;
				s0_26 = s0_518 + ~0x010000FF;
				goto l23096D46;
			}
			if (s7 != null)
			{
				if (s3 == 0x00)
				{
					word32 a6_1274;
					word32 t3_1276;
					word32 a3_1273;
					word32 s4_1275;
					word32 s1_1270;
					word32 a0_1271;
					word32 a2_1272;
					word32 s0_504;
					vPortFree(s2_149, a2_377, a5, mstatus, dwArg0108, dwArg0148, out s0_504, out s1_1270, out a0_1271, out a1, out a2_1272, out a3_1273, out a4, out a5, out a6_1274, out s4_1275, out t3_1276);
					s0_26 = s0_504 + -0x0300;
					goto l23096D46;
				}
				if (s6 == 0x05 || (s6 == 0x06 || s6 == 0x07))
					a1 = pem_aes_decrypt(ra_358, s3, s5, out a4, out s7, out s9, out s10, out s11);
				a5.u0 = 0x02;
				if (a4 <= 0x02)
				{
l23096FC2:
					word32 a3_1280;
					word32 a2_1279;
					word32 a0_1278;
					word32 a6_1281;
					word32 s4_1282;
					word32 t3_1283;
					word32 s1_1277;
					word32 s0_489;
					vPortFree(s2_149, dwArg74, a5, mstatus, dwArg0108, dwArg0148, out s0_489, out s1_1277, out a0_1278, out a1, out a2_1279, out a3_1280, out a4, out a5, out a6_1281, out s4_1282, out t3_1283);
					s0_26 = s0_489 + -896;
					goto l23096D46;
				}
				a5.u0 = 48;
				if ((word32) *s2_149.u0 != 48)
					goto l23096FC2;
				a4 = (word32) *((byte) s2_149.u0 + 1);
				a5.u0 = 131;
				if (a4 > 131)
					goto l23096FC2;
			}
			s4_385->t0000 = s2_149;
			s4_385->t0004 = a5;
			goto l23096D46;
		}
	}
	s6.u0 = 0x00;
	s7 = null;
	goto l23096F14;
}

// 23097016: Register word32 mbedtls_pem_free(Register (ptr32 Eq_2) a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_pk_parse_key
//      mbedtls_x509_crt_parse
word32 mbedtls_pem_free(union Eq_2 * a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	Eq_2 a2_14;
	Eq_2 a5_17;
	Eq_2 a0_20;
	word32 a3_72;
	word32 a4_73;
	word32 a1_71;
	word32 s1_70;
	word32 s0_69;
	word32 a6_74;
	word32 s4_75;
	word32 t3_76;
	vPortFree(*a0, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_69, out s1_70, out a0_20, out a1_71, out a2_14, out a3_72, out a4_73, out a5_17, out a6_74, out s4_75, out t3_76);
	ptr32 a3_28;
	ptr32 a4_29;
	word32 s1_31;
	byte * s0_36;
	ptr32 s4_37;
	word32 a0_77;
	word32 a1_78;
	word32 a2_79;
	word32 a5_80;
	word32 a6_81;
	word32 t3_82;
	vPortFree(a0_20, a2_14, a5_17, mstatus, dwArg0148, dwArg0188, out s0_36, out s1_31, out a0_77, out a1_78, out a2_79, out a3_28, out a4_29, out a5_80, out a6_81, out s4_37, out t3_82);
	s0_40 = s0_36;
	while (true)
	{
		byte * s0_40;
		if (s0_40 == s0_36 + 0x0C)
			break;
		*s0_40 = 0x00;
		++s0_40;
	}
	a3Out = a3_28;
	a4Out = a4_29;
	a5Out = s0_36 + 0x0C;
	s4Out = s4_37;
	return s1_31;
}

// 23097042: Register Eq_2 mbedtls_md5_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a1Out)
// Called from:
//      md5_ctx_alloc
//      pem_aes_decrypt
//      mbedtls_md5
Eq_2 mbedtls_md5_init(Eq_2 ra, Eq_2 a0, ptr32 & a1Out)
{
	ptr32 a1_8;
	word32 t1_17;
	word32 a0_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 88, out t1_17, out a0_18, out a1_8, out a2_19, out a3_20, out a4_21, out a5_22);
	a1Out = a1_8;
	return ra_13;
}

// 2309704C: Register word32 mbedtls_md5_free(Register Eq_2 a0)
// Called from:
//      md5_ctx_free
//      pem_aes_decrypt
//      mbedtls_md5
word32 mbedtls_md5_free(Eq_2 a0)
{
	a0_5 = a0;
	if (a0 != 0x00)
	{
		while (true)
		{
			Eq_2 a0_5;
			if (a0_5 == (word32) a0 + 88)
				break;
			*a0_5 = 0x00;
			a0_5 = (word32) a0_5 + 1;
		}
	}
	return (word32) a0 + 88;
}

// 23097060: void mbedtls_md5_clone(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      md5_clone_wrap
void mbedtls_md5_clone(Eq_2 a0, Eq_2 a1)
{
	word32 a1_26;
	word32 a2_27;
	word32 a3_28;
	word32 a4_29;
	word32 a5_30;
	word32 a6_31;
	word32 a7_32;
	memcpy(a0, a1, 88, out a1_26, out a2_27, out a3_28, out a4_29, out a5_30, out a6_31, out a7_32);
}

// 23097072: Register word32 mbedtls_md5_starts(Register (ptr32 Eq_549992) a0)
// Called from:
//      md5_starts_wrap
//      pem_aes_decrypt
//      mbedtls_md5
word32 mbedtls_md5_starts(struct Eq_549992 * a0)
{
	*(struct Eq_549992 **) 0x67452309 = a0;
	*(struct Eq_549992 **) 4023233429 = a0;
	*(struct Eq_549992 **) 2562383118 = a0;
	a0->dw0000 = 0x00;
	a0->dw0004 = 0x00;
	*(struct Eq_549992 **) 271733898 = a0;
	return 271733878;
}

