pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 230970A4: Register word32 mbedtls_md5_process(Register (ptr32 Eq_549817) a0, Register (ptr32 Eq_549818) a1, Stack word32 dwArg3C, Stack ptr32 dwArgE4, Stack Eq_2 dwArg0148, Register out Eq_549835 s1Out, Register out Eq_549836 s2Out, Register out Eq_549837 s3Out, Register out ptr32 s4Out, Register out Eq_549839 s5Out, Register out ptr32 s6Out)
// Called from:
//      md5_process_wrap
//      mbedtls_md5_update
word32 mbedtls_md5_process(struct Eq_549817 * a0, struct Eq_549818 * a1, word32 dwArg3C, ptr32 dwArgE4, Eq_2 dwArg0148, union Eq_549835 & s1Out, union Eq_549836 & s2Out, union Eq_549837 & s3Out, ptr32 & s4Out, union Eq_549839 & s5Out, ptr32 & s6Out)
{
	ui32 s8_43 = (word32) a1->b0003 << 24 | ((word32) a1->b0002 << 16 | ((word32) a1->b0001 << 8 | (word32) a1->b0000));
	int32 t5_172 = a0->dw0008;
	struct Eq_551625 * a2_200 = (word32) a1->b003E << 16 | ((word32) a1->b003D << 8 | (word32) a1->b003C);
	int32 a6_176 = a0->dw0014;
	uint32 a7_210 = ((a1 ^ a6_176) & a2_200 ^ a6_176) + ((t5_172 + 3614090360) + s8_43);
	ui32 s3_58 = (word32) a1->b0007 << 24 | ((word32) a1->b0006 << 16 | ((word32) a1->b0005 << 8 | (word32) a1->b0004));
	ui32 a7_214 = a2_200 + (a7_210 >> 0x19 | a7_210 << 0x07) / 16;
	uint32 t6_219 = ((a2_200 ^ a1) & a7_214 ^ a1) + ((a6_176 + 3905402710) + s3_58);
	int32 t0_73 = (word32) a1->b000B << 24 | ((word32) a1->b000A << 16 | ((word32) a1->b0009 << 8 | (word32) a1->b0008));
	ui32 t6_223 = (t6_219 >> 0x14 | t6_219 << 0x0C) + a7_214;
	uint32 t3_228 = &a1->b003F + 606105756 + t0_73 / 64 + ((a2_200 ^ a7_214) & t6_223 ^ a2_200) / 64;
	ui32 s4_88 = (word32) a1->b000F << 24 | ((word32) a1->b000E << 16 | ((word32) a1->b000D << 8 | (word32) a1->b000C));
	ui32 t3_235 = (t3_228 << 0x0011 | t3_228 >> 0x0F) + t6_223;
	uint32 t1_240 = (char *) a2_200 - 0x3E423112 + s4_88 + ((a7_214 ^ t6_223) & t3_235 ^ a7_214);
	ui32 s0_66 = (word32) a1->b0013 << 24 | (((word32) a1->b0011 << 8 | (word32) a1->b0010) | (word32) a1->b0012 << 16);
	ui32 t1_247 = (t1_240 << 22 | t1_240 >> 0x0A) + t3_235;
	uint32 a7_252 = ((t6_223 ^ t3_235) & t1_247 ^ t6_223) + ((s0_66 + ~0x0A83F050) + a7_214);
	ui32 s5_103 = (word32) a1->b0017 << 24 | ((word32) a1->b0016 << 16 | ((word32) a1->b0015 << 8 | (word32) a1->b0014));
	ui32 a7_259 = (a7_252 >> 0x19 | a7_252 << 0x07) + t1_247;
	uint32 t6_264 = ((t3_235 ^ t1_247) & a7_259 ^ t3_235) + ((s5_103 + 1200080426) + t6_223);
	ui32 a3_118 = (word32) a1->b001B << 24 | (((word32) a1->b0019 << 8 | (word32) a1->b0018) | (word32) a1->b001A << 16);
	ui32 t6_271 = (t6_264 >> 0x14 | t6_264 << 0x0C) + a7_259;
	uint32 t3_276 = ((t1_247 ^ a7_259) & t6_271 ^ t1_247) + ((a3_118 + 0xA8304613) + t3_235);
	ui32 s7_133 = (word32) a1->b001F << 24 | ((word32) a1->b001E << 16 | ((word32) a1->b001D << 8 | (word32) a1->b001C));
	ui32 t3_283 = (t3_276 << 0x0011 | t3_276 >> 0x0F) + t6_271;
	uint32 t1_288 = ((a7_259 ^ t6_271) & t3_283 ^ a7_259) + ((s7_133 + 4249261313) + t1_247);
	ui32 s2_146 = (word32) a1->b0023 << 24 | ((word32) a1->b0022 << 16 | ((word32) a1->b0021 << 8 | (word32) a1->b0020));
	ui32 t1_295 = (t1_288 << 22 | t1_288 >> 0x0A) + t3_283;
	uint32 a7_300 = ((t6_271 ^ t3_283) & t1_295 ^ t6_271) + ((s2_146 + 0x698098D8) + a7_259);
	ui32 t4_121 = (word32) a1->b0027 << 24 | ((word32) a1->b0026 << 16 | ((word32) a1->b0025 << 8 | (word32) a1->b0024));
	ui32 a7_307 = (a7_300 >> 0x19 | a7_300 << 0x07) + t1_295;
	uint32 t6_312 = ((t3_283 ^ t1_295) & a7_307 ^ t3_283) + ((t4_121 + 2336552879) + t6_271);
	ui32 a5_158 = (word32) a1->b002B << 24 | (((word32) a1->b0029 << 8 | (word32) a1->b0028) | (word32) a1->b002A << 16);
	ui32 t6_319 = (t6_312 >> 0x14 | t6_312 << 0x0C) + a7_307;
	uint32 t3_324 = ((t1_295 ^ a7_307) & t6_319 ^ t1_295) + ((a5_158 + ~0x0A00044E) + t3_283);
	ui32 t2_149 = (word32) a1->b002F << 24 | ((word32) a1->b002E << 16 | ((word32) a1->b002D << 8 | (word32) a1->b002C));
	ui32 t3_331 = (t3_324 << 0x0011 | t3_324 >> 0x0F) + t6_319;
	uint32 t1_336 = ((a7_307 ^ t6_319) & t3_331 ^ a7_307) + ((t2_149 + 2304563134) + t1_295);
	ui32 a4_168 = (word32) a1->b0033 << 24 | (((word32) a1->b0031 << 8 | (word32) a1->b0030) | (word32) a1->b0032 << 16);
	ui32 t1_343 = (t1_336 << 22 | t1_336 >> 0x0A) + t3_331;
	uint32 a7_348 = ((t6_319 ^ t3_331) & t1_343 ^ t6_319) + ((a4_168 + 0x6B901122) + a7_307);
	ui32 s1_184 = (word32) a1->b0037 << 24 | (((word32) a1->b0035 << 8 | (word32) a1->b0034) | (word32) a1->b0036 << 16);
	ui32 a7_355 = (a7_348 >> 0x19 | a7_348 << 0x07) + t1_343;
	uint32 t6_360 = ((t3_331 ^ t1_343) & a7_355 ^ t3_331) + ((s1_184 + 4254626195) + t6_319);
	ui32 s6_194 = (word32) a1->b003B << 24 | ((word32) a1->b003A << 16 | ((word32) a1->b0039 << 8 | (word32) a1->b0038));
	ui32 t6_367 = (t6_360 >> 0x14 | t6_360 << 0x0C) + a7_355;
	uint32 t3_372 = ((t1_343 ^ a7_355) & t6_367 ^ t1_343) + ((s6_194 + 2792965006) + t3_331);
	ui32 s9_204 = (word32) a1->b003F << 24 | a2_200;
	ui32 t3_379 = (t3_372 << 0x0011 | t3_372 >> 0x0F) + t6_367;
	uint32 t1_384 = ((a7_355 ^ t6_367) & t3_379 ^ a7_355) + ((s9_204 + 1236535329) + t1_343);
	ui32 t1_390 = (t1_384 << 22 | t1_384 >> 0x0A) + t3_379;
	uint32 a7_396 = ((t3_379 ^ t1_390) & t6_367 ^ t3_379) + ((s3_58 + 0xF61E2562) + a7_355);
	ui32 a7_402 = (a7_396 >> 0x1B | a7_396 << 0x05) + t1_390;
	uint32 t6_408 = ((t1_390 ^ a7_402) & t3_379 ^ t1_390) + ((a3_118 + 0xC040B340) + t6_367);
	ui32 t6_414 = (t6_408 >> 0x17 | t6_408 << 0x09) + a7_402;
	uint32 t3_420 = ((a7_402 ^ t6_414) & t1_390 ^ a7_402) + ((t2_149 + 643717713) + t3_379);
	ui32 t3_426 = (t3_420 >> 0x12 | t3_420 << 0x0E) + t6_414;
	uint32 t1_432 = ((t6_414 ^ t3_426) & a7_402 ^ t6_414) + ((s8_43 + 3921069994) + t1_390);
	ui32 t1_438 = (t1_432 << 20 | t1_432 >> 0x0C) + t3_426;
	uint32 a7_444 = ((t3_426 ^ t1_438) & t6_414 ^ t3_426) + ((s5_103 + 0xD62F105D) + a7_402);
	ui32 a7_450 = (a7_444 >> 0x1B | a7_444 << 0x05) + t1_438;
	uint32 t6_456 = ((t1_438 ^ a7_450) & t3_426 ^ t1_438) + ((a5_158 + 38016083) + t6_414);
	ui32 t6_462 = (t6_456 >> 0x17 | t6_456 << 0x09) + a7_450;
	uint32 t3_468 = ((a7_450 ^ t6_462) & t1_438 ^ a7_450) + ((s9_204 + 3634488961) + t3_426);
	ui32 t3_474 = (t3_468 >> 0x12 | t3_468 << 0x0E) + t6_462;
	uint32 t1_480 = ((t6_462 ^ t3_474) & a7_450 ^ t6_462) + ((s0_66 + 3889429448) + t1_438);
	ui32 t1_486 = (t1_480 << 20 | t1_480 >> 0x0C) + t3_474;
	uint32 a7_492 = ((t3_474 ^ t1_486) & t6_462 ^ t3_474) + ((t4_121 + 568446438) + a7_450);
	ui32 a7_498 = (a7_492 >> 0x1B | a7_492 << 0x05) + t1_486;
	uint32 t6_504 = ((t1_486 ^ a7_498) & t3_474 ^ t1_486) + ((s6_194 + ~0x3CC8F829) + t6_462);
	ui32 t6_510 = (t6_504 >> 0x17 | t6_504 << 0x09) + a7_498;
	uint32 t3_516 = ((a7_498 ^ t6_510) & t1_486 ^ a7_498) + ((s4_88 + ~0x0B2AF278) + t3_474);
	ui32 t3_522 = (t3_516 >> 0x12 | t3_516 << 0x0E) + t6_510;
	uint32 t1_528 = ((t6_510 ^ t3_522) & a7_498 ^ t6_510) + ((s2_146 + 1163531501) + t1_486);
	ui32 t1_534 = (t1_528 << 20 | t1_528 >> 0x0C) + t3_522;
	uint32 a7_540 = ((t3_522 ^ t1_534) & t6_510 ^ t3_522) + ((s1_184 + 2850285829) + a7_498);
	ui32 a7_546 = (a7_540 >> 0x1B | a7_540 << 0x05) + t1_534;
	uint32 t6_552 = ((t1_534 ^ a7_546) & t3_522 ^ t1_534) + ((t0_73 + 4243563512) + t6_510);
	ui32 t6_558 = (t6_552 >> 0x17 | t6_552 << 0x09) + a7_546;
	uint32 t3_564 = ((a7_546 ^ t6_558) & t1_534 ^ a7_546) + ((s7_133 + 0x676F02D9) + t3_522);
	ui32 t3_568 = (t3_564 >> 0x12 | t3_564 << 0x0E) + t6_558;
	ui32 s10_569 = t6_558 ^ t3_568;
	uint32 t1_573 = (s10_569 & a7_546 ^ t6_558) + ((a4_168 + 2368359562) + t1_534);
	ui32 t1_579 = (t1_573 << 20 | t1_573 >> 0x0C) + t3_568;
	uint32 a7_583 = (s10_569 ^ t1_579) + ((s5_103 + ~0x0005C6BD) + a7_546);
	ui32 a7_590 = (a7_583 >> 0x1C | a7_583 << 0x04) + t1_579;
	uint32 s10_594 = (t3_568 ^ t1_579 ^ a7_590) + (t6_558 + (s2_146 + 2272392833));
	ui32 s10_601 = (s10_594 >> 0x15 | s10_594 << 11) + a7_590;
	uint32 t6_605 = (t1_579 ^ a7_590 ^ s10_601) + (t3_568 + (t2_149 + 0x6D9D6122));
	ui32 t6_612 = (t6_605 >> 0x10 | t6_605 << 0x10) + s10_601;
	uint32 t3_616 = (a7_590 ^ s10_601 ^ t6_612) + (t1_579 + (s6_194 + 4259657740));
	ui32 t3_623 = (t3_616 << 23 | t3_616 >> 0x09) + t6_612;
	uint32 a7_627 = (s10_601 ^ t6_612 ^ t3_623) + ((s3_58 + 0xA4BEEA44) + a7_590);
	ui32 a7_634 = (a7_627 >> 0x1C | a7_627 << 0x04) + t3_623;
	uint32 t1_638 = (t6_612 ^ t3_623 ^ a7_634) + (s10_601 + (s0_66 + 1272893353));
	ui32 t1_645 = (t1_638 >> 0x15 | t1_638 << 11) + a7_634;
	uint32 t6_649 = (t3_623 ^ a7_634 ^ t1_645) + ((s7_133 + ~0x0944B49F) + t6_612);
	ui32 t6_656 = (t6_649 >> 0x10 | t6_649 << 0x10) + t1_645;
	uint32 s10_660 = (a7_634 ^ t1_645 ^ t6_656) + (t3_623 + (a5_158 + 3200236656));
	ui32 s10_667 = (s10_660 << 23 | s10_660 >> 0x09) + t6_656;
	uint32 t3_671 = (t1_645 ^ t6_656 ^ s10_667) + (a7_634 + (s1_184 + 681279174));
	ui32 t3_678 = (t3_671 >> 0x1C | t3_671 << 0x04) + s10_667;
	uint32 t1_682 = (t6_656 ^ s10_667 ^ t3_678) + ((s8_43 + 3936430074) + t1_645);
	ui32 t1_689 = (t1_682 >> 0x15 | t1_682 << 11) + t3_678;
	uint32 t6_693 = (s10_667 ^ t3_678 ^ t1_689) + ((s4_88 + 3572445317) + t6_656);
	ui32 t6_700 = (t6_693 >> 0x10 | t6_693 << 0x10) + t1_689;
	uint32 a7_704 = (t3_678 ^ t1_689 ^ t6_700) + (s10_667 + (a3_118 + 0x04881D05));
	ui32 a7_711 = (a7_704 << 23 | a7_704 >> 0x09) + t6_700;
	uint32 t3_715 = (t1_689 ^ t6_700 ^ a7_711) + ((t4_121 + 0xD9D4D039) + t3_678);
	ui32 t3_722 = (t3_715 >> 0x1C | t3_715 << 0x04) + a7_711;
	uint32 s10_726 = (t6_700 ^ a7_711 ^ t3_722) + (t1_689 + (a4_168 + 3873151461));
	ui32 s10_733 = (s10_726 >> 0x15 | s10_726 << 11) + t3_722;
	uint32 t1_737 = (a7_711 ^ t3_722 ^ s10_733) + (t6_700 + (s9_204 + 530742520));
	ui32 t1_744 = (t1_737 >> 0x10 | t1_737 << 0x10) + s10_733;
	uint32 a7_748 = (t3_722 ^ s10_733 ^ t1_744) + ((t0_73 + 0xC4AC5665) + a7_711);
	ui32 a7_755 = (a7_748 << 23 | a7_748 >> 0x09) + t1_744;
	uint32 t6_760 = ((~s10_733 | a7_755) ^ t1_744) + (t3_722 + (s8_43 + 0xF4292244));
	ui32 t6_767 = (t6_760 >> 0x1A | t6_760 << 0x06) + a7_755;
	uint32 t3_772 = ((~t1_744 | t6_767) ^ a7_755) + (s10_733 + (s7_133 + 1126891415));
	ui32 t3_779 = (t3_772 >> 22 | t3_772 << 0x0A) + t6_767;
	uint32 t1_784 = ((~a7_755 | t3_779) ^ t6_767) + ((s6_194 + 2878612391) + t1_744);
	ui32 t1_791 = (t1_784 >> 0x11 | t1_784 << 0x0F) + t3_779;
	uint32 a7_796 = ((~t6_767 | t1_791) ^ t3_779) + ((s5_103 + 0xFC93A039) + a7_755);
	ui32 a7_803 = (a7_796 << 21 | a7_796 >> 11) + t1_791;
	uint32 t6_808 = ((~t3_779 | a7_803) ^ t1_791) + ((a4_168 + 1700485571) + t6_767);
	ui32 t6_815 = (t6_808 >> 0x1A | t6_808 << 0x06) + a7_803;
	uint32 a4_820 = ((~t1_791 | t6_815) ^ a7_803) + (t3_779 + (s4_88 + 2399980690));
	ui32 a4_827 = (a4_820 >> 22 | a4_820 << 0x0A) + t6_815;
	uint32 t1_832 = ((~a7_803 | a4_827) ^ t6_815) + ((a5_158 + ~0x00100B82) + t1_791);
	ui32 t1_839 = (t1_832 >> 0x11 | t1_832 << 0x0F) + a4_827;
	Eq_549837 s3_840 = s3_58 + 2240044497 + a7_803;
	uint32 a7_844 = (word32) s3_840.u0 + ((~t6_815 | t1_839) ^ a4_827);
	ui32 a7_851 = (a7_844 << 21 | a7_844 >> 11) + t1_839;
	Eq_549836 s2_852 = s2_146 + 1873313359 + t6_815;
	uint32 t6_856 = (word32) s2_852.u0 + ((~a4_827 | a7_851) ^ t1_839);
	ui32 t6_863 = (t6_856 >> 0x1A | t6_856 << 0x06) + a7_851;
	uint32 t3_868 = ((~t1_839 | t6_863) ^ a7_851) + (a4_827 + (s9_204 + 4264355552));
	ui32 t3_875 = (t3_868 >> 22 | t3_868 << 0x0A) + t6_863;
	uint32 t1_880 = ((~a7_851 | t3_875) ^ t6_863) + ((a3_118 + 0xA3014314) + t1_839);
	ui32 t1_887 = (t1_880 >> 0x11 | t1_880 << 0x0F) + t3_875;
	Eq_549835 s1_888 = s1_184 + 0x4E0811A1 + a7_851;
	uint32 a7_892 = (word32) s1_888.u0 + ((~t6_863 | t1_887) ^ t3_875);
	ui32 a7_899 = (a7_892 << 21 | a7_892 >> 11) + t1_887;
	uint32 a5_904 = ((~t3_875 | a7_899) ^ t1_887) + (t6_863 + (s0_66 + 4149444226));
	ui32 a5_911 = (a5_904 >> 26 | a5_904 << 0x06) + a7_899;
	uint32 a4_916 = ((~t1_887 | a5_911) ^ a7_899) + (t3_875 + (t2_149 + 3174756917));
	Eq_552930 a4_923 = (a4_916 >> 22 | a4_916 << 0x0A) + a5_911;
	uint32 a3_928 = ((~a7_899 | a4_923) ^ a5_911) + (t1_887 + (t0_73 + 718787259));
	int32 a3_933 = (word32) a4_923 + (a3_928 >> 0x0011 | a3_928 << 0x0F);
	struct Eq_552952 * a0_205 = a2_200->ptr000C;
	a0_205->dw0008 = t5_172 + a5_911;
	uint32 a5_941 = ((~a5_911 | a3_933) ^ a4_923) + (a7_899 + (t4_121 + 3951481745));
	(dwArgE4 + (a5_941 >> 11 | a5_941 << 21))->ptr000C = a0_205;
	(a1 + a3_933 / 64)->b0010 = (byte) a0_205;
	(word32) a4_923 + a6_176 + 20 = a0_205;
	0x00 = (int8) dwArg0148;
	0x00 = dwArg3C;
	s1Out = s1_888;
	s2Out = s2_852;
	s3Out = s3_840;
	s4Out = dwArg98;
	s5Out.u0 = 1700485571;
	s6Out = 0xFC93A039;
	return dwLoc04;
}

