pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
	ui32 s8_1579 = s8_1538 << 30 | s8_1538 >> 0x02;
	uint32 s7_1574 = s7_1524 + ((a3_1554 << 0x01 | a3_1554 >> 31) + 0xCA62C1D6) + ((s5_1543 ^ s9_1562) ^ s8_1538) + (s6_1558 << 0x05 | s6_1558 >> 0x1B);
	uint32 s5_1594 = s5_1543 + ((t6_1573 << 0x01 | t6_1573 >> 0x1F) + 0xCA62C1D6) + ((s9_1562 ^ s8_1579) ^ s6_1558) + (s7_1574 << 0x05 | s7_1574 >> 0x1B);
	uint32 t4_1588 = t2_1309 ^ a4_1345 ^ a1_1453 ^ t4_1544;
	ui32 s6_1599 = s6_1558 << 30 | s6_1558 >> 0x02;
	struct Eq_556075 * a5_1606 = s5_1594 << 0x05 | s5_1594 >> 0x1B;
	a5_1606->ptr000C->dw0008 = a5_1606 + ((s9_1562 + ((t4_1588 << 0x01 | t4_1588 >> 0x1F) + ((word32) s3_173 - 899497514))) + ((s8_1579 ^ s6_1599) ^ s7_1574)) / 16;
	Eq_550017 s5_1612 = a5_1606 + s5_1594 / 16;
	(s7_1574 >> 0x02)->ptr0014->t000C = s5_1612;
	struct Eq_556110 * a0_1620 = (s7_1574 >> 0x02)->ptr0018;
	a0_1620->dw0010 = s4_169 + (s7_1574 >> 0x02 | s7_1574 << 30);
	Eq_550018 s6_1619 = s6_1599 + (s7_1574 >> 0x02);
	a0_1620->t0014 = s6_1619;
	a0_1620->dw0018 = s8_1579 + (s7_1574 >> 0x02);
	0x00 = dwArg0148;
	0x00 = dwArg3C;
	s1Out = s1_1547;
	s2Out = 0xCA62C1D6;
	s3Out = (word32) s3_173 - 899497514;
	s4Out = dwArg98;
	s5Out = s5_1612;
	s6Out = s6_1619;
	return dwLoc04;
}

// 2309949E: Register Eq_2 mbedtls_sha1_update.part.0(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 (ptr32 Eq_549997)) a5, Stack word32 dwArg1C, Stack Eq_2 dwArg48, Stack word32 dwArgA8, Stack word32 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a2Out, Register out Eq_556150 a5Out)
// Called from:
//      mbedtls_sha1_update
//      mbedtls_sha1_finish
Eq_2 mbedtls_sha1_update.part.0(Eq_2 a1, Eq_2 a2, struct Eq_549997 ** a5, word32 dwArg1C, Eq_2 dwArg48, word32 dwArgA8, word32 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a2Out, union Eq_556150 & a5Out)
{
	struct Eq_549997 * a0_21 = *a5;
	word32 a5_27 = a5 + a2;
	*a5_27 = a0_21;
	struct Eq_549997 * s1_101 = a0_21;
	Eq_2 s2_117 = a1;
	ui32 s3_118 = a5 & 63;
	Eq_2 s0_113 = a2;
	if (a5_27 < a2)
		*((word32) a5_27 + 5) = *((word32) a5_27 + 4);
	if ((a5 & 63) != 0x00)
	{
		Eq_2 s4_35 = 64 - (a5 & 63);
		if (a2 >= s4_35)
		{
			word32 a7_317;
			word32 a5_315;
			word32 a6_316;
			word32 a4_314;
			word32 a3_313;
			word32 a1_311;
			word32 a2_312;
			memcpy(&a0_21->dw0018 + 1 + (a5 & 63) / 28, a1, s4_35, out a1_311, out a2_312, out a3_313, out a4_314, out a5_315, out a6_316, out a7_317);
			word32 s2_74;
			word32 s4_76;
			word32 s6_320;
			word32 s5_319;
			word32 s3_318;
			s0_113 = mbedtls_sha1_process(a0_21, &a0_21->dw0018 + 1, dwArg1C, dwArg0128, out s1_101, out s2_74, out s3_318, out s4_76, out s5_319, out s6_320);
			s2_117 = s2_74 + s4_76;
			s3_118 = 0x00;
		}
	}
	Eq_2 s4_133 = s0_113;
	word32 s6_121 = s2_117 + s0_113;
	Eq_2 s5_100 = 63;
	while (true)
	{
		struct Eq_549998 * a1_99 = s6_121 - s4_133;
		if (s5_100 >= s4_133)
			break;
		word32 s4_119;
		s0_113 = mbedtls_sha1_process(s1_101, a1_99, dwArg1C, dwArg0128, out s1_101, out s2_117, out s3_118, out s4_119, out s5_100, out s6_121);
		s4_133 = s4_119 + -64;
	}
	uint32 a2_135 = s0_113 >> 0x06;
	Eq_2 a1_140 = (word32) s2_117 + (a2_135 << 0x06);
	if ((word32) s0_113 + (a2_135 + -64) == 0x00)
	{
		0x00 = dwArgA8;
		s1Out.u0 = <invalid>;
		a2Out = dwArg48;
		a5Out.u0 = -64;
		return <invalid>;
	}
	else
	{
		0x00 = dwArgA8;
		Eq_2 a0_159 = &s1_101->dw0018 + 1 + s3_118 / 28;
		Eq_556150 a5_163;
		Eq_2 a2_166;
		word32 a7_325;
		word32 a4_323;
		word32 a6_324;
		word32 a3_322;
		word32 a1_321;
		memcpy(a0_159, a1_140, dwArg48, out a1_321, out a2_166, out a3_322, out a4_323, out a5_163, out a6_324, out a7_325);
		s1Out.u0 = <invalid>;
		a2Out = a2_166;
		a5Out = a5_163;
		return <invalid>;
	}
}

// 23099560: Register Eq_2 mbedtls_sha1_update(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 (ptr32 Eq_549997)) a5, Stack word32 dwArg1C, Stack Eq_2 dwArg48, Stack word32 dwArgA8, Stack word32 dwArg0128, Register out (ptr32 (ptr32 Eq_549997)) a5Out)
// Called from:
//      sha1_update_wrap
//      mbedtls_sha1_finish
//      mbedtls_sha1
Eq_2 mbedtls_sha1_update(Eq_2 a1, Eq_2 a2, struct Eq_549997 ** a5, word32 dwArg1C, Eq_2 dwArg48, word32 dwArgA8, word32 dwArg0128, struct Eq_549997 & a5Out)
{
	if (a2 == 0x00)
	{
		a5Out = a5;
		return a2;
	}
	else
	{
		Eq_2 a2_9;
		struct Eq_549997 ** a5_12;
		word32 s1_94;
		mbedtls_sha1_update.part.0(a1, a2, a5, dwArg1C, dwArg48, dwArgA8, dwArg0128, out s1_94, out a2_9, out a5_12);
		a5Out = a5_12;
		return a2_9;
	}
}

// 23099568: void mbedtls_sha1_finish(Register ui32 a2, Stack Eq_2 dwArg28, Stack word32 dwArg88, Stack word32 dwArg0108)
// Called from:
//      sha1_finish_wrap
//      mbedtls_sha1
void mbedtls_sha1_finish(ui32 a2, Eq_2 dwArg28, word32 dwArg88, word32 dwArg0108)
{
	struct Eq_549997 ** a5_43;
	if ((a2 & 63) <= 55)
		a5_43 = (struct Eq_549997 **) 56;
	else
		a5_43 = (struct Eq_549997 **) 0x0078;
	struct Eq_549997 ** a5_59;
	mbedtls_sha1_update(588028248, a5_43 - (a2 & 63), a5_43, dwLoc04, dwArg28, dwArg88, dwArg0108, out a5_59);
	struct Eq_556297 * s1_94;
	word32 a5_186;
	word32 a2_185;
	struct Eq_556281 * s0_93 = mbedtls_sha1_update.part.0(fp + ~0x17, 0x08, a5_59, dwLoc04, dwArg28, dwArg88, dwArg0108, out s1_94, out a2_185, out a5_186);
	s1_94->b0000 = (byte) (word32) s0_93->b000B;
	uint32 a5_115 = (word32) s0_93->w000A;
	s1_94->b0001 = (byte) a5_115;
	s1_94->b0002 = (byte) (a5_115 >> 8);
	struct Eq_556333 * s0_120 = (a5_115 >> 8)->ptr0008;
	s1_94->b0003 = (byte) (a5_115 >> 8);
	s1_94->b0004 = (byte) (word32) s0_120->b000F;
	uint32 a5_124 = (word32) s0_120->w000E;
	s1_94->b0005 = (byte) a5_124;
	s1_94->b0006 = (byte) (a5_124 >> 8);
	struct Eq_556366 * s0_129 = (a5_124 >> 8)->ptr000C;
	s1_94->b0007 = (byte) (a5_124 >> 8);
	s1_94->b0008 = (byte) (word32) s0_129->b0013;
	uint32 a5_133 = (word32) s0_129->w0012;
	s1_94->b0009 = (byte) a5_133;
	s1_94->b000A = (byte) (a5_133 >> 8);
	struct Eq_556399 * s0_138 = (a5_133 >> 8)->ptr0010;
	s1_94->b000B = (byte) (a5_133 >> 8);
	s1_94->b000C = (byte) (word32) s0_138->b0017;
	uint32 a5_142 = (word32) s0_138->w0016;
	s1_94->b000D = (byte) a5_142;
	s1_94->b000E = (byte) (a5_142 >> 8);
	struct Eq_556432 * s0_147 = (a5_142 >> 8)->ptr0014;
	s1_94->b000F = (byte) (a5_142 >> 8);
	s1_94->b0010 = (byte) (word32) s0_147->b001B;
	uint32 a5_152 = (word32) s0_147->w001A;
	s1_94->b0011 = (byte) a5_152;
	s1_94->b0012 = (byte) (a5_152 >> 8);
	s1_94->b0013 = (byte) (a5_152 >> 8);
}

