pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 23099696: void mbedtls_sha1(Register Eq_2 ra, Register Eq_2 a0, Stack word32 dwArg08, Stack word32 dwArg28, Stack word32 dwArg88, Stack word32 dwArgA8)
void mbedtls_sha1(Eq_2 ra, Eq_2 a0, word32 dwArg08, word32 dwArg28, word32 dwArg88, word32 dwArgA8)
{
	word32 a5_112;
	mbedtls_sha1_finish(mbedtls_sha1_update(a0, mbedtls_sha1_init(ra, fp + -0x006C), mbedtls_sha1_starts(fp + -0x006C), dwLoc64, dwLoc38, dwArg28, dwArgA8, out a5_112), dwLoc58, dwArg08, dwArg88);
	mbedtls_sha1_free(fp + -0x006C);
}

// 230996D4: Register (ptr32 Eq_505993) mbedtls_ssl_ciphersuite_from_id(Register (ptr32 Eq_505993) a0, Register (ptr32 Eq_505993) a4, Register out (ptr32 Eq_505993) a5Out)
// Called from:
//      mbedtls_ssl_list_ciphersuites
//      mbedtls_ssl_get_ciphersuite_name
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
struct Eq_505993 * mbedtls_ssl_ciphersuite_from_id(struct Eq_505993 * a0, struct Eq_505993 * a4, struct Eq_505993 & a5Out)
{
	do
	{
		struct Eq_505993 * a5_10 = a4->ptr0000;
		if (a4 == null)
		{
			a5_10 = null;
			break;
		}
	} while (a4 != a0);
	a5Out = a5_10;
	return a5_10;
}

// 230996F0: Register (ptr32 int32) mbedtls_ssl_list_ciphersuites(Register out (ptr32 int32) s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out (ptr32 Eq_505993) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mbedtls_ssl_config_defaults
int32 * mbedtls_ssl_list_ciphersuites(int32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, struct Eq_505993 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	int32 * s1_112;
	struct Eq_505993 * a4_5 = g_ptr4200F720;
	s1_112 = s1;
	if (a4_5 == null)
	{
		word32 * s0_22 = &g_dw4201E90C;
		s2 = 0x4200F720;
		s1_112 = &g_dw230C9A58;
		s5 = 1107421472;
		while (true)
		{
			s3 = *s1_112;
			if (s3 == null || s0_22 >= &g_dw4201E920)
				break;
			word32 a5_125;
			if (mbedtls_ssl_ciphersuite_from_id(s3, a4_5, out a5_125) != null)
			{
				*s0_22 = s3;
				++s0_22;
			}
			++s1_112;
		}
		*s0_22 = 0x00;
		g_ptr4200F720 = (struct Eq_505993 *) 0x01;
	}
	s1Out = s1_112;
	a0Out = 1107421452;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	return s1;
}

// 23099762: Register (ptr32 Eq_505993) mbedtls_ssl_get_ciphersuite_name(Register (ptr32 Eq_505993) a0, Register (ptr32 Eq_505993) a4)
// Called from:
//      mbedtls_ssl_derive_keys
struct Eq_505993 * mbedtls_ssl_get_ciphersuite_name(struct Eq_505993 * a0, struct Eq_505993 * a4)
{
	struct Eq_505993 * a0_11;
	word32 a5_22;
	struct Eq_556545 * a0_8 = mbedtls_ssl_ciphersuite_from_id(a0, a4, out a5_22);
	if (a0_8 != null)
		a0_11 = a0_8->ptr0004;
	else
		a0_11 = (struct Eq_505993 *) &g_t230B6434;
	return a0_11;
}

// 2309977E: Register (ptr32 Eq_556567) mbedtls_ssl_get_ciphersuite_sig_pk_alg(Register (ptr32 Eq_556567) a0)
// Called from:
//      mbedtls_ssl_handshake_server_step
struct Eq_556567 * mbedtls_ssl_get_ciphersuite_sig_pk_alg(struct Eq_556567 * a0)
{
	struct Eq_556567 * a0_11;
	up32 a0_5 = (word32) a0->b000A;
	if (a0_5 > 0x0A)
	{
		a0_11 = null;
		return a0_11;
	}
	else
	{
		ui32 a5_9 = 0x01 << a0_5;
		a0_11 = (struct Eq_556567 *) 0x01;
		if ((a5_9 & 0x008E) != 0x00)
			return a0_11;
		a0_11 = (struct Eq_556567 *) 0x02;
		if ((a5_9 & 0x0600) != 0x00)
			return a0_11;
		return (word32) ((a5_9 & 0x10) != 0x00) << 2;
	}
}

// 230997AC: void mbedtls_ssl_own_key(Register (ptr32 Eq_556597) a5)
void mbedtls_ssl_own_key(struct Eq_556597 * a5)
{
	if (a5 != null)
	{
		a5 = a5->ptr0008;
		if (a5 != null)
			return;
	}
	if (a5->dw004C == 0x00)
		;
}

// 230997C0: void mbedtls_ssl_hs_hdr_len.isra.0(Register (ptr32 Eq_556610) a0)
void mbedtls_ssl_hs_hdr_len.isra.0(struct Eq_556610 * a0)
{
	if (((word32) a0->w0074 & 0x02) == 0x00)
		;
}

// 230997D0: Register Eq_2 mbedtls_ssl_handshake_client_step(Register Eq_2 ra, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg88, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_507765) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_handshake_step
Eq_2 mbedtls_ssl_handshake_client_step(Eq_2 ra, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg88, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_507765 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	struct Eq_556619 * sp_1690 = fp + -0x00A0;
	if (a5 == 0x10)
	{
l23099918:
		goto l2309988A;
	}
	Eq_2 a0_33 = *(union Eq_2 *) 0x40;
	if (false)
		goto l23099918;
	Eq_2 a5_43;
	Eq_2 s11_50;
	word32 t4_1844;
	word32 s10_1843;
	word32 s9_1842;
	word32 s8_1841;
	word32 s7_1840;
	word32 s5_1838;
	word32 s6_1839;
	word32 a7_1836;
	word32 s4_1837;
	word32 a4_1835;
	word32 a1_1832;
	word32 a2_1833;
	word32 a3_1834;
	mbedtls_debug_print_msg(ra, a0_33, 0x02, &g_t230C9DD0, a5, out a1_1832, out a2_1833, out a3_1834, out a4_1835, out a5_43, out a7_1836, out s4_1837, out s5_1838, out s6_1839, out s7_1840, out s8_1841, out s9_1842, out s10_1843, out s11_50, out t4_1844);
	Eq_2 a0_62;
	Eq_2 s2_74;
	word32 s10_1853;
	word32 s9_1852;
	word32 s7_1851;
	word32 s5_1850;
	word32 s4_1849;
	word32 a3_1847;
	word32 a4_1848;
	word32 a2_1846;
	word32 a1_1845;
	Eq_2 s11_108;
	mbedtls_ssl_flush_output(ra, s11_50, a5_43, dwArg88, out s1, out a0_62, out a1_1845, out a2_1846, out a3_1847, out a4_1848, out a5, out s2_74, out s3, out s4_1849, out s5_1850, out s7_1851, out s9_1852, out s10_1853, out s11_108);
	Eq_2 s0_105 = a0_62;
	if (a0_62 == 0x00)
	{
		if (((word32) *((word32) *s11_108 + 116) & 0x02) != 0x00 && (word32) (*((word32) (*((word32) s11_108 + 48)) + 52)) == 0x01)
		{
			word32 a0_125;
			word32 s10_1890;
			word32 s9_1889;
			word32 s7_1888;
			word32 s6_1887;
			word32 s5_1886;
			word32 s4_1885;
			word32 s2_1884;
			word32 a4_1883;
			word32 a3_1882;
			word32 a2_1881;
			word32 a1_1880;
			ra = mbedtls_ssl_resend(ra, a0_62, s11_108, 0x01, s2_74, mstatus, dwArg88, out s0_105, out s1, out a0_125, out a1_1880, out a2_1881, out a3_1882, out a4_1883, out a5, out s2_1884, out s3, out s4_1885, out s5_1886, out s6_1887, out s7_1888, out s9_1889, out s10_1890, out s11_108, out mstatus);
			if (a0_125 != 0x00)
				goto l2309988A;
		}
		if (*((word32) s11_108 + 4) == 0x0C && *((word32) (*((word32) s11_108 + 48)) + 344) != 0x00)
			((word32) s11_108 + 4)->u0 = 0x11;
		a5 = *((word32) s11_108 + 4);
		if (a5 > 0x11)
		{
			word32 t4_1867;
			word32 s11_1866;
			word32 s10_1865;
			word32 s9_1864;
			word32 s7_1862;
			word32 s8_1863;
			word32 s5_1860;
			word32 s6_1861;
			word32 s4_1859;
			word32 a7_1858;
			word32 a4_1857;
			word32 a3_1856;
			word32 a2_1855;
			word32 a1_1854;
			mbedtls_debug_print_msg(ra, s11_108, 0x01, &g_t230CA894, a5, out a1_1854, out a2_1855, out a3_1856, out a4_1857, out a5, out a7_1858, out s4_1859, out s5_1860, out s6_1861, out s7_1862, out s8_1863, out s9_1864, out s10_1865, out s11_1866, out t4_1867);
			goto l23099918;
		}
		switch (*((word32) s11_108 + 4))
		{
		case 0x00:
			((word32) s11_108 + 4)->u0 = 0x01;
			break;
		case 0x01:
			struct Eq_556797 * a2_157;
			struct Eq_556798 * a4_159;
			Eq_2 s11_162;
			word32 t4_1879;
			word32 s10_1878;
			word32 s9_1877;
			word32 s8_1876;
			word32 s7_1875;
			word32 s5_1873;
			word32 s6_1874;
			word32 a7_1871;
			word32 s4_1872;
			word32 a3_1869;
			word32 a5_1870;
			word32 a1_1868;
			mbedtls_debug_print_msg(ra, s11_108, 0x02, &g_t230C9DE4, a5, out a1_1868, out a2_157, out a3_1869, out a4_159, out a5_1870, out a7_1871, out s4_1872, out s5_1873, out s6_1874, out s7_1875, out s8_1876, out s9_1877, out s10_1878, out s11_162, out t4_1879);
			Eq_2 a5_174 = a4_159->t0018;
			if (a4_159 == null)
			{
				word32 t4_1904;
				word32 s10_1902;
				word32 s11_1903;
				word32 s8_1900;
				word32 s9_1901;
				word32 s6_1898;
				word32 s7_1899;
				word32 s5_1897;
				word32 s4_1896;
				word32 a7_1895;
				word32 a4_1894;
				word32 a3_1893;
				word32 a2_1892;
				word32 a1_1891;
				mbedtls_debug_print_msg(ra, s11_162, 0x01, &g_t230C9DFC, a5_174, out a1_1891, out a2_1892, out a3_1893, out a4_1894, out a5, out a7_1895, out s4_1896, out s5_1897, out s6_1898, out s7_1899, out s8_1900, out s9_1901, out s10_1902, out s11_1903, out t4_1904);
			}
			else
			{
				*((word32) s11_162 + 8) = (word32) *((word32) a5_174 + 114);
				*((word32) s11_162 + 0x0C) = (word32) *((word32) a5_174 + 115);
				Eq_2 a0_179 = (word32) *((word32) a5_174 + 112);
				if (a0_179 == 0x00)
				{
					word32 s11_1924;
					word32 t4_1925;
					word32 s9_1922;
					word32 s10_1923;
					word32 s7_1920;
					word32 s8_1921;
					word32 s5_1918;
					word32 s6_1919;
					word32 a7_1916;
					word32 s4_1917;
					word32 a3_1914;
					word32 a4_1915;
					word32 a1_1912;
					word32 a2_1913;
					mbedtls_debug_print_msg(ra, s11_162, 0x01, &g_t230C9E0C, a5_174, out a1_1912, out a2_1913, out a3_1914, out a4_1915, out a5, out a7_1916, out s4_1917, out s5_1918, out s6_1919, out s7_1920, out s8_1921, out s9_1922, out s10_1923, out s11_1924, out t4_1925);
					goto l23099918;
				}
				Eq_2 a5_1573;
				Eq_2 a3_1575;
				struct Eq_556928 * s5_181 = *((word32) s11_162 + 0x00A0);
				mbedtls_ssl_write_version(a0_179, (word32) a2_157->ptr0074->b0071, a2_157 >> 1 & 0x01, &s5_181->b0004);
				word32 a7_1910;
				word32 t4_1911;
				word32 a4_1908;
				word32 a5_1909;
				word32 a2_1906;
				word32 a3_1907;
				word32 a1_1905;
				word32 s4_206;
				word32 s6_208;
				word32 s7_209;
				word32 s8_210;
				word32 s9_211;
				word32 s10_204;
				struct Eq_556960 * s5_207;
				Eq_2 s11_1714;
				Eq_2 a0_197 = mbedtls_debug_print_msg(ra, s11_162, 0x03, &g_t230C9E64, (word32) s5_181->b0004, out a1_1905, out a2_1906, out a3_1907, out a4_1908, out a5_1909, out a7_1910, out s4_206, out s5_207, out s6_208, out s7_209, out s8_210, out s9_211, out s10_204, out s11_1714, out t4_1911);
				ui32 a4_218 = (word32) *((word32) *s11_1714 + 116);
				struct Eq_556994 * s2_217 = *((word32) s11_1714 + 48);
				<anonymous> * a4_219 = a4_218 & 0x02;
				if ((a4_218 & 0x02) != 0x00)
				{
					a4_219 = s2_217->ptr0024;
					if (a4_219 != null)
						goto l23099970;
				}
				word32 s2_255;
				word32 s4_257;
				word32 s5_258;
				word32 s6_259;
				word32 s7_260;
				word32 s8_261;
				word32 s9_262;
				word32 s10_263;
				word32 s11_264;
				Eq_2 a0_265;
				<anonymous> * a4_267;
				word32 a6_275;
				word32 t3_276;
				word32 t0_277;
				word32 tp_278;
				word32 t2_280;
				word32 t6_281;
				a4_219();
				s0_105 = a0_265;
				if (a0_265 != 0x00)
				{
l23099C30:
					a5_1573 = s0_105;
					a3_1575.u0 = 759;
					goto l23099F16;
				}
				Eq_2 a0_302;
				word32 a6_312;
				word32 t3_313;
				word32 t0_314;
				word32 tp_315;
				word32 t2_317;
				word32 t6_318;
				a4_267();
				s0_105 = a0_302;
				if (a0_302 != 0x00)
					goto l23099C30;
l23099970:
				Eq_2 a6_375;
				struct Eq_556994 * a1_327 = *((word32) s11_1714 + 48);
				Eq_2 a5_329 = (char *) s5_207 + 6;
				sp_1690->t008C = a5_329;
				Eq_2 a5_336;
				word32 a6_1930;
				word32 a7_1931;
				word32 a3_1928;
				word32 a4_1929;
				word32 a1_1926;
				word32 a2_1927;
				memcpy(a5_329, (char *) &a1_327->ptr0024 + 0x00B4, 32, out a1_1926, out a2_1927, out a3_1928, out a4_1929, out a5_336, out a6_1930, out a7_1931);
				word32 a4_1935;
				word32 a5_1936;
				word32 a7_1937;
				word32 a3_1934;
				word32 a0_358;
				word32 a1_1932;
				word32 a2_1933;
				mbedtls_debug_print_buf(ra, 0x03, a5_336, out a0_358, out a1_1932, out a2_1933, out a3_1934, out a4_1935, out a5_1936, out a7_1937);
				struct Eq_557108 * a5_370 = (struct Eq_557108 *) 0x10;
				Eq_2 a6_371 = *((word32) *((word32) s11_1714 + 44) + 8);
				if (a6_371 <= ~0x1F)
				{
					a5_370 = (struct Eq_557108 *) *((word32) *((word32) s11_1714 + 48) + 328);
					a6_375 = a6_371;
					if (a5_370 == null)
						goto l230999C2;
				}
				else
				{
l230999C2:
					a6_375.u0 = 0x00;
				}
				if (a5_370 != null)
				{
					word32 a1_381 = a5_370->dw0068;
					if (a5_370 == null)
						goto l230999F0;
					word32 a0_445;
					word32 a6_455;
					word32 t3_456;
					word32 t0_457;
					word32 tp_458;
					word32 t2_460;
					word32 t6_461;
					(a6_371 + -16)();
					if (a0_445 == 0x00)
					{
						*(union Eq_2 *) 0x28 = *((word32) s11_1714 + 44);
						a6_375.u0 = 32;
						goto l230999F0;
					}
				}
				else
				{
l230999F0:
					s5_207->b0026 = (byte) a6_375;
					Eq_2 s0_468 = &s5_207->b0026 + 1;
					Eq_2 a5_472 = 0x00;
					while (a6_375 != a5_472)
					{
						Mem483[s5_207 + a5_472 + 39:byte] = SLICE(CONVERT(Mem476[Mem476[s11_1714 + 44:int32] + a5_472 + 0x0C:byte], byte, word32), byte, 0);
						a5_472 = (word32) a5_472 + 1;
					}
					sp_1690->t008C = a6_375;
					word32 s9_1960;
					word32 s8_1959;
					word32 s7_1958;
					word32 s6_1957;
					word32 s5_1956;
					word32 a7_1955;
					word32 a5_1954;
					word32 a4_1953;
					word32 a2_1951;
					word32 a3_1952;
					word32 a1_1950;
					word32 s10_1961;
					word32 t4_1962;
					struct Eq_557231 * s4_509;
					Eq_2 s11_1717;
					mbedtls_debug_print_msg(ra, s11_1714, 0x03, &g_t230C9EA4, a6_375, out a1_1950, out a2_1951, out a3_1952, out a4_1953, out a5_1954, out a7_1955, out s4_509, out s5_1956, out s6_1957, out s7_1958, out s8_1959, out s9_1960, out s10_1961, out s11_1717, out t4_1962);
					word32 a0_1963;
					word32 a1_1964;
					word32 a2_1965;
					word32 a4_1966;
					word32 a5_1967;
					word32 a7_1968;
					struct Eq_505993 * a3_1718;
					mbedtls_debug_print_buf(ra, 0x03, s0_468, out a0_1963, out a1_1964, out a2_1965, out a3_1718, out a4_1966, out a5_1967, out a7_1968);
					ui32 a5_539 = (word32) *((word32) *s11_1717 + 116);
					if ((a5_539 & 0x02) != 0x00)
					{
						if ((a5_539 & 0x02) == 0x00)
						{
							byte * s4_600;
							word32 a1_1981;
							word32 a2_1982;
							word32 a4_1983;
							word32 a5_1984;
							word32 a7_1985;
							word32 s5_1986;
							word32 s6_1987;
							word32 s7_1988;
							word32 s8_1989;
							word32 s9_1990;
							word32 s10_1991;
							word32 t4_1992;
							mbedtls_debug_print_msg(ra, s11_1717, 0x03, &g_t230C9EE4, a5_539 & 0x02, out a1_1981, out a2_1982, out a3_1718, out a4_1983, out a5_1984, out a7_1985, out s4_600, out s5_1986, out s6_1987, out s7_1988, out s8_1989, out s9_1990, out s10_1991, out s11_1717, out t4_1992);
							*s4_600 = 0x00;
							s4_509 = (struct Eq_557231 *) &s4_509->b0001;
						}
						else
						{
							Eq_2 a1_553;
							word32 a0_1969;
							word32 a2_1970;
							word32 a3_1971;
							word32 a4_1972;
							word32 a5_1973;
							word32 a7_1974;
							mbedtls_debug_print_buf(ra, 0x03, a5_539 & 0x02, out a0_1969, out a1_553, out a2_1970, out a3_1971, out a4_1972, out a5_1973, out a7_1974);
							s4_509->b0000 = (byte) (word32) *((word32) *((word32) s11_1717 + 48) + 40);
							word32 a1_1975;
							word32 a2_1976;
							word32 a4_1977;
							word32 a5_1978;
							word32 a6_1979;
							word32 a7_1980;
							memcpy(&s4_509->b0001, a1_553, (word32) *((word32) *((word32) s11_1717 + 48) + 40), out a1_1975, out a2_1976, out a3_1718, out a4_1977, out a5_1978, out a6_1979, out a7_1980);
							s4_509 = (struct Eq_557231 *) (&s4_509->b0001 + (word32) (*((word32) (*((word32) s11_1717 + 48)) + 40)));
						}
					}
					Eq_30694 a4_614 = *((word32) s11_1717 + 0x0C);
					struct Eq_557285 * s3_1726 = &s4_509->b0001 + 1;
					struct Eq_505993 * a4_1716 = a4_614 << 2;
					int32 * s2_620 = *((word32) *s11_1717 + a4_614 * 0x04);
					word32 s0_1725 = 0x00;
					word32 s6_1720 = 0x230CA000;
					while (true)
					{
						struct Eq_505993 * a0_625 = *s2_620;
						if (a0_625 == null)
							break;
						word32 a5_1993;
						if (mbedtls_ssl_ciphersuite_from_id(a0_625, a4_1716, out a5_1993) != null)
						{
							struct Eq_557272 * a5_630 = *s11_1717;
							a4_1716 = (word32) a5_630->b0071;
							if (a4_1716 >= a3_1718)
							{
								a4_1716 = (word32) a5_630->b0073;
								struct Eq_557915 * a0_635 = a3_1718->ptr0018;
								if (a3_1718 >= a4_1716 && (((word32) a5_630->t0074 & 0x02) == 0x00 || ((word32) a0_635->b001C & 0x04) == 0x00))
								{
									word32 a1_2096;
									word32 a2_2097;
									word32 a5_2098;
									word32 a7_2099;
									word32 s5_2100;
									word32 s7_2101;
									word32 s8_2102;
									word32 s9_2103;
									word32 s10_2104;
									word32 t4_2105;
									mbedtls_debug_print_msg(ra, s11_1717, 0x03, s6_1720 + -232, *s2_620, out a1_2096, out a2_2097, out a3_1718, out a4_1716, out a5_2098, out a7_2099, out s4_509, out s5_2100, out s6_1720, out s7_2101, out s8_2102, out s9_2103, out s10_2104, out s11_1717, out t4_2105);
									++s3_1726;
									s3_1726[0x07FF] = (struct Eq_557285) (byte) (*s2_620 >> 8);
									s3_1726->b0FFF = (byte) *s2_620;
									++s0_1725;
								}
							}
						}
						++s2_620;
					}
					s3_1726->b0001 = ~0x00;
					s3_1726->b0000 = 0x00;
					Eq_2 a5_689 = s0_1725 + 1;
					s4_509->b0000 = (byte) (a5_689 >> 0x07);
					s4_509->b0001 = (byte) (a5_689 << 0x01);
					Eq_2 s11_711;
					word32 a1_1994;
					word32 a2_1995;
					word32 a3_1996;
					word32 a4_1997;
					word32 a5_1998;
					word32 a7_1999;
					word32 s4_2000;
					word32 s5_2001;
					word32 s6_2002;
					word32 s7_2003;
					word32 s8_2004;
					word32 s9_2005;
					word32 s10_2006;
					word32 t4_2007;
					mbedtls_debug_print_msg(ra, s11_1717, 0x03, &g_t230C9F3C, a5_689, out a1_1994, out a2_1995, out a3_1996, out a4_1997, out a5_1998, out a7_1999, out s4_2000, out s5_2001, out s6_2002, out s7_2003, out s8_2004, out s9_2005, out s10_2006, out s11_711, out t4_2007);
					Eq_2 s11_737;
					word32 a1_2008;
					word32 a2_2009;
					word32 a3_2010;
					word32 a4_2011;
					word32 a5_2012;
					word32 a7_2013;
					word32 s4_2014;
					word32 s5_2015;
					word32 s6_2016;
					word32 s7_2017;
					word32 s8_2018;
					word32 s9_2019;
					word32 s10_2020;
					word32 t4_2021;
					mbedtls_debug_print_msg(ra, s11_711, 0x03, &g_t230C9F60, 0x01, out a1_2008, out a2_2009, out a3_2010, out a4_2011, out a5_2012, out a7_2013, out s4_2014, out s5_2015, out s6_2016, out s7_2017, out s8_2018, out s9_2019, out s10_2020, out s11_737, out t4_2021);
					word32 a1_2022;
					word32 a2_2023;
					word32 a3_2024;
					word32 a4_2025;
					word32 a5_2026;
					word32 a7_2027;
					word32 s4_2028;
					word32 s5_2029;
					word32 s6_2030;
					word32 s7_2031;
					word32 s8_2032;
					word32 s9_2033;
					word32 s10_2034;
					word32 t4_2035;
					Eq_2 s11_1003;
					mbedtls_debug_print_msg(ra, s11_737, 0x03, &g_t230C9F80, 0x00, out a1_2022, out a2_2023, out a3_2024, out a4_2025, out a5_2026, out a7_2027, out s4_2028, out s5_2029, out s6_2030, out s7_2031, out s8_2032, out s9_2033, out s10_2034, out s11_1003, out t4_2035);
					s3_1726[1] = (struct Eq_557285) 0x01;
					s3_1726->b0003 = 0x00;
					Eq_2 a5_777 = *((word32) s11_1003 + 0x00B4);
					ptr32 s4_1015 = s3_1726 + 2;
					word32 s7_780 = 0x00;
					if (a5_777 != 0x00)
					{
						struct Eq_557570 * s0_781 = *((word32) s11_1003 + 0x00A0);
						struct Eq_557574 * s6_801;
						word32 a1_2036;
						word32 a2_2037;
						word32 a3_2038;
						word32 a4_2039;
						word32 a5_2040;
						word32 a7_2041;
						word32 s5_2042;
						word32 s7_2043;
						word32 s8_2044;
						word32 s9_2045;
						word32 s10_2046;
						word32 t4_2047;
						mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t230C9FA0, a5_777, out a1_2036, out a2_2037, out a3_2038, out a4_2039, out a5_2040, out a7_2041, out s4_1015, out s5_2042, out s6_801, out s7_2043, out s8_2044, out s9_2045, out s10_2046, out s11_1003, out t4_2047);
						Eq_2 a5_813;
						word32 a1_2048;
						word32 a2_2049;
						word32 a3_2050;
						word32 a4_2051;
						Eq_2 a0_810 = strlen(*((word32) s11_1003 + 0x00B4), out a1_2048, out a2_2049, out a3_2050, out a4_2051, out a5_813);
						if (s0_781 + 0x04000000 >=u s6_801)
						{
							s7_780 = (word32) a0_810 + 9;
							if (s0_781 + 0x04000000 - s6_801 <u a0_810 + 9)
								goto l23099B52;
							s3_1726[4] = (struct Eq_557285) (byte) ((word32) a0_810 + 5 >> 8);
							s3_1726->b0009 = (byte) ((a0_810 & 0x00FF) + 5);
							s3_1726[5] = (struct Eq_557285) (byte) ((word32) a0_810 + 3 >> 8);
							s3_1726->b000B = (byte) ((a0_810 & 0x00FF) + 3);
							s3_1726[3] = (struct Eq_557285) 0x00;
							s3_1726->b0007 = 0x00;
							s3_1726[6] = (struct Eq_557285) 0x00;
							s3_1726->b000D = (byte) (a0_810 >> 0x08);
							s3_1726[7] = (struct Eq_557285) (byte) (a0_810 & 0x00FF);
							word32 a1_2065;
							word32 a2_2066;
							word32 a3_2067;
							word32 a4_2068;
							word32 a5_2069;
							word32 a6_2070;
							word32 a7_2071;
							memcpy(&s3_1726->b000E + 1, *((word32) s11_1003 + 0x00B4), a0_810, out a1_2065, out a2_2066, out a3_2067, out a4_2068, out a5_2069, out a6_2070, out a7_2071);
						}
						else
						{
l23099B52:
							word32 a1_2052;
							word32 a2_2053;
							word32 a3_2054;
							word32 a4_2055;
							word32 a5_2056;
							word32 a7_2057;
							word32 s5_2058;
							word32 s6_2059;
							word32 s7_2060;
							word32 s8_2061;
							word32 s9_2062;
							word32 s10_2063;
							word32 t4_2064;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t230C9FD0, a5_813, out a1_2052, out a2_2053, out a3_2054, out a4_2055, out a5_2056, out a7_2057, out s4_1015, out s5_2058, out s6_2059, out s7_2060, out s8_2061, out s9_2062, out s10_2063, out s11_1003, out t4_2064);
							s7_780 = 0x00;
						}
					}
					uint32 a5_1001 = 0x00;
					if ((word32) *((word32) *s11_1003 + 113) == 0x03)
					{
						struct Eq_557570 * s2_895 = *((word32) s11_1003 + 0x00A0);
						word32 a1_2072;
						word32 a2_2073;
						word32 a3_2074;
						word32 a4_2075;
						word32 a5_2076;
						word32 a7_2077;
						word32 s5_2078;
						word32 s6_2079;
						word32 s8_2080;
						word32 s9_2081;
						word32 s10_2082;
						word32 t4_2083;
						Eq_2 a0_897 = mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t230C9FE4, 0x00, out a1_2072, out a2_2073, out a3_2074, out a4_2075, out a5_2076, out a7_2077, out s4_1015, out s5_2078, out s6_2079, out s7_780, out s8_2080, out s9_2081, out s10_2082, out s11_1003, out t4_2083);
						Eq_583276 s9_917[] = *((word32) *s11_1003 + 88);
						Eq_2 a5_918 = 0x00;
						while (s9_917[a5_918].dw0000 != 0x00)
							a5_918 = (word32) a5_918 + 2;
						struct Eq_557802 * s0_930 = s7_780 + 2 + s4_1015;
						if (s2_895 + 0x04000000 >=u s0_930)
						{
							a5_918 = (word32) a5_918 + 6;
							if (s2_895 + 0x04000000 - s0_930 <u a5_918)
								goto l23099D4C;
							word32 s8_968 = s0_930 + 6;
							uint32 a5_969 = 0x00;
							while (true)
							{
								uint32 s2_976 = a5_969 + 2;
								if (a0_897 == 0x00)
									break;
								a0_897 = mbedtls_ssl_hash_from_md_alg(a0_897);
								s8_968->b0000 = (byte) a0_897;
								s8_968->b0001 = 0x01;
								a5_969 = s2_976;
								s8_968 += 0x02;
							}
							s0_930->b0001 = 0x0D;
							ui32 a4_988 = a5_969 & 0x00FF;
							s0_930->b0003 = (byte) (a4_988 + 2);
							s0_930->b0000 = 0x00;
							s0_930[1] = (struct Eq_557802) (byte) (s2_976 >> 0x08);
							s0_930[2] = (struct Eq_557802) (byte) (a5_969 >> 0x08);
							s0_930->b0005 = (byte) a4_988;
							a5_1001 = a5_969 + 0x06;
						}
						else
						{
l23099D4C:
							word32 a1_2084;
