pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
							word32 a2_2085;
							word32 a3_2086;
							word32 a4_2087;
							word32 a5_2088;
							word32 a7_2089;
							word32 s5_2090;
							word32 s6_2091;
							word32 s8_2092;
							word32 s9_2093;
							word32 s10_2094;
							word32 t4_2095;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t230C9FD0, a5_918, out a1_2084, out a2_2085, out a3_2086, out a4_2087, out a5_2088, out a7_2089, out s4_1015, out s5_2090, out s6_2091, out s7_780, out s8_2092, out s9_2093, out s10_2094, out s11_1003, out t4_2095);
							a5_1001 = 0x00;
						}
					}
					word32 s7_1002 = s7_780 + a5_1001;
					word32 a5_1009 = 0x00;
					if (((word32) *((word32) *s11_1003 + 116) & 448) != 0x00)
					{
						struct Eq_557570 * s2_1011 = *((word32) s11_1003 + 0x00A0);
						word32 a1_2106;
						word32 a2_2107;
						word32 a3_2108;
						word32 a4_2109;
						word32 a7_2110;
						word32 s5_2111;
						word32 s6_2112;
						word32 s8_2113;
						word32 s9_2114;
						word32 s10_2115;
						word32 t4_2116;
						Eq_2 a5_1030;
						mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t230CA018, 0x04000000, out a1_2106, out a2_2107, out a3_2108, out a4_2109, out a5_1030, out a7_2110, out s4_1015, out s5_2111, out s6_2112, out s7_1002, out s8_2113, out s9_2114, out s10_2115, out s11_1003, out t4_2116);
						struct Eq_558037 * s0_1018 = s7_1002 + 2 + s4_1015;
						if (s2_1011 + 0x04000000 >=u s0_1018)
						{
							a5_1030.u0 = 0x04;
							if (s2_1011 + 0x04000000 - s0_1018 <=u 0x04)
								goto l23099DAC;
							s0_1018->b0000 = 0x00;
							s0_1018->b0001 = 0x01;
							s0_1018[1] = (struct Eq_558037) 0x00;
							s0_1018->b0003 = 0x01;
							s0_1018[2] = (struct Eq_558037) (byte) (*((word32) *s11_1003 + 116) >> 6 & 0x07);
							a5_1009 = 0x05;
						}
						else
						{
l23099DAC:
							word32 a1_2117;
							word32 a2_2118;
							word32 a3_2119;
							word32 a4_2120;
							word32 a5_2121;
							word32 a7_2122;
							word32 s5_2123;
							word32 s6_2124;
							word32 s8_2125;
							word32 s9_2126;
							word32 s10_2127;
							word32 t4_2128;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t230C9FD0, a5_1030, out a1_2117, out a2_2118, out a3_2119, out a4_2120, out a5_2121, out a7_2122, out s4_1015, out s5_2123, out s6_2124, out s7_1002, out s8_2125, out s9_2126, out s10_2127, out s11_1003, out t4_2128);
							a5_1009 = 0x00;
						}
					}
					word32 s7_1093 = s7_1002 + a5_1009;
					Eq_557990 s0_1098 = 0x00;
					Eq_2 a5_1099 = *((word32) *s11_1003 + 96);
					if (a5_1099 != 0x00)
					{
						up32 s8_1122;
						word32 a1_2129;
						word32 a2_2130;
						word32 a3_2131;
						word32 a4_2132;
						word32 a5_2133;
						word32 a7_2134;
						word32 s5_2135;
						word32 s6_2136;
						word32 s9_2137;
						word32 s10_2138;
						word32 t4_2139;
						mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t230CA04C, a5_1099, out a1_2129, out a2_2130, out a3_2131, out a4_2132, out a5_2133, out a7_2134, out s4_1015, out s5_2135, out s6_2136, out s7_1093, out s8_1122, out s9_2137, out s10_2138, out s11_1003, out t4_2139);
						Eq_2 s2_1129 = *((word32) *s11_1003 + 96);
						while (true)
						{
							Eq_2 a0_1132 = *s2_1129;
							if (a0_1132 == 0x00)
								break;
							word32 a1_2140;
							word32 a2_2141;
							word32 a3_2142;
							word32 a4_2143;
							word32 a5_2144;
							s0_1098 = (word32) s0_1098 + ((strlen(a0_1132, out a1_2140, out a2_2141, out a3_2142, out a4_2143, out a5_2144) & 0x00FF) + 0x01);
							s2_1129 = (word32) s2_1129 + 4;
						}
						struct Eq_558190 * s2_1148 = s7_1093 + 2 + s4_1015;
						Eq_2 a5_1150 = s8_1122 + 0x04000000;
						if (s8_1122 + 0x04000000 >= s2_1148)
						{
							a5_1150 = s8_1122 + 0x04000000 - s2_1148;
							if (a5_1150 < (word32) s0_1098.u0 + 6)
								goto l23099E16;
							s2_1148->b0000 = 0x00;
							s2_1148->b0001 = 0x10;
							byte * s0_1158 = &s2_1148->b0005 + 1;
							Eq_2 s8_1159 = *((word32) *s11_1003 + 96);
							while (true)
							{
								Eq_2 a0_1162 = *s8_1159;
								if (a0_1162 == 0x00)
									break;
								word32 a1_2157;
								word32 a2_2158;
								word32 a3_2159;
								word32 a4_2160;
								word32 a5_2161;
								Eq_2 a0_1163 = strlen(a0_1162, out a1_2157, out a2_2158, out a3_2159, out a4_2160, out a5_2161);
								*s0_1158 = (byte) a0_1163;
								word32 a1_2162;
								word32 a2_2163;
								word32 a3_2164;
								word32 a4_2165;
								word32 a5_2166;
								word32 a6_2167;
								word32 a7_2168;
								memcpy(s0_1158 + 1, *s8_1159, a0_1163 & 0x00FF, out a1_2162, out a2_2163, out a3_2164, out a4_2165, out a5_2166, out a6_2167, out a7_2168);
								s8_1159 = (word32) s8_1159 + 4;
								s0_1158 += (word32) *s0_1158 + 0x01;
							}
							s0_1098 = s0_1158 - s2_1148;
							s2_1148->b0004 = (byte) ((word32) s0_1098.u0 - 6 >> 8);
							s2_1148->b0005 = (byte) ((s0_1098 & 0x00FF) + -6);
							s2_1148->b0002 = (byte) ((word32) s0_1098.u0 - 4 >> 8);
							s2_1148->b0003 = (byte) ((s0_1098 & 0x00FF) + ~0x03);
						}
						else
						{
l23099E16:
							word32 a1_2145;
							word32 a2_2146;
							word32 a3_2147;
							word32 a4_2148;
							word32 a5_2149;
							word32 a7_2150;
							word32 s5_2151;
							word32 s6_2152;
							word32 s8_2153;
							word32 s9_2154;
							word32 s10_2155;
							word32 t4_2156;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t230C9FD0, a5_1150, out a1_2145, out a2_2146, out a3_2147, out a4_2148, out a5_2149, out a7_2150, out s4_1015, out s5_2151, out s6_2152, out s7_1093, out s8_2153, out s9_2154, out s10_2155, out s11_1003, out t4_2156);
							s0_1098.u0 = 0x00;
						}
					}
					word32 s0_1244 = (word32) s0_1098 + s7_1093;
					word32 s7_1245 = 0x00;
					if (((word32) *((word32) *s11_1003 + 116) & 0x0200) != 0x00)
					{
						Eq_2 a5_1269;
						Eq_2 s8_1281;
						struct Eq_558386 * s9_1282;
						word32 a1_2180;
						word32 a2_2181;
						word32 a3_2182;
						word32 a4_2183;
						word32 a7_2184;
						word32 s4_2185;
						word32 s5_2186;
						word32 s6_2187;
						word32 s7_2188;
						word32 s10_2189;
						word32 t4_2190;
						mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t230CA070, *((word32) s11_1003 + 44), out a1_2180, out a2_2181, out a3_2182, out a4_2183, out a5_1269, out a7_2184, out s4_2185, out s5_2186, out s6_2187, out s7_2188, out s8_1281, out s9_1282, out s10_2189, out s11_1003, out t4_2190);
						struct Eq_558386 * s2_1257 = s0_1244 + 2 + s4_1015;
						if (s9_1282 >= s2_1257 && s9_1282 - s2_1257 >= (word32) s8_1281 + 4)
						{
							s2_1257->b0001 = 0x23;
							s2_1257->b0000 = 0x00;
							s2_1257->b0002 = (byte) (s8_1281 >> 0x08);
							s2_1257->b0003 = (byte) s8_1281;
							if (*((word32) *((word32) s11_1003 + 44) + 100) != 0x00 && s8_1281 != 0x00)
							{
								Eq_2 a1_1307;
								Eq_2 s8_1318;
								word32 a2_2205;
								word32 a3_2206;
								word32 a4_2207;
								word32 a5_2208;
								word32 a7_2209;
								word32 s4_2210;
								word32 s5_2211;
								word32 s6_2212;
								word32 s9_2213;
								word32 s10_2214;
								word32 t4_2215;
								mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t230CA0A0, s8_1281, out a1_1307, out a2_2205, out a3_2206, out a4_2207, out a5_2208, out a7_2209, out s4_2210, out s5_2211, out s6_2212, out s7_1245, out s8_1318, out s9_2213, out s10_2214, out s11_1003, out t4_2215);
								word32 a1_2216;
								word32 a2_2217;
								word32 a3_2218;
								word32 a4_2219;
								word32 a5_2220;
								word32 a6_2221;
								word32 a7_2222;
								memcpy(&s2_1257->b0003 + 1, a1_1307, s8_1318, out a1_2216, out a2_2217, out a3_2218, out a4_2219, out a5_2220, out a6_2221, out a7_2222);
							}
							else
								s7_1245 = 0x04;
						}
						else
						{
							word32 a1_2191;
							word32 a2_2192;
							word32 a3_2193;
							word32 a4_2194;
							word32 a5_2195;
							word32 a7_2196;
							word32 s4_2197;
							word32 s5_2198;
							word32 s6_2199;
							word32 s7_2200;
							word32 s8_2201;
							word32 s9_2202;
							word32 s10_2203;
							word32 t4_2204;
							mbedtls_debug_print_msg(ra, s11_1003, 0x01, &g_t230C9FD0, a5_1269, out a1_2191, out a2_2192, out a3_2193, out a4_2194, out a5_2195, out a7_2196, out s4_2197, out s5_2198, out s6_2199, out s7_2200, out s8_2201, out s9_2202, out s10_2203, out s11_1003, out t4_2204);
							s7_1245 = 0x00;
						}
					}
					Eq_2 s0_1375 = s0_1244 + s7_1245;
					word32 s5_1399;
					word32 s6_1400;
					word32 a1_2169;
					word32 a2_2170;
					word32 a3_2171;
					word32 a4_2172;
					word32 a5_2173;
					word32 a7_2174;
					word32 s7_2175;
					word32 s8_2176;
					word32 s9_2177;
					word32 s10_2178;
					word32 t4_2179;
					word32 s4_1398;
					Eq_2 s11_1397;
					mbedtls_debug_print_msg(ra, s11_1003, 0x03, &g_t230CA0C4, s0_1375, out a1_2169, out a2_2170, out a3_2171, out a4_2172, out a5_2173, out a7_2174, out s4_1398, out s5_1399, out s6_1400, out s7_2175, out s8_2176, out s9_2177, out s10_2178, out s11_1397, out t4_2179);
					if (s0_1375 != 0x00)
					{
						s3_1726[2] = (struct Eq_557285) (byte) (s0_1375 >> 0x08);
						s3_1726->b0005 = (byte) s0_1375;
						s4_1398 = (word32) s0_1375 + s6_1400;
					}
					*((word32) s11_1397 + 0x00A4) = 22;
					struct Eq_557570 * a5_1430 = *((word32) s11_1397 + 0x00A0);
					*((word32) s11_1397 + 0x00A8) = s4_1398 - s5_1399;
					a5_1430->b0000 = 0x01;
					*((word32) s11_1397 + 4) = (word32) *((word32) s11_1397 + 4) + 1;
					ui32 a5_1441 = (word32) *((word32) *s11_1397 + 116);
					Eq_2 a5_1442 = a5_1441 & 0x02;
					if ((a5_1441 & 0x02) != 0x00)
						ra = mbedtls_ssl_send_flight_completed(ra, 0x01, a5_1441 & 0x02, sp_1690->t0000, sp_1690->t0004, out s1, out a5_1442, out s11_1397);
					Eq_2 a5_1520;
					Eq_2 s11_1527;
					Eq_2 a0_1541;
					word32 s0_2223;
					word32 a1_2224;
					word32 a2_2225;
					word32 a3_2226;
					word32 a4_2227;
					word32 s2_2228;
					word32 s4_2229;
					word32 s5_2230;
					ra = mbedtls_ssl_write_record(ra, s1, s11_1397, a5_1442, mstatus, out s0_2223, out s1, out a0_1541, out a1_2224, out a2_2225, out a3_2226, out a4_2227, out a5_1520, out s2_2228, out s3, out s4_2229, out s5_2230, out s11_1527, out mstatus);
					if (a0_1541 != 0x00)
					{
						a5_1573 = a0_1541;
						a3_1575.u0 = 0x0415;
l23099F16:
						word32 s10_1948;
						word32 s11_1949;
						word32 s9_1947;
						word32 s8_1946;
						word32 s7_1945;
						word32 s6_1944;
						word32 s5_1943;
						word32 s4_1942;
						word32 a4_1941;
						word32 a3_1940;
						word32 a1_1938;
						word32 a2_1939;
						mbedtls_debug_print_ret(ra, 0x01, a3_1575, a5_1573, out a1_1938, out a2_1939, out a3_1940, out a4_1941, out a5, out s4_1942, out s5_1943, out s6_1944, out s7_1945, out s8_1946, out s9_1947, out s10_1948, out s11_1949);
					}
					else
					{
						word32 a1_2231;
						word32 a2_2232;
						word32 a3_2233;
						word32 a4_2234;
						word32 a7_2235;
						word32 s4_2236;
						word32 s5_2237;
						word32 s6_2238;
						word32 s7_2239;
						word32 s8_2240;
						word32 s9_2241;
						word32 s10_2242;
						word32 s11_2243;
						word32 t4_2244;
						mbedtls_debug_print_msg(ra, s11_1527, 0x02, &g_t230CA0F0, a5_1520, out a1_2231, out a2_2232, out a3_2233, out a4_2234, out a5, out a7_2235, out s4_2236, out s5_2237, out s6_2238, out s7_2239, out s8_2240, out s9_2241, out s10_2242, out s11_2243, out t4_2244);
					}
				}
			}
			break;
		}
	}
l2309988A:
	ptr32 s2_1703 = sp_1690->ptr0048;
	struct Eq_507765 * a4_1704 = sp_1690->ptr0068;
	ptr32 a0_1705 = sp_1690->ptr0088;
	ptr32 s5_1710 = sp_1690->ptr00C8->ptr013C;
	s1Out = s1;
	a0Out = a0_1705;
	a4Out = a4_1704;
	a5Out = a5;
	s2Out = s2_1703;
	s3Out = s3;
	s5Out = s5_1710;
	mstatusOut = mstatus;
	return ra;
}

// 2309B234: void mbedtls_ssl_own_key(Register (ptr32 Eq_558676) a5)
void mbedtls_ssl_own_key(struct Eq_558676 * a5)
{
	if (a5 != null)
	{
		a5 = a5->ptr0008;
		if (a5 != null)
			return;
	}
	if (a5->dw004C == 0x00)
		;
}

