pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
													word32 t4_4508;
													word32 a2_4497;
													word32 s8_4504;
													word32 s11_4507;
													word32 s9_4505;
													word32 s10_4506;
													word32 s4_4501;
													word32 s6_4502;
													word32 s7_4503;
													word32 a7_4500;
													word32 a5_4499;
													word32 a3_4498;
													mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t230C6E20, a5_1908, out a1_4496, out a2_4497, out a3_4498, out a4_133, out a5_4499, out a7_4500, out s4_4501, out s5, out s6_4502, out s7_4503, out s8_4504, out s9_4505, out s10_4506, out s11_4507, out t4_4508);
													s0_105.u0 = 0xF9000400;
													goto l2309B2F6;
												}
												struct Eq_274 * a4_2285;
												Eq_2 a5_2083;
												struct Eq_560364 * a4_1925;
												word32 s9_4493;
												word32 s11_4494;
												word32 t4_4495;
												word32 s8_4492;
												word32 a5_4490;
												word32 a7_4491;
												word32 a1_4487;
												word32 a2_4488;
												word32 a3_4489;
												Eq_2 s7_1932;
												mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CACC0, a5_1908, out a1_4487, out a2_4488, out a3_4489, out a4_1925, out a5_4490, out a7_4491, out s4_1897, out s5_1891, out s6_1089, out s7_1932, out s8_4492, out s9_4493, out s10_1008, out s11_4494, out t4_4495);
												struct Eq_560364 * a5_1939 = *((word32) s10_1008 + 0x0C);
												if (a5_1939 >= a4_1925)
												{
													struct Eq_556567 * s1_1941 = a4_1925->ptr0018;
													if (a4_1925 < a5_1939)
														goto l2309BF68;
													if (((word32) *((word32) *s10_1008 + 116) & 0x02) != 0x00 && ((word32) s1_1941->b001C & 0x04) != 0x00)
														goto l2309BF80;
													word32 a0_1949 = mbedtls_ssl_get_ciphersuite_sig_pk_alg(s1_1941);
													Eq_2 a5_1954 = *((word32) s10_1008 + 48);
													if (*((word32) a5_1954 + 16) == 0x00)
														a5_1954 = *s10_1008;
													if (a0_1949 != 0x00)
													{
														Eq_2 a5_1973;
														Eq_2 s10_1979;
														word32 s8_4584;
														word32 s9_4585;
														word32 t4_4586;
														word32 s4_4580;
														word32 s5_4581;
														word32 s6_4582;
														word32 s7_4583;
														word32 a3_4577;
														word32 a4_4578;
														word32 a7_4579;
														word32 a1_4575;
														word32 a2_4576;
														int32 * s11_1980;
														mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CACF8, a5_1954, out a1_4575, out a2_4576, out a3_4577, out a4_4578, out a5_1973, out a7_4579, out s4_4580, out s5_4581, out s6_4582, out s7_4583, out s8_4584, out s9_4585, out s10_1979, out s11_1980, out t4_4586);
														if (s11_1980 == null)
														{
															word32 a1_4594;
															word32 a3_4596;
															word32 s7_4602;
															word32 t4_4606;
															word32 s11_4605;
															word32 s9_4604;
															word32 s8_4603;
															word32 a4_4597;
															word32 s6_4601;
															word32 s5_4600;
															word32 s4_4599;
															word32 a7_4598;
															word32 a2_4595;
															mbedtls_debug_print_msg(ra_1000, s10_1979, 0x03, &g_t230CAD1C, a5_1973, out a1_4594, out a2_4595, out a3_4596, out a4_4597, out a5_2083, out a7_4598, out s4_4599, out s5_4600, out s6_4601, out s7_4602, out s8_4603, out s9_4604, out s10_1008, out s11_4605, out t4_4606);
															goto l2309BFFA;
														}
														do
														{
															struct Eq_274 * a4_2063;
															struct Eq_509899 * s1_2008;
															ptr32 s9_2010;
															Eq_2 a5_2014;
															word32 a3_4590;
															word32 s4_4591;
															word32 s7_4592;
															word32 a1_4588;
															word32 a2_4589;
															word32 a0_4587;
															struct Eq_560872 * s11_2022;
															ra_1000 = mbedtls_debug_print_crt(ra_1000, 0x03, 588033336, *s11_1980, out s0_105, out s1_2008, out a0_4587, out a1_4588, out a2_4589, out a3_4590, out a5_2014, out s3_1546, out s4_4591, out s7_4592, out s9_2010, out s10_1008, out s11_2022);
															word32 a5_4593;
															if (mbedtls_pk_can_do(s11_2022[1], s9_2010, a5_2014, out a5_4593) == 0x00)
																a4_2063 = (struct Eq_274 *) &g_t230CAD64;
															else
															{
																word32 a0_2042;
																word32 s8_2054;
																word32 a5_4618;
																word32 s4_4619;
																word32 s1_4617;
																s0_105 = mbedtls_ssl_check_cert_usage(s11_2022->ptr0000, s1_2008, 0x01, out s1_4617, out a0_2042, out a5_4618, out s3_1546, out s4_4619, out s8_2054);
																if (a0_2042 != 0x00)
																	a4_2063 = (struct Eq_274 *) &g_t230CAD84;
																else
																{
																	if (*((word32) s10_1008 + 0x0C) > 0x02 || (word32) (s11_2022->ptr0000)->b0128 == 0x04)
																		goto l2309C056;
																	a4_2063 = (struct Eq_274 *) &g_t230CADBC;
																}
															}
															struct Eq_561015 * s11_2090;
															struct Eq_560872 * s8_2095;
															word32 a2_4621;
															word32 a3_4622;
															word32 a7_4624;
															word32 s4_4625;
															word32 s9_4629;
															word32 t4_4630;
															word32 s7_4628;
															word32 s6_4627;
															word32 s5_4626;
															word32 a4_4623;
															word32 a1_4620;
															mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, a4_2063, 0x230CB000, out a1_4620, out a2_4621, out a3_4622, out a4_4623, out a5_2083, out a7_4624, out s4_4625, out s5_4626, out s6_4627, out s7_4628, out s8_2095, out s9_4629, out s10_1008, out s11_2090, out t4_4630);
															s11_1980 = s11_2090->ptr0008;
														} while (s11_1980 != null);
														if (s8_2095 == null)
														{
l2309BFFA:
															a4_2285 = (struct Eq_274 *) &g_t230CAE3C;
															goto l2309BF74;
														}
														s11_2022 = s8_2095;
l2309C056:
														*((word32) *((word32) s10_1008 + 48) + 8) = s11_2022;
														word32 a2_4767;
														word32 a3_4768;
														word32 a1_4766;
														word32 s1_4764;
														word32 a0_4765;
														word32 s7_4771;
														word32 s4_4770;
														word32 s3_4769;
														word32 s11_4773;
														word32 s9_4772;
														ra_1000 = mbedtls_debug_print_crt(ra_1000, 0x03, 588033528, **((word32) *((word32) s10_1008 + 48) + 8), out s0_105, out s1_4764, out a0_4765, out a1_4766, out a2_4767, out a3_4768, out a5_1954, out s3_4769, out s4_4770, out s7_4771, out s9_4772, out s10_1008, out s11_4773);
													}
													int32 * s1_2151 = *((word32) a5_1954 + 4);
													Eq_2 a2_2164;
													<anonymous> *** s5_2171;
													word32 s9_4572;
													word32 s11_4573;
													word32 t4_4574;
													word32 s4_4568;
													word32 s8_4571;
													word32 s6_4569;
													word32 s7_4570;
													word32 a4_4565;
													word32 a5_4566;
													word32 a7_4567;
													word32 a3_4564;
													word32 a1_4563;
													Eq_2 s10_2168;
													mbedtls_debug_print_msg(ra_1000, s10_1008, 0x02, &g_t230CAE20, a5_1954, out a1_4563, out a2_2164, out a3_4564, out a4_4565, out a5_4566, out a7_4567, out s4_4568, out s5_2171, out s6_4569, out s7_4570, out s8_4571, out s9_4572, out s10_2168, out s11_4573, out t4_4574);
													**s5_2171 = (<anonymous> ***) *((word32) s10_2168 + 44);
													*s1_2151 = (int32) *((word32) s10_2168 + 64);
													*((word32) s10_2168 + 4) = (word32) *((word32) s10_2168 + 4) + 1;
													ui32 a5_2189 = (word32) *((word32) *s10_2168 + 116);
													Eq_2 a5_2190 = a5_2189 & 0x02;
													if ((a5_2189 & 0x02) != 0x00)
														ra_1000 = mbedtls_ssl_recv_flight_completed(ra_1000, a2_2164, a5_2189 & 0x02, mstatus, sp_1097->dw0000, sp_1097->dw0004, sp_1097[52], sp_1097->dw0178, out a5_2190, out s10_2168);
													word32 s10_4641;
													word32 s11_4642;
													word32 t4_4643;
													word32 s4_4636;
													word32 s6_4637;
													word32 s7_4638;
													word32 s8_4639;
													word32 s9_4640;
													word32 a2_4632;
													word32 a7_4635;
													word32 a3_4633;
													word32 a5_4634;
													word32 a1_4631;
													mbedtls_debug_print_msg(ra_1000, s10_2168, 0x02, &g_t230CAEC0, a5_2190, out a1_4631, out a2_4632, out a3_4633, out a4_133, out a5_4634, out a7_4635, out s4_4636, out s5, out s6_4637, out s7_4638, out s8_4639, out s9_4640, out s10_4641, out s11_4642, out t4_4643);
													goto l2309B2F6;
												}
l2309BF68:
												a5_2083.u0 = 0x230CB000;
												a4_2285 = (struct Eq_274 *) &g_t230CACD8;
l2309BF74:
												word32 a3_4609;
												word32 a4_4610;
												word32 a5_4611;
												word32 a7_4612;
												word32 s8_4613;
												word32 s9_4614;
												word32 s11_4615;
												word32 t4_4616;
												word32 a1_4607;
												word32 a2_4608;
												mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, a4_2285, a5_2083, out a1_4607, out a2_4608, out a3_4609, out a4_4610, out a5_4611, out a7_4612, out s4_1897, out s5_1891, out s6_1089, out s7_1932, out s8_4613, out s9_4614, out s10_1008, out s11_4615, out t4_4616);
l2309BF80:
												a5_1892 = s7_1932;
											}
											s4_1897 += 0x02;
										} while (s4_1897 - s3_1546 < s6_1089);
										s5_1891 = (word32) s5_1891 + 4;
									}
									if (a5_1892 != 0x00)
									{
										Eq_2 a5_2459;
										Eq_2 s10_2465;
										word32 s7_4481;
										word32 s8_4482;
										word32 s9_4483;
										word32 s11_4484;
										word32 t4_4485;
										word32 s5_4479;
										word32 s6_4480;
										word32 a2_4474;
										word32 s4_4478;
										word32 a7_4477;
										word32 a4_4476;
										word32 a3_4475;
										word32 a1_4473;
										mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t230CAE6C, a5_1892, out a1_4473, out a2_4474, out a3_4475, out a4_4476, out a5_2459, out a7_4477, out s4_4478, out s5_4479, out s6_4480, out s7_4481, out s8_4482, out s9_4483, out s10_2465, out s11_4484, out t4_4485);
										word32 a0_4486;
										s0_105 = mbedtls_ssl_send_fatal_handshake_failure(ra_1000, s10_2465, a5_2459, mstatus, out a0_4486, out a4_133, out s5, out mstatus) + 1664;
									}
									else
									{
										Eq_2 a5_2394;
										Eq_2 s10_2400;
										word32 a4_4462;
										word32 s6_4466;
										word32 s8_4468;
										word32 s9_4469;
										word32 t4_4471;
										word32 s11_4470;
										word32 s7_4467;
										word32 a7_4463;
										word32 s4_4464;
										word32 s5_4465;
										word32 a2_4460;
										word32 a3_4461;
										word32 a1_4459;
										mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t230CAEA0, a5_1892, out a1_4459, out a2_4460, out a3_4461, out a4_4462, out a5_2394, out a7_4463, out s4_4464, out s5_4465, out s6_4466, out s7_4467, out s8_4468, out s9_4469, out s10_2400, out s11_4470, out t4_4471);
										word32 a0_4472;
										s0_105 = mbedtls_ssl_send_fatal_handshake_failure(ra_1000, s10_2400, a5_2394, mstatus, out a0_4472, out a4_133, out s5, out mstatus) + -896;
									}
									goto l2309B2F6;
								}
								uint32 a5_976 = (word32) *((word32) s1_1192 + 1) << 8 | (word32) (*s1_1192);
								uint32 a4_984 = (word32) *((word32) s1_1192 + 3) << 8 | (word32) (*((word32) s1_1192 + 2));
								a5_1029 = (word32) (word16) (a5_976 >> 8 | a5_976 << 0x08);
								if (s5_1741 < (word32) ((word16) (a4_984 << 0x08 | a4_984 >> 8)) + 4)
									break;
								Eq_560551 s8_1091;
								Eq_2 s4_1087;
								struct Eq_274 * a4_1062;
								struct Eq_274 * a4_1066;
								Eq_2 a5_1065;
								if (a5_1029 != 0x0D)
								{
									Eq_2 a2_1451;
									Eq_2 a5_1404;
									if (a5_1029 <= 0x0D)
									{
										if (a5_1029 != 0x00)
										{
											if (a5_1029 != 0x01)
												goto l2309BA6C;
											sp_1097->dw0008 = (word32) a5_1029;
											word32 a2_4545;
											word32 a3_4546;
											word32 a4_4547;
											word32 a7_4548;
											word32 s7_4549;
											word32 s9_4550;
											word32 s11_4551;
											word32 t4_4552;
											word32 a1_4544;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CABE0, a5_1029, out a1_4544, out a2_4545, out a3_4546, out a4_4547, out a5_1029, out a7_4548, out s4_1087, out s5, out s6_1089, out s7_4549, out s8_1091, out s9_4550, out s10_1008, out s11_4551, out t4_4552);
											if (s4_1087 != a5_1029)
											{
l2309BD3E:
												break;
											}
											a5_1029 = (word32) *((word32) s1_1192 + 4);
											if (a5_1029 > 0x04)
												goto l2309BD3E;
											*((word32) *((word32) s10_1008 + 44) + 112) = (byte) a5_1029;
										}
										else
										{
											word32 t4_4543;
											word32 a5_4538;
											word32 s11_4542;
											word32 s9_4541;
											word32 s7_4540;
											word32 a7_4539;
											word32 a4_4537;
											word32 a3_4536;
											word32 a2_4535;
											word32 a1_4534;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CAB1C, a5_1029, out a1_4534, out a2_4535, out a3_4536, out a4_4537, out a5_4538, out a7_4539, out s4_1087, out s5, out s6_1089, out s7_4540, out s8_1091, out s9_4541, out s10_1008, out s11_4542, out t4_4543);
											Eq_2 a5_1478 = *((word32) *s10_1008 + 44);
											if (a5_1478 != 0x00)
											{
												word32 s11_1493;
												word32 s7_1497;
												word32 s9_1499;
												word32 a5_4648;
												word32 a7_4649;
												word32 t4_4650;
												word32 a1_4644;
												word32 a2_4645;
												word32 a3_4646;
												word32 a4_4647;
												mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CAB38, a5_1478, out a1_4644, out a2_4645, out a3_4646, out a4_4647, out a5_4648, out a7_4649, out s4_1087, out s5, out s6_1089, out s7_1497, out s8_1091, out s9_1499, out s10_1008, out s11_1493, out t4_4650);
												uint32 a4_1507 = (word32) *((word32) s1_1192 + 5) << 8 | (word32) (*((word32) s1_1192 + 4));
												a5_1029 = (word32) (word16) (a4_1507 << 0x08 | a4_1507 >> 8);
												if (s4_1087 != (word32) a5_1029 + 2)
													break;
												word32 a2_1514 = s1_1192 + 6;
												while (a5_1029 != 0x00)
												{
													uint32 a4_1522 = (word32) *((word32) a2_1514 + 2) << 8 | (word32) (*((word32) a2_1514 + 1));
													Eq_561345 a3_1527 = (word32) (word16) (a4_1522 << 0x08 | a4_1522 >> 8);
													if (a5_1029 <u a3_1527 + 3)
														goto l2309B8E2;
													word32 a0_1529 = (word32) *a2_1514;
													if (a0_1529 == 0x00)
													{
														Eq_2 a0_1570;
														word32 a3_1573;
														word32 a6_1579;
														word32 a7_1580;
														word32 t3_1581;
														word32 t0_1582;
														word32 t1_1583;
														word32 t4_1584;
														word32 tp_1585;
														word32 t5_1587;
														(a3_1527 + 3)();
														if (a0_1570 == 0x00)
															break;
														word32 s6_4700;
														word32 s7_4701;
														word32 s8_4702;
														word32 s9_4703;
														word32 s11_4704;
														word32 a3_4696;
														word32 s5_4699;
														word32 a4_4697;
														word32 s4_4698;
														word32 a1_4694;
														word32 a2_4695;
														mbedtls_debug_print_ret(ra_1000, 0x01, 0x007B, a0_1570, out a1_4694, out a2_4695, out a3_4696, out a4_4697, out a5_1404, out s4_4698, out s5_4699, out s6_4700, out s7_4701, out s8_4702, out s9_4703, out s10_1008, out s11_4704);
														a2_1451.u0 = 112;
														goto l2309BBE4;
													}
													a5_1029 = (word32) a5_1029 + (~0x02 - a3_1527);
													a2_1514 += a3_1527 + 3;
												}
											}
										}
										goto l2309BB62;
									}
									if (a5_1029 == 35)
									{
										word32 a4_4654;
										word32 s9_4658;
										word32 t4_4660;
										word32 s11_4659;
										word32 a5_4655;
										word32 a7_4656;
										word32 s7_4657;
										word32 a2_4652;
										word32 a3_4653;
										word32 a1_4651;
										mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CAC04, 0x230CB000, out a1_4651, out a2_4652, out a3_4653, out a4_4654, out a5_4655, out a7_4656, out s4_1087, out s5, out s6_1089, out s7_4657, out s8_1091, out s9_4658, out s10_1008, out s11_4659, out t4_4660);
										struct Eq_561184 * a4_1103;
										ra_1000 = mbedtls_ssl_session_init(ra_1000, &sp_1097->dw000C + 20, out a4_1103);
										struct Eq_561190 * a5_1109 = a4_1103->ptr0040;
										if (a4_1103 == null || a5_1109->dw003C == 0x00)
											goto l2309BB62;
										*((word32) *((word32) s10_1008 + 48) + 344) = 0x01;
										<anonymous> * a4_1126;
										word32 s11_4712;
										word32 t4_4713;
										word32 a5_4708;
										word32 a7_4709;
										word32 s7_4710;
										word32 s9_4711;
										word32 a1_4705;
										word32 a2_4706;
										word32 a3_4707;
										Eq_2 a0_1121 = mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CA818, s4_1087, out a1_4705, out a2_4706, out a3_4707, out a4_1126, out a5_4708, out a7_4709, out s4_1087, out s5, out s6_1089, out s7_4710, out s8_1091, out s9_4711, out s10_1008, out s11_4712, out t4_4713);
										if (s4_1087 == 0x00)
											goto l2309BB62;
										word32 a0_1146;
										Eq_2 a5_1147;
										Eq_2 a1_1148;
										Eq_2 a2_1149;
										a4_1126();
										if (a0_1146 != 0x00)
										{
											sp_1097->dw0008 = a0_1146;
											word32 s4_4735;
											word32 a4_4734;
											word32 a3_4733;
											word32 a2_4732;
											word32 a0_4731;
											s1_1192 = mbedtls_ssl_session_free(ra_1000, &sp_1097->dw000C + 20, a1_1148, a2_1149, a5_1147, mstatus, sp_1097->dw0128, sp_1097->dw0148, sp_1097[60], sp_1097->dw0188, out a0_4731, out a2_4732, out a3_4733, out a4_4734, out a5_1065, out s4_4735);
											if (a5_1065 == ~0x0700017F)
											{
												a4_1066 = (struct Eq_274 *) &g_t230CAC24;
												goto l2309BCB4;
											}
											if (a5_1065 == 0xF9000280)
											{
												a4_1066 = (struct Eq_274 *) &g_t230CAC3C;
												goto l2309BCB4;
											}
											word32 a3_4748;
											word32 s7_4751;
											word32 s11_4753;
											word32 s9_4752;
											word32 a4_4749;
											word32 a5_4750;
											word32 a1_4746;
											word32 a2_4747;
											mbedtls_debug_print_ret(ra_1000, 0x01, 483, a5_1065, out a1_4746, out a2_4747, out a3_4748, out a4_4749, out a5_4750, out s4_1087, out s5, out s6_1089, out s7_4751, out s8_1091, out s9_4752, out s10_1008, out s11_4753);
										}
										else
										{
											Eq_2 a1_1167 = *((word32) a2_1149 + 8);
											sp_1097->dw00B0 = (word32) a2_1149;
											Eq_2 a5_1171;
											Eq_2 a1_1173;
											Eq_2 a2_1174;
											word32 a6_4716;
											word32 a7_4717;
											word32 a3_4714;
											word32 a4_4715;
											memcpy(&sp_1097->dw000C + 23, (word32) a1_1167 + 0x0C, a2_1149, out a1_1173, out a2_1174, out a3_4714, out a4_4715, out a5_1171, out a6_4716, out a7_4717);
											word32 a0_4718;
											word32 a5_4722;
											word32 s4_4723;
											word32 a2_4719;
											word32 a3_4720;
											word32 a4_4721;
											s1_1192 = mbedtls_ssl_session_free(ra_1000, *((word32) s10_1008 + 44), a1_1173, a2_1174, a5_1171, mstatus, sp_1097->dw0128, sp_1097->dw0148, sp_1097[60], sp_1097->dw0188, out a0_4718, out a2_4719, out a3_4720, out a4_4721, out a5_4722, out s4_4723);
											word32 a1_4724;
											word32 a7_4730;
											word32 a2_4725;
											word32 a6_4729;
											word32 a5_4728;
											word32 a4_4727;
											word32 a3_4726;
											memcpy(*((word32) s10_1008 + 44), &sp_1097->dw000C + 20, 116, out a1_4724, out a2_4725, out a3_4726, out a4_4727, out a5_4728, out a6_4729, out a7_4730);
											byte * a5_1212 = &sp_1097->dw000C + 20;
											do
											{
												*a5_1212 = 0x00;
												++a5_1212;
											} while (a5_1212 != &sp_1097->dw00C4 + 3);
											word32 a1_4754;
											word32 a2_4755;
											word32 a3_4756;
											word32 a7_4759;
											word32 a5_4758;
											word32 a4_4757;
											word32 s9_4761;
											word32 s11_4762;
											word32 s7_4760;
											word32 t4_4763;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CAC6C, 0x230CB000, out a1_4754, out a2_4755, out a3_4756, out a4_4757, out a5_4758, out a7_4759, out s4_1087, out s5, out s6_1089, out s7_4760, out s8_1091, out s9_4761, out s10_1008, out s11_4762, out t4_4763);
											*((word32) *((word32) s10_1008 + 48) + 328) = 0x01;
											*((word32) *((word32) s10_1008 + 48) + 344) = 0x00;
										}
										goto l2309BB62;
									}
									if (a5_1029 != 0x0FFFFF01)
									{
										if (a5_1029 == 0x10)
										{
											word32 a3_4673;
											word32 a5_4674;
											word32 a7_4675;
											word32 s7_4676;
											word32 s9_4677;
											word32 s11_4678;
											word32 t4_4679;
											word32 a1_4671;
											word32 a2_4672;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CA484, a5_1029, out a1_4671, out a2_4672, out a3_4673, out a4_133, out a5_4674, out a7_4675, out s4_1087, out s5, out s6_1089, out s7_4676, out s8_1091, out s9_4677, out s10_1008, out s11_4678, out t4_4679);
											int32 * s11_1392 = *((word32) *s10_1008 + 96);
											if (s11_1392 != null)
											{
												if (s4_1087 > 0x03)
												{
													uint32 a5_1397 = (word32) *((word32) s1_1192 + 5) << 8 | (word32) (*((word32) s1_1192 + 4));
													a4_133 = (word32) s4_1087 - 2;
													if ((word32) (word16) (a5_1397 >> 8 | a5_1397 << 0x08) == (word32) s4_1087 - 2)
													{
														a5_1404 = s1_1192 + 6;
														sp_1097->dw0008 = (word32) a5_1404;
														word32 s9_1406 = s1_1192 + s8_1091;
														while (true)
														{
															Eq_2 a0_1409 = *s11_1392;
															if (a0_1409 == 0x00)
																break;
															word32 a3_4682;
															word32 a4_4683;
															word32 a1_4680;
															word32 a2_4681;
															a4_133 = strlen(a0_1409, out a1_4680, out a2_4681, out a3_4682, out a4_4683, out a5_1404);
															while (s9_1406 != a5_1404)
															{
																if (s9_1406 < a5_1404)
																	goto l2309B3CA;
																word32 a6_1421 = a5_1404 + 1;
																Eq_2 a5_1423 = (word32) *a5_1404;
																if (a5_1423 == 0x00)
																	goto l2309B3CA;
																if (a4_133 == a5_1423)
																{
																	Eq_2 a1_1426 = *s11_1392;
																	sp_1097->dw008C = (word32) a5_1423;
																	sp_1097[2] = (struct Eq_559389) a4_133;
																	sp_1097->dw0088 = (word32) a6_1421;
																	word32 a3_4693;
																	word32 a2_4692;
																	word32 a1_4691;
