pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
																	Eq_2 a0_1433 = memcmp(a6_1421, a1_1426, a4_133, out a1_4691, out a2_4692, out a3_4693, out a4_133, out a5_1423);
																	s4_1087 = sp_1097->dw0008;
																	s8_1091 = sp_1097->dw00C4;
																	if (a0_1433 == 0x00)
																	{
																		*((word32) s10_1008 + 0x00B8) = *s11_1392;
																		goto l2309BB62;
																	}
																}
																a5_1404 = a5_1423 + a6_1421;
															}
															++s11_1392;
														}
														a2_1451.u0 = 0x0078;
l2309BBE4:
														word32 a0_4685;
														word32 s2_4686;
														word32 s8_4688;
														word32 s9_4689;
														word32 s10_4690;
														word32 s3_4687;
														word32 s0_4684;
														mbedtls_ssl_send_alert_message(ra_1000, s10_1008, a2_1451, a5_1404, mstatus, out s0_4684, out a0_4685, out a4_133, out s2_4686, out s3_4687, out s5, out s8_4688, out s9_4689, out s10_4690, out mstatus);
													}
												}
												goto l2309B3CA;
											}
										}
										else
										{
l2309BA6C:
											a4_1062 = (struct Eq_274 *) &g_t230CA49C;
l2309BD02:
											word32 a5_4557;
											word32 a7_4558;
											word32 s9_4560;
											word32 s11_4561;
											word32 t4_4562;
											word32 s7_4559;
											word32 a4_4556;
											word32 a2_4554;
											word32 a3_4555;
											word32 a1_4553;
											mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, a4_1062, a5_1029, out a1_4553, out a2_4554, out a3_4555, out a4_4556, out a5_4557, out a7_4558, out s4_1087, out s5, out s6_1089, out s7_4559, out s8_1091, out s9_4560, out s10_1008, out s11_4561, out t4_4562);
										}
										goto l2309BB62;
									}
									word32 a7_4666;
									word32 t4_4670;
									word32 s11_4669;
									word32 s9_4668;
									word32 s7_4667;
									word32 a1_4661;
									word32 a5_4665;
									word32 a4_4664;
									word32 a3_4663;
									word32 a2_4662;
									mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CA3FC, a5_1029, out a1_4661, out a2_4662, out a3_4663, out a4_4664, out a5_4665, out a7_4666, out s4_1087, out s5, out s6_1089, out s7_4667, out s8_1091, out s9_4668, out s10_1008, out s11_4669, out t4_4670);
									a5_1359.u0 = 0x01;
									if (s4_1087 == 0x01)
									{
										a5_1359 = (word32) *((word32) s1_1192 + 4);
										if (a5_1359 != 0x00)
											goto l2309BC1E;
										*((word32) s10_1008 + 188) = s4_1087;
										goto l2309BB62;
									}
l2309BC1E:
									a4_1363 = (struct Eq_274 *) &g_t230CA41C;
									goto l2309BC2A;
								}
								ptr32 s4_1010;
								Eq_560585 s8_1014;
								word32 a5_4526;
								word32 s7_4530;
								word32 s11_4532;
								word32 t4_4533;
								word32 s9_4531;
								word32 a7_4527;
								word32 s5_4528;
								word32 s6_4529;
								word32 a3_4524;
								word32 a4_4525;
								word32 a1_4522;
								word32 a2_4523;
								mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, &g_t230CAB64, 0x230CB000, out a1_4522, out a2_4523, out a3_4524, out a4_4525, out a5_4526, out a7_4527, out s4_1010, out s5_4528, out s6_4529, out s7_4530, out s8_1014, out s9_4531, out s10_1008, out s11_4532, out t4_4533);
								uint32 a4_1024 = (word32) *((word32) s1_1192 + 5) << 8 | (word32) (*((word32) s1_1192 + 4));
								word32 a3_1022 = s1_1192 + s8_1014;
								a5_1029 = (word32) (word16) (a4_1024 << 0x08 | a4_1024 >> 8);
								if (s4_1010 != (word32) a5_1029 + 2)
								{
l2309BC8C:
									break;
								}
								a5_1029 &= 0x01;
								if ((a5_1029 & 0x01) != 0x00)
									goto l2309BC8C;
								int32 * s11_1033 = *((word32) *s10_1008 + 88);
								while (*s11_1033 != 0x00)
								{
									word32 s9_1038;
									for (s9_1038 = s1_1192 + 6; s9_1038 < a3_1022; s9_1038 += 0x02)
									{
										int32 a5_1043 = *s11_1033;
										word32 a0_1044 = (word32) *s9_1038;
										sp_1097->dw0088 = (word32) a3_1022;
										sp_1097->dw0008 = a5_1043;
										word32 a5_1050;
										if (a5_1050 == mbedtls_ssl_md_alg_from_hash(a0_1044, out a5_1050))
										{
											null[(word32) *s9_1038 / 4] = (struct Eq_561857 *) *((word32) s10_1008 + 48);
											a4_1062 = (struct Eq_274 *) &g_t230CAB8C;
											a5_1029 = **((word32) s10_1008 + 48);
											goto l2309BD02;
										}
									}
									++s11_1033;
								}
								a5_1065.u0 = 0x230CB000;
								a4_1066 = (struct Eq_274 *) &g_t230CABBC;
l2309BCB4:
								word32 a7_4741;
								word32 a5_4740;
								word32 a4_4739;
								word32 a3_4738;
								word32 a2_4737;
								word32 s7_4742;
								word32 s9_4743;
								word32 s11_4744;
								word32 t4_4745;
								word32 a1_4736;
								mbedtls_debug_print_msg(ra_1000, s10_1008, 0x03, a4_1066, a5_1065, out a1_4736, out a2_4737, out a3_4738, out a4_4739, out a5_4740, out a7_4741, out s4_1087, out s5, out s6_1089, out s7_4742, out s8_1091, out s9_4743, out s10_1008, out s11_4744, out t4_4745);
l2309BB62:
								up32 s4_1740 = s5 - s4_1087;
								s5_1741 = s4_1740 + -4;
								a5_1029.u0 = 0x02;
								s1_1192 += s8_1091;
							} while (s4_1740 > ~0x06);
						}
l2309B8E2:
l2309B3C2:
						word32 a5_4429;
						word32 a7_4430;
						word32 s6_4432;
						word32 s7_4433;
						word32 s11_4437;
						word32 t4_4438;
						word32 s10_4436;
						word32 s9_4435;
						word32 s8_4434;
						word32 s4_4431;
						word32 a3_4428;
						word32 a1_4426;
						word32 a2_4427;
						mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t230CA968, a5_1029, out a1_4426, out a2_4427, out a3_4428, out a4_133, out a5_4429, out a7_4430, out s4_4431, out s5, out s6_4432, out s7_4433, out s8_4434, out s9_4435, out s10_4436, out s11_4437, out t4_4438);
l2309B3CA:
						s0_105.u0 = 0xF8000700;
					}
					else
					{
						sp_1097->dw0000 = a3_682;
						Eq_2 a5_2555;
						Eq_2 s10_2561;
						word32 a1_4338;
						word32 a3_4340;
						word32 s7_4346;
						word32 t4_4350;
						word32 s11_4349;
						word32 s9_4348;
						word32 s8_4347;
						word32 a4_4341;
						word32 s6_4345;
						word32 s5_4344;
						word32 s4_4343;
						word32 a7_4342;
						word32 a2_4339;
						mbedtls_debug_print_msg(ra_1000, s10_1008, 0x01, &g_t230CAA6C, a5_680, out a1_4338, out a2_4339, out a3_4340, out a4_4341, out a5_2555, out a7_4342, out s4_4343, out s5_4344, out s6_4345, out s7_4346, out s8_4347, out s9_4348, out s10_2561, out s11_4349, out t4_4350);
						word32 s0_2585;
						word32 s3_4353;
						word32 s8_4354;
						word32 s9_4355;
						word32 s10_4356;
						word32 a0_4351;
						word32 s2_4352;
						mbedtls_ssl_send_alert_message(ra_1000, s10_2561, 70, a5_2555, mstatus, out s0_2585, out a0_4351, out a4_133, out s2_4352, out s3_4353, out s5, out s8_4354, out s9_4355, out s10_4356, out mstatus);
						s0_105 = s0_2585 + 384;
					}
				}
			}
			break;
		}
	}
l2309B2F6:
	a4Out = a4_133;
	a5Out = dwArgE8;
	s3Out = dwArgC8;
	s5Out = s5;
	mstatusOut = mstatus;
	return s0_105;
}

// 2309CEBC: Register (ptr32 Eq_524850) mbedtls_x509_get_serial(Register Eq_2 a1, Register (ptr32 Eq_524850) a2, Register Eq_2 a5, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
struct Eq_524850 * mbedtls_x509_get_serial(Eq_2 a1, struct Eq_524850 * a2, Eq_2 a5, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	Eq_561877 a0_5 = *a5;
	if (a1 - a5 <= 0x00)
	{
		a0Out.u0 = ~0x020002DF;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
	else if (((word32) *a5 & 0x007F) != 0x02)
	{
		a0Out.u0 = 4261412126;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a5_40;
		*((word32) a5 + 1) = a0_5;
		Eq_2 a5_24 = (word32) *a5;
		a2->t1000 = a5_24;
		struct Eq_524850 * s1_26 = a2;
		Eq_2 a1_32;
		struct Eq_561908 * a4_34;
		struct Eq_561909 * a5_35;
		word32 a2_83;
		word32 a3_84;
		Eq_2 a0_30 = mbedtls_asn1_get_len(a1, (char *) a2 + 4, a5_24, out a1_32, out a2_83, out a3_84, out a4_34, out a5_35);
		if (a0_30 != 0x00)
		{
			a5_40.u0 = 4261412224;
			a0_30 = (word32) a0_30 - 0x02000280;
		}
		else
		{
			Eq_2 s0_37 = a5_35->t0000;
			s1_26 = a4_34->ptr0004;
			a5_35->ptr0008 = s1_26;
			a5_40 = a5_35 + a4_34;
			*a5_40 = s0_37;
		}
		a0Out = a0_30;
		a1Out = a1_32;
		a5Out = a5_40;
		return s1_26;
	}
}

// 2309CF24: Register Eq_2 mbedtls_x509_get_alg(Register Eq_2 a1, Register (ptr32 Eq_495055) a2, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_524780 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_524782) s3Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_get_alg(Eq_2 a1, struct Eq_495055 * a2, Eq_2 a3, Eq_2 a5, Eq_2 dwArgA4, Eq_2 dwArg0118, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_524780 & a5Out, ptr32 & s2Out, struct Eq_524782 & s3Out)
{
	ptr32 a1_10;
	ptr32 s2_18;
	struct Eq_524782 * s3_19;
	word32 s4_60;
	word32 a4_59;
	word32 a3_58;
	word32 a2_57;
	ptr32 a0_24;
	Eq_524780 a5_14;
	Eq_2 s1_17 = mbedtls_asn1_get_alg(a1, a2, a3, a5, dwArgA4, dwArg0118, out a0_24, out a1_10, out a2_57, out a3_58, out a4_59, out a5_14, out s2_18, out s3_19, out s4_60);
	if (a0_24 != 0x00)
	{
		a5_14.u0 = ~0x020002FF;
		a0_24 += ~0x020002FF;
	}
	a0Out = a0_24;
	a1Out = a1_10;
	a2Out = dwArg10;
	a5Out = a5_14;
	s2Out = s2_18;
	s3Out = s3_19;
	return s1_17;
}

// 2309CF3C: Register Eq_2 mbedtls_x509_get_name(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0198, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_get_name(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0198, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out)
{
	Eq_2 s1_130 = a0;
	Eq_2 s6_169 = a2;
	uint32 s4_162 = 0x50581008;
	word32 s3_124 = ~0x0200037F;
l2309CF62:
	ptr32 a0_121;
	word32 a2_424;
	word32 a3_425;
	Eq_2 a4_111;
	ptr32 a1_109;
	Eq_2 a0_40 = mbedtls_asn1_get_tag(a1, fp + -56, 49, a5, out a1_109, out a2_424, out a3_425, out a4_111, out a5);
	if (a0_40 != 0x00)
	{
		a5.u0 = ~0x0200037F;
		a0_121 = (word32) a0_40 - 0x02000380;
	}
	else
	{
		Eq_2 s0_115 = s6_169;
		s7 = 0x1E;
		s2 = Mem47[s1_130 + 0x00:int32] + a5;
		s6_169.u0 = 0x01;
		do
		{
			word32 a2_418;
			Eq_2 a3_108;
			Eq_2 a0_107 = mbedtls_asn1_get_tag(s2, fp + -52, 48, a5, out a1_109, out a2_418, out a3_108, out a4_111, out a5);
			if (a0_107 != 0x00)
			{
l2309CFAE:
				a0_121 = (word32) a0_107 + s3_124;
				if (a0_121 != 0x00)
					goto l2309CF7A;
				goto l2309CFB2;
			}
			s1_130 = *a5.u0;
			a4_111 = s2 - a5;
			if (a4_111 <= 0x00)
			{
l2309CFDE:
				a0_121 = ~0x020003DF;
				goto l2309CF7A;
			}
			Eq_2 a5_73 = (word32) *a5.u0;
			*a5_73 = s0_115;
			word32 a2_419;
			a0_107 = mbedtls_asn1_get_tag(s2, (byte) s0_115.u0 + 4, 0x06, a5_73, out a1_109, out a2_419, out a3_108, out a4_111, out a5);
			if (a0_107 != 0x00)
				goto l2309CFAE;
			s1_130 = *a5.u0;
			s0_115 = *((word32) a4_111 + 4);
			*((byte) a5.u0 + 8) = s0_115;
			a5 += a4_111;
			*a5.u0 = s1_130;
			a4_111 = s2 - a5;
			if (a4_111 <= 0x00)
				goto l2309CFDE;
			a4_111 = (word32) *a5.u0;
			if (a4_111 > 0x1E)
			{
l2309D048:
				a0_121 = ~0x020003E1;
				goto l2309CF7A;
			}
			uint32 a4_96 = s4_162 >> a4_111;
			a4_111 = a4_96 & 0x01;
			if ((a4_96 & 0x01) == 0x00)
				goto l2309D048;
			*((byte) a5.u0 + 1) = s1_130;
			Eq_2 a5_102 = (word32) *a5.u0;
			*((word32) a5_102 + 0x0C) = s0_115;
			word32 a2_420;
			a0_107 = mbedtls_asn1_get_len(s2, (byte) s0_115.u0 + 16, a5_102, out a1_109, out a2_420, out a3_108, out a4_111, out a5);
			if (a0_107 != 0x00)
				goto l2309CFAE;
			Eq_2 s1_114 = *a5.u0;
			s0_115 = *((word32) a4_111 + 16);
			*((byte) a5.u0 + 20) = s0_115;
			a5 += a4_111;
			*a5.u0 = s1_114;
			*((byte) s0_115.u0 + 24) = 0x00;
l2309CFB2:
			s1_130 = *a5.u0;
			if (a5 == s2)
			{
				if (a1 == s2)
				{
					a0_121 = 0x00;
					goto l2309CF7A;
				}
				else
				{
					Eq_2 s0_158;
					word32 s8_423;
					word32 a2_421;
					word32 a3_422;
					ra = mycalloc(ra, s1_130, 0x01, 32, a3_108, a4_111, a5, mstatus, dwLoc20, dwLoc1C, dwArgD8, dwArg0118, out s0_158, out s1_130, out a1_109, out a2_421, out a3_422, out a4_111, out a5, out s2, out s3_124, out s4_162, out s8_423);
					*(union Eq_2 *) 0x19 = s0_158;
					s6_169.u0 = 0x01;
					if (false)
						break;
					goto l2309CF62;
				}
			}
			*((word32) s0_115 + 28) = 0x01;
			Eq_2 s0_185;
			word32 s8_417;
			word32 a2_415;
			word32 a3_416;
			ra = mycalloc(ra, s1_130, 0x01, 32, a3_108, a4_111, a5, mstatus, dwLoc20, dwLoc1C, dwArgD8, dwArg0118, out s0_185, out s1_130, out a1_109, out a2_415, out a3_416, out a4_111, out a5, out s2, out s3_124, out s4_162, out s8_417);
			*(union Eq_2 *) 0x19 = s0_185;
			s0_115.u0 = 0x01;
		} while (true);
		s6_169.u0 = 0x01;
		a0_121 = 0xFD000780;
	}
l2309CF7A:
	0x00 = (int8) dwArg0198;
	s1Out = s1_130;
	a0Out = a0_121;
	a1Out = a1_109;
	a4Out = a4_111;
	a5Out = a5;
	s2Out = s2;
	s5Out = a1;
	s6Out = s6_169;
	s7Out = s7;
	return ra;
}

// 2309D06C: Register Eq_2 mbedtls_x509_get_sig(Register Eq_2 a1, Register Eq_2 a5, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_get_sig(Eq_2 a1, Eq_2 a5, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s8Out)
{
	if (a1 - a5 <= 0x00)
	{
		a0Out = 4261411616;
		a1Out = a1;
		a2Out = a2;
		a5Out = a5;
		s2Out = s2;
		s8Out = s8;
		return s1;
	}
	else
	{
		Eq_2 a5_38;
		Eq_2 s2_23 = (word32) *a5;
		Eq_2 a1_25;
		struct Eq_562199 * a4_28;
		struct Eq_562200 * a5_29;
		word32 a3_100;
		ptr32 a0_24;
		ptr32 a2_26;
		Eq_2 s1_31 = mbedtls_asn1_get_bitstring_null(a1, fp + ~0x13, a5, out a0_24, out a1_25, out a2_26, out a3_100, out a4_28, out a5_29);
		if (a0_24 != 0x00)
		{
			a5_38.u0 = ~0x0200047F;
			a0_24 += ~0x0200047F;
		}
		else
		{
			*s1_31 = s2_23;
			a4_28->t0004 = s1_31;
			Eq_2 s0_36 = a5_29->t0000;
			a5_29->t0008 = s1_31;
			a5_38 = a5_29 + a4_28;
			*a5_38 = s0_36;
			a2_26 = dwArgA4;
		}
		a0Out = a0_24;
		a1Out = a1_25;
		a2Out = a2_26;
		a5Out = a5_38;
		s2Out = s2_23;
		s8Out = dwLoc1C;
		return s1_31;
	}
}

// 2309D0BE: Register word32 mbedtls_x509_get_sig_alg(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
word32 mbedtls_x509_get_sig_alg(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a5, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a5Out)
{
	if (a5 != 0x00)
	{
		a0Out = ~0x020007FF;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
	else
	{
		ptr32 a1_21;
		ptr32 a0_20;
		Eq_2 a5_25;
		word32 s1_26 = mbedtls_oid_get_sig_alg(a0, a2, a3, a5, out a0_20, out a1_21, out a5_25);
		if (a0_20 != 0x00)
		{
			a5_25.u0 = ~0x020005FF;
			a0_20 += ~0x020005FF;
		}
		else if (a5_25 != 0x05 && a5_25 != 0x00 || a5_25 != 0x00)
			a0_20 = ~0x020002FF;
		a0Out = a0_20;
		a1Out = a1_21;
		a5Out = a5_25;
		return s1_26;
	}
}

// 2309D102: Register Eq_2 mbedtls_x509_get_ext(Register Eq_2 a1, Register Eq_2 a2, Register ui32 a3, Register Eq_2 a5, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_get_ext(Eq_2 a1, Eq_2 a2, ui32 a3, Eq_2 a5, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	if (a5 != a1)
	{
		Eq_2 a5_14 = (word32) *a5;
		*a5_14 = a2;
		Eq_2 s1_16 = a2;
		word32 a2_100;
		word32 a3_101;
		word32 a4_102;
		Eq_2 a1_24;
		Eq_2 a5_28;
		Eq_2 a0_22 = mbedtls_asn1_get_tag(a1, (word32) a2 + 4, a3 | 0x00A0, a5_14, out a1_24, out a2_100, out a3_101, out a4_102, out a5_28);
		if (a0_22 == 0x00)
		{
			*((word32) a5_28 + 8) = a2;
			s1_16 = Mem32[a2 + 4:word32] + a5_28;
			word32 a4_42;
			word32 a5_43;
			word32 a2_103;
			word32 a3_104;
			Eq_2 a0_37 = mbedtls_asn1_get_tag(s1_16, fp + ~0x13, 48, a5_28, out a1_24, out a2_103, out a3_104, out a4_42, out a5_43);
			if (a0_37 != 0x00)
			{
				a5_28.u0 = ~0x020004FF;
				a0_22 = (word32) a0_37 - 0x02000500;
			}
			else
			{
				a0_22.u0 = 0x00;
				a5_28 = a5_43 + a4_42;
				if (s1_16 != a5_28)
					a0_22.u0 = ~0x02000565;
			}
		}
		a0Out = a0_22;
		a1Out = a1_24;
		a5Out = a5_28;
		return s1_16;
	}
	else
	{
		a0Out.u0 = 0x00;
		a1Out = a1;
		a5Out = a5;
		return s1;
	}
}

