pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309D168: Register Eq_2 mbedtls_x509_dn_gets(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 s10Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_x509_dn_gets(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 & s10Out)
{
	Eq_2 s3_11 = a1;
	Eq_2 s6_13 = a2;
	Eq_2 s1_15 = a0;
	word32 t1_613;
	word32 a1_615;
	word32 a3_616;
	word32 a0_614;
	word32 a4_617;
	word32 a5_618;
	Eq_2 a2_106;
	Eq_2 ra_124 = memset(ra, fp->aFFFFFED0, 0x00, 0x0100, out t1_613, out a0_614, out a1_615, out a2_106, out a3_616, out a4_617, out a5_618);
	Eq_2 s2_103 = a2;
	Eq_2 s0_121 = a1;
	Eq_2 a5_105 = 0x00;
	word32 s8_118 = 0x230CB000;
	word32 s9_149 = 0x230CB000;
	struct Eq_274 * s4_252 = &g_t230CB340;
	struct Eq_274 * s5_253 = &g_t230BE808;
	while (true)
	{
		Eq_2 a0_265;
		if (s2_103 == 0x00)
			break;
		if (*((word32) s2_103 + 8) != 0x00)
		{
			if (s2_103 != s6_13)
			{
				struct Eq_274 * a2_60 = s4_252;
				if (a5_105 == 0x00)
					a2_60 = s5_253;
				Eq_562401 a0_76;
				Eq_562401 s0_84;
				word32 a3_621;
				word32 a4_622;
				word32 a7_623;
				word32 s5_626;
				word32 s3_624;
				word32 s4_625;
				word32 s1_619;
				word32 s6_627;
				word32 s7_628;
				word32 a1_620;
				word32 s11_629;
				ra_124 = snprintf(ra_124, s1_15, s0_121, a2_60, dwLoc0128, dwLoc0108, dwLocDC, dwLocC0, 0x00, dwLoc98, dwLoc74, out s0_84, out s1_619, out a0_76, out a1_620, out a2_106, out a3_621, out a4_622, out a5_105, out a7_623, out s2_103, out s3_624, out s4_625, out s5_626, out s6_627, out s7_628, out s8_118, out s9_149, out s10, out s11_629);
				if (a0_76 < 0x00 || a0_76 >= s0_84)
					goto l2309D1F8;
				s0_121 = s0_84 - a0_76;
			}
			struct Eq_562381 * s2_137;
			Eq_2 ra_132;
			word32 s7_142;
			word32 s1_134;
			Eq_562385 s0_133;
			Eq_562385 a0_125;
			word32 a0_109;
			Eq_2 s1_115 = mbedtls_oid_get_attr_short_name(s2_103, (char *) fp - 308, a2_106, a5_105, dwLoc0108, out a0_109);
			if (a0_109 == 0x00)
			{
				word32 s9_654;
				word32 s11_655;
				word32 a1_643;
				word32 a3_645;
				word32 a4_646;
				word32 a5_647;
				word32 a7_648;
				word32 s5_651;
				word32 s6_652;
				word32 s8_653;
				word32 s3_649;
				word32 s4_650;
				word32 a2_644;
				ra_132 = snprintf(ra_124, s1_115, s0_121, s9_149 + 0x0344, dwLoc0128, dwLoc0108, dwLocDC, dwLocC0, 0x00, dwLoc98, dwLoc74, out s0_133, out s1_134, out a0_125, out a1_643, out a2_644, out a3_645, out a4_646, out a5_647, out a7_648, out s2_137, out s3_649, out s4_650, out s5_651, out s6_652, out s7_142, out s8_653, out s9_654, out s10, out s11_655);
			}
			else
			{
				word32 a5_634;
				word32 a7_635;
				word32 s3_636;
				word32 s4_637;
				word32 s8_640;
				word32 s9_641;
				word32 s11_642;
				word32 s5_638;
				word32 s6_639;
				word32 a4_633;
				word32 a3_632;
				word32 a1_630;
				word32 a2_631;
				ra_132 = snprintf(ra_124, s1_115, s0_121, s8_118 + 840, dwLoc0128, dwLoc0108, dwLocDC, dwLocC0, 0x00, dwLoc98, dwLoc74, out s0_133, out s1_134, out a0_125, out a1_630, out a2_631, out a3_632, out a4_633, out a5_634, out a7_635, out s2_137, out s3_636, out s4_637, out s5_638, out s6_639, out s7_142, out s8_640, out s9_641, out s10, out s11_642);
			}
			if (a0_125 < 0x00 || a0_125 >= s0_133)
			{
l2309D1F8:
				a0_265.u0 = 0xFD000680;
				goto l2309D1FE;
			}
			Eq_2 s0_179 = s0_133 - a0_125;
			Eq_2 s1_181 = (word32) a0_125 + s1_134;
			Eq_562523 a5_182 = 0x00;
			while (a5_182 < s2_137->t0010 && a5_182 != 0x00FF)
			{
				word32 a4_194 = CONVERT(Mem188[Mem188[s2_137 + 20:int32] + a5_182:byte], byte, word32);
				if (a4_194 <= 0x1F || (a4_194 == 0x007F || ((word32) a4_194.u0 + 0x007F & 0x00FF) <= 0x1E))
					a4_194.u0 = 63;
				Mem209[fp + -304 + a5_182:byte] = SLICE(a4_194, byte, 0);
				a5_182 = (word32) a5_182 + 1;
			}
			Mem232[a5_182 + (fp + -48) + 0x0F00:byte] = 0x00;
			Eq_562534 a0_238;
			Eq_562534 s0_246;
			word32 s1_247;
			word32 a1_656;
			word32 a3_657;
			word32 a4_658;
			word32 a5_659;
			word32 s11_662;
			word32 a7_660;
			word32 s7_661;
			ra_124 = snprintf(ra_132, s1_181, s0_179, s7_142 + -0x0688, dwLoc0128, dwLoc0108, dwLocDC, dwLocC0, 0x00, dwLoc98, dwLoc74, out s0_246, out s1_247, out a0_238, out a1_656, out a2_106, out a3_657, out a4_658, out a5_659, out a7_660, out s2_103, out s3_11, out s4_252, out s5_253, out s6_13, out s7_661, out s8_118, out s9_149, out s10, out s11_662);
			if (a0_238 < 0x00 || a0_238 >= s0_246)
				goto l2309D1F8;
			s0_121 = s0_246 - a0_238;
			s1_15 = (word32) a0_238 + s1_247;
			a5_105 = (word32) *((word32) s2_103 + 28);
		}
		s2_103 = *((word32) s2_103 + 24);
	}
	a0_265 = s3_11 - s0_121;
l2309D1FE:
	s10Out = s10;
	return a0_265;
}

// 2309D2D8: Register Eq_2 mbedtls_x509_serial_gets(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_521130) a2, Register Eq_2 s7, Register Eq_2 s9, Stack Eq_2 dwArg08, Stack word32 dwArg1C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_521142 s2Out, Register out Eq_521142 s3Out, Register out Eq_2 s4Out, Register out ptr32 s7Out, Register out Eq_521142 s10Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_x509_serial_gets(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_521130 * a2, Eq_2 s7, Eq_2 s9, Eq_2 dwArg08, word32 dwArg1C, Eq_2 dwArg34, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_521142 & s2Out, union Eq_521142 & s3Out, union Eq_2 & s4Out, ptr32 & s7Out, union Eq_521142 & s10Out)
{
	Eq_521142 s3_100 = a2->t0004;
	Eq_2 s4_111 = a0;
	Eq_2 s1_128 = a1;
	struct Eq_521130 * s5_102 = a2;
	if (s3_100 > 32)
		s3_100.u0 = 0x1C;
	Eq_2 s0_110 = a1;
	Eq_521142 s2_112 = 0x00;
	Eq_521142 s8_105 = (word32) s3_100 - 1;
	word32 s9_106 = 0x230CB000;
	ptr32 s7_104 = 588017084;
	Eq_521142 s10_129 = 0x01;
	while (true)
	{
		ptr32 a0_143;
		if (s2_112 == s3_100)
			break;
		byte * a5_52 = s5_102->ptr0008;
		if (s2_112 != 0x00 || (s3_100 == s10_129 || (word32) (*a5_52) != 0x00))
		{
			Eq_562696 a0_87;
			Eq_562696 s0_95;
			word32 s4_101;
			word32 a7_439;
			word32 s11_441;
			word32 s6_440;
			word32 a1_434;
			word32 a5_438;
			word32 a2_435;
			word32 a3_436;
			word32 a4_437;
			ra = snprintf(ra, s4_111, s0_110, s9_106 + 856, dwLoc18, dwArg08, dwArg34, s9, s7, dwArg78, dwArg9C, out s0_95, out s1_128, out a0_87, out a1_434, out a2_435, out a3_436, out a4_437, out a5_438, out a7_439, out s2_112, out s3_100, out s4_101, out s5_102, out s6_440, out s7_104, out s8_105, out s9_106, out s10_129, out s11_441);
			if (a0_87 < 0x00 || a0_87 >= s0_95)
				goto l2309D380;
			s0_110 = s0_95 - a0_87;
			s4_111 = (word32) a0_87 + s4_101;
		}
		s2_112 = (word32) s2_112 + 1;
	}
	if (s5_102->t0004 != s2_112)
	{
		Eq_562644 a0_119;
		Eq_562644 s0_127;
		word32 s8_431;
		word32 s11_433;
		word32 s9_432;
		word32 a2_423;
		word32 a4_425;
		word32 a5_426;
		word32 s6_430;
		word32 a7_427;
		word32 s4_428;
		word32 s5_429;
		word32 a3_424;
		word32 a1_422;
		ra = snprintf(ra, s4_111, s0_110, &g_t230CB360, dwLoc18, dwArg08, dwArg34, s9, s7, dwArg78, dwArg9C, out s0_127, out s1_128, out a0_119, out a1_422, out a2_423, out a3_424, out a4_425, out a5_426, out a7_427, out s2_112, out s3_100, out s4_428, out s5_429, out s6_430, out s7_104, out s8_431, out s9_432, out s10_129, out s11_433);
		if (a0_119 < 0x00 || a0_119 >= s0_127)
		{
l2309D380:
			a0_143 = 0xFD000680;
l2309D386:
			0x00 = dwArg0128;
			0x00 = dwArg1C;
			s0Out = s4;
			s1Out = s1_128;
			a0Out = a0_143;
			s2Out = s2_112;
			s3Out = s3_100;
			s4Out = dwArg78;
			s7Out = s7_104;
			s10Out = s10_129;
			return ra;
		}
		s0_110 = s0_127 - a0_119;
	}
	a0_143 = s1_128 - s0_110;
	goto l2309D386;
}

// 2309D3AE: Register Eq_2 mbedtls_x509_sig_alg_gets(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_521422 s0Out, Register out Eq_521422 a0Out, Register out ptr32 a5Out, Register out (ptr32 Eq_521425) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_x509_sig_alg_gets(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_521422 & s0Out, union Eq_521422 & a0Out, ptr32 & a5Out, struct Eq_521425 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s10Out)
{
	ptr32 s7_165;
	ptr32 s3_156;
	struct Eq_521425 * s2_153;
	ptr32 s10_147;
	Eq_2 ra_139;
	ptr32 a5_133;
	Eq_521422 a0_119;
	Eq_521422 s0_40;
	word32 a0_19;
	Eq_2 s1_25 = mbedtls_oid_get_sig_alg_desc(a2, fp + ~0x13, a2, a5, out a0_19);
	if (a0_19 != 0x00)
	{
		word32 s11_210;
		word32 s8_208;
		word32 s9_209;
		word32 s5_206;
		word32 s6_207;
		word32 a7_204;
		word32 s4_205;
		word32 a3_202;
		word32 a4_203;
		word32 a1_200;
		word32 a2_201;
		word32 s1_199;
		ra_139 = snprintf(ra, s1_25, a1, &g_t230BD284, dwLoc08, dwArg18, dwArg44, dwArg60, 0x00, dwArg88, dwArgAC, out s0_40, out s1_199, out a0_119, out a1_200, out a2_201, out a3_202, out a4_203, out a5_133, out a7_204, out s2_153, out s3_156, out s4_205, out s5_206, out s6_207, out s7_165, out s8_208, out s9_209, out s10_147, out s11_210);
	}
	else
	{
		word32 s11_198;
		word32 s8_196;
		word32 s9_197;
		word32 s5_194;
		word32 s6_195;
		word32 a7_192;
		word32 s4_193;
		word32 a3_190;
		word32 a4_191;
		word32 a1_188;
		word32 a2_189;
		word32 s1_187;
		ra_139 = snprintf(ra, s1_25, a1, &g_t230C6978, dwLoc08, dwArg18, dwArg44, dwArg60, 0x00, dwArg88, dwArgAC, out s0_40, out s1_187, out a0_119, out a1_188, out a2_189, out a3_190, out a4_191, out a5_133, out a7_192, out s2_153, out s3_156, out s4_193, out s5_194, out s6_195, out s7_165, out s8_196, out s9_197, out s10_147, out s11_198);
	}
	if (a0_119 < 0x00 || a0_119 >= s0_40)
		a0_119.u0 = 0xFD000680;
	s0Out = s0_40;
	a0Out = a0_119;
	a5Out = a5_133;
	s2Out = s2_153;
	s3Out = s3_156;
	s4Out = dwArg04;
	s7Out = s7_165;
	s10Out = s10_147;
	return ra_139;
}

// 2309D402: Register Eq_2 mbedtls_x509_key_size_helper(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out (ptr32 Eq_521474) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      mbedtls_x509_crt_info
Eq_2 mbedtls_x509_key_size_helper(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, struct Eq_521474 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out)
{
	ptr32 a0_39;
	Eq_562835 a0_15;
	ptr32 a5_20;
	Eq_562835 s0_23;
	ptr32 s1_24;
	ptr32 s10_25;
	struct Eq_521474 * s2_27;
	ptr32 s3_28;
	ptr32 s4_29;
	ptr32 s5_30;
	ptr32 s6_31;
	ptr32 s7_32;
	word32 s9_118;
	word32 s11_119;
	word32 a7_116;
	word32 s8_117;
	word32 a3_114;
	word32 a4_115;
	word32 a1_112;
	word32 a2_113;
	Eq_2 ra_22 = snprintf(ra, a0, a1, &g_t230CB34C, dwArg08, dwArg28, dwArg54, dwArg70, ra, dwArg98, dwArgBC, out s0_23, out s1_24, out a0_15, out a1_112, out a2_113, out a3_114, out a4_115, out a5_20, out a7_116, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31, out s7_32, out s8_117, out s9_118, out s10_25, out s11_119);
	if (a0_15 >= 0x00 && a0_15 < s0_23)
		a0_39 = 0x00;
	else
		a0_39 = 0xFD000680;
	s1Out = s1_24;
	a0Out = a0_39;
	a5Out = a5_20;
	s2Out = s2_27;
	s3Out = s3_28;
	s4Out = s4_29;
	s5Out = s5_30;
	s6Out = s6_31;
	s7Out = s7_32;
	s10Out = s10_25;
	return ra_22;
}

// 2309D432: Register word32 mbedtls_x509_time_is_past()
// Called from:
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
word32 mbedtls_x509_time_is_past()
{
	return 0x00;
}

// 2309D436: Register word32 mbedtls_x509_time_is_future()
// Called from:
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
word32 mbedtls_x509_time_is_future()
{
	return 0x00;
}

// 2309D43A: Register int32 mbedtls_base64_decode(Register (ptr32 Eq_551101) a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_551106 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_551111) a5Out, Register out (ptr32 byte) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mbedtls_pem_read_buffer
int32 mbedtls_base64_decode(struct Eq_551101 * a0, Eq_2 a1, union Eq_2 * a2, Eq_2 a3, Eq_2 a4, union Eq_551106 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_551111 & a5Out, byte & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	struct Eq_551111 * a5_17 = null;
	uint32 a6_18 = 0x00;
	Eq_2 a7_105 = 0x00;
l2309D46E:
	Eq_551106 a0_148;
	if (a7_105 >= a4)
		a4 = a7_105;
	else
	{
		word32 t4_31 = 0x00;
		do
		{
			word32 t6_34 = a3 + a7_105;
			struct Eq_562907 * t1_36 = (word32) t6_34->b0000;
			if (t1_36 != (struct Eq_562907 *) 32)
			{
				if (a4 == a7_105)
					break;
				s5 = a4 - a7_105;
				if (s5 > 0x01 && t1_36 == (struct Eq_562907 *) 0x0D)
				{
					if ((word32) t6_34->b0001 == 0x0A)
						goto l2309D4B0;
					goto l2309D4B8;
				}
				if (t1_36 != (struct Eq_562907 *) 0x0A)
				{
l2309D4B8:
					if (t4_31 != 0x00)
					{
l2309D4C6:
						a0_148.u0 = -44;
						goto l2309D542;
					}
					if (t1_36 == (struct Eq_562907 *) 61)
					{
						++a5_17;
						if (a5_17 > (struct Eq_551111 *) 0x02)
							goto l2309D4C6;
						goto l2309D4D8;
					}
					if ((int32) (byte) t1_36 < 0x00)
						goto l2309D4C6;
l2309D4D8:
					Eq_562990 t1_80 = (word32) t1_36->b230CB368;
					if (t1_80 == 0x007F || t1_80 <= 63 && a5_17 != null)
						goto l2309D4C6;
					++a6_18;
				}
l2309D4B0:
				a7_105 = (word32) a7_105 + 1;
				goto l2309D46E;
			}
			a7_105 = (word32) a7_105 + 1;
			++t4_31;
		} while (a4 != a7_105);
	}
	if (a6_18 == 0x00)
		*a2 = (union Eq_2 *) 0x00;
	else
	{
		Eq_2 a6_117 = (a6_18 >> 0x03) + 0x06 - a5_17 + ((a6_18 & 7) + 0x0D >> 0x03);
		if (a0 == null || a1 < a6_117)
		{
			*a2 = (union Eq_2 *) a6_117;
			a0_148.u0 = -42;
			goto l2309D542;
		}
		a4 += a3;
		struct Eq_551101 * a5_161 = a0;
		uint32 a6_162 = 0x00;
		word32 a7_163 = 0x03;
		word32 t1_164 = 0x00;
		while (a4 != a3)
		{
			struct Eq_562962 * t3_174 = (word32) *a3;
			uint32 a1_176 = (char *) t3_174 - 0x0A & 0x00FF;
			if (a1_176 <= 22)
			{
				uint32 a1_179 = 0x00400009 >> a1_176;
				a1 = a1_179 & 0x01;
				if ((a1_179 & 0x01) == 0x00)
					goto l2309D56A;
			}
			else
			{
l2309D56A:
				Eq_563003 a1_186 = (word32) t3_174->b230CB368;
				++t1_164;
				a1 = a1_186 & 63;
				a7_163 -= (word32) (a1_186 < -65);
				a6_162 = a1_186 & 63 | a6_162 << 6;
				if (t1_164 == 0x04)
				{
					t1_164 = 0x00;
					if (a7_163 != 0x00)
					{
						a5_161->b0000 = (byte) (a6_162 >> 0x10);
						a1 = a6_162 >> 0x10;
						if (a7_163 == 0x01)
							a5_161 = (struct Eq_551101 *) &a5_161->b0001;
						else
						{
							a5_161->b0001 = (byte) (a6_162 >> 0x08);
							a1 = a6_162 >> 0x08;
							if (a7_163 == 0x02)
								a5_161 = (struct Eq_551101 *) &a5_161->b0002;
							else
							{
								a5_161->b0002 = (byte) a6_162;
								++a5_161;
							}
						}
					}
				}
			}
			a3 = (word32) a3 + 1;
		}
		a5_17 = a5_161 - a0;
		a5_17->dw0000 = a2;
	}
	a0_148.u0 = 0x00;
l2309D542:
	a0Out = a0_148;
	a1Out = a1;
	a2Out = s2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_17;
	s2Out = (byte *) 63;
	s3Out = 0x02;
	s4Out = dwArg28;
	s5Out = s5;
	return 0x007F;
}

// 2309D5BC: void utils_notifier_chain_init(Register (ptr32 Eq_96932) a0)
// Called from:
//      hal_hbn_init
void utils_notifier_chain_init(struct Eq_96932 * a0)
{
	utils_list_init(a0);
}

