pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309D5CC: Register word32 utils_notifier_chain_register(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      hal_hbn_init
word32 utils_notifier_chain_register(Eq_2 a0, Eq_2 a1)
{
	if (a0 == 0x00 || a1 == 0x00)
		return a2;
	utils_list_push_back(a1, (struct Eq_106483 *) ~0x00);
	return dwArg10;
}

// 2309D5EA: Register Eq_2 utils_notifier_chain_call(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 a1, Register (ptr32 Eq_485159) a5, Register out ptr32 s1Out, Register out ptr32 a2Out)
// Called from:
//      hal_hbn_enter
Eq_2 utils_notifier_chain_call(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 a1, struct Eq_485159 * a5, ptr32 & s1Out, ptr32 & a2Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a2Out = a2;
		return ra;
	}
	else
	{
		word32 a0_12 = *s0;
		ptr32 s1_14 = a1;
		while (s0 != 0x00)
		{
			struct Eq_485159 * a5_33;
			union Eq_2 * s0_18 = a5->ptr0004;
			if (a5 != null)
			{
				word32 a2_31;
				word32 tp_32;
				a5();
				a5 = a5_33;
			}
			s0 = *s0_18;
		}
		s1Out = s1_14;
		a2Out = dwArg10;
		return ra;
	}
}

// 2309D618: Register Eq_2 fabs(Register Eq_2 a1)
// Called from:
//      print_number
//      __ieee754_pow
Eq_2 fabs(Eq_2 a1)
{
	return (word32) (word31) a1;
}

// 2309D624: Register Eq_2 floor(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out)
// Called from:
//      print_number
Eq_2 floor(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out)
{
	Eq_2 a4_134;
	Eq_2 a3_133;
	int32 a5_6 = a1 >> 0x14 & 0x07FF;
	Eq_2 s2_125 = a1;
	Eq_2 s4_124 = a0;
	if (a5_6 > -0x0412)
	{
		if (a5_6 > -0x0432)
		{
			a3_133 = a0;
			a4_134 = a1;
			if (a5_6 == -0x07FF)
			{
				Eq_2 a1_85;
				a3_133 = __adddf3(ra, a0, a1, a0, a1, fflags, frm, out a1_85);
				a4_134 = a1_85;
			}
		}
		else
		{
			uint32 s5_33 = -1 >> a5_6 + -0x0413;
			a3_133 = a0;
			a4_134 = a1;
			if ((s5_33 & a0) != 0x00)
			{
				Eq_2 a1_44;
				word32 a1_274;
				word32 a4_275;
				word32 a5_276;
				if (__gedf2(__adddf3(ra, a0, a1, g_t4200ED28, g_t4200ED2C, fflags, frm, out a1_44), a1_44, 0, 0, fflags, frm, out a1_274, out a4_275, out a5_276) > 0x00)
				{
					if (a1 < 0x00)
					{
						if (a5_6 != -0x0413)
						{
							Eq_2 s3_71 = (word32) a0 + (1 << 52 - (a5_6 + -0x03FF));
							if (s3_71 < a0)
							{
								s2_125 = (word32) a1 + 1;
								s4_124 = s3_71;
							}
							else
								s4_124 = s3_71;
						}
						else
							s2_125 = (word32) a1 + 1;
					}
					s4_124 &= ~s5_33;
				}
				goto l2309D6CC;
			}
		}
l2309D6D4:
		a1Out = a4_134;
		return a3_133;
	}
	else
	{
		if (a5_6 >= ~0x03FE)
		{
			int32 s5_130 = 0x000FFFFF >> a5_6 + -0x03FF;
			a3_133 = a0;
			a4_134 = a1;
			if ((s5_130 & a1 | a0) == 0x00)
				goto l2309D6D4;
			Eq_2 a1_140;
			word32 a4_272;
			word32 a1_271;
			word32 a5_273;
			if (__gedf2(__adddf3(ra, a0, a1, g_t4200ED28, g_t4200ED2C, fflags, frm, out a1_140), a1_140, 0, 0, fflags, frm, out a1_271, out a4_272, out a5_273) > 0x00)
			{
				if (a1 < 0x00)
					s2_125 = (word32) a1 + (0x00100000 >> a5_6 + -0x03FF);
				s2_125 &= ~s5_130;
				s4_124.u0 = 0;
			}
		}
		else
		{
			Eq_2 a1_100;
			word32 a1_268;
			word32 a4_269;
			word32 a5_270;
			if (__gedf2(__adddf3(ra, a0, a1, g_t4200ED28, g_t4200ED2C, fflags, frm, out a1_100), a1_100, 0, 0, fflags, frm, out a1_268, out a4_269, out a5_270) > 0x00)
			{
				if (a1 >= 0x00)
				{
					s4_124.u0 = 0;
					s2_125.u0 = 0;
				}
				else
				{
					s4_124.u0 = 0;
					if (((word32) (word31) a1 | a0) != 0x00)
						s2_125.u0 = 0xBFF00000;
				}
			}
		}
l2309D6CC:
		a3_133 = s4_124;
		a4_134 = s2_125;
		goto l2309D6D4;
	}
}

// 2309D810: void modf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_474433) a2, Register ptr32 fflags, Register ptr32 frm)
// Called from:
//      ecvtbuf
void modf(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_474433 * a2, ptr32 fflags, ptr32 frm)
{
	Eq_2 a6_22;
	Eq_2 t1_21;
	int32 a4_6 = a1 >> 0x14 & 0x07FF;
	Eq_2 a5_11 = a1;
	if (a4_6 <= -0x0412)
	{
		if (a4_6 < ~0x03FE)
		{
			a2->t0000.u0 = 0;
			a2->t0004 = a1 & 0x80000000;
			return;
		}
		int32 a6_35 = 0x000FFFFF >> a4_6 + -0x03FF;
		if ((a6_35 & a1 | a0) == 0x00)
			goto l2309D850;
		a5_11 = ~a6_35 & a1;
		t1_21.u0 = 0;
		a6_22.u0 = 0;
	}
	else
	{
		if (a4_6 > -0x0432)
			goto l2309D850;
		uint32 a4_17 = -1 >> a4_6 + -0x0413;
		if ((a4_17 & a0) == 0x00)
		{
l2309D850:
			a2->t0004 = a1;
			a2->t0000 = a0;
			return;
		}
		Eq_2 a3_20 = ~a4_17 & a0;
		t1_21 = a3_20;
		a6_22 = a3_20;
	}
	a2->t0000 = t1_21;
	a2->t0004 = a5_11;
	word32 a1_106;
	__subdf3(ra, a0, a1, a6_22, a5_11, fflags, frm, out a1_106);
}

// 2309D904: Register Eq_2 pow(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      parse_value
Eq_2 pow(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 a1_29;
	Eq_2 s2_45;
	Eq_2 s3_46;
	ptr32 fflags_158;
	ptr32 frm_159;
	Eq_2 a0_28 = __ieee754_pow(ra, a0, a1, a2, a3, fflags, frm, out a1_29, out s2_45, out s3_46, out fflags_158, out frm_159);
	Eq_2 s4_171 = a0_28;
	Eq_2 s5_172 = a1_29;
	if (g_dw4200F724 != -1 && __unorddf2(a2, a3, a2, a3, fflags_158, frm_159) == 0x00)
	{
		if (__unorddf2(s2_45, s3_46, s2_45, s3_46, fflags_158, frm_159) != 0x00)
		{
			word32 a5_431;
			word32 a4_430;
			word32 a1_429;
			if (__eqdf2(a2, a3, 0, 0, fflags_158, frm_159, out a1_429, out a4_430, out a5_431) != 0x00)
				goto l2309D9DC;
			goto l2309DA78;
		}
		word32 a5_434;
		word32 a4_433;
		word32 a1_432;
		if (__eqdf2(s2_45, s3_46, 0, 0, fflags_158, frm_159, out a1_432, out a4_433, out a5_434) == 0x00)
		{
			word32 a5_437;
			word32 a4_436;
			word32 a1_435;
			if (__eqdf2(a2, a3, 0, 0, fflags_158, frm_159, out a1_435, out a4_436, out a5_437) != 0x00)
			{
				if (finite(a3) != 0x00)
				{
					word32 a7_441;
					word32 a5_440;
					word32 a4_439;
					word32 a1_438;
					if (__ledf2(a2, a3, 0, 0, fflags_158, frm_159, out a1_438, out a4_439, out a5_440, out a7_441) < 0x00)
					{
						word32 a5_442;
						*__errno(out a5_442) = 33;
						s4_171 = g_t4200ED30;
						s5_172 = g_t4200ED34;
					}
				}
				goto l2309D9DC;
			}
l2309DA78:
			s4_171 = g_t4200ED20;
			s5_172 = g_t4200ED24;
			goto l2309D9DC;
		}
		if (finite(a1_29) != 0x00 || (finite(s3_46) == 0x00 || finite(a3) == 0x00))
		{
			word32 a5_445;
			word32 a4_444;
			word32 a1_443;
			if (__eqdf2(a0_28, a1_29, 0, 0, fflags_158, frm_159, out a1_443, out a4_444, out a5_445) == 0x00 && (finite(s3_46) != 0x00 && finite(a3) != 0x00))
			{
				word32 a5_446;
				*__errno(out a5_446) = 0x0022;
				s4_171.u0 = 0;
				s5_172.u0 = 0;
			}
			goto l2309D9DC;
		}
		if (__unorddf2(a0_28, a1_29, a0_28, a1_29, fflags_158, frm_159) != 0x00)
		{
			word32 a5_447;
			*__errno(out a5_447) = 33;
			Eq_2 a0_143;
			Eq_2 a1_144;
			word32 a3_450;
			word32 s1_449;
			word32 s2_451;
			word32 s0_448;
			word32 s3_452;
			word32 s5_453;
			word32 s6_454;
			word32 s7_455;
			word32 s9_456;
			__divdf3(ra, 0, 0, 0, 0, fflags_158, frm_159, out s0_448, out s1_449, out a0_143, out a1_144, out a3_450, out s2_451, out s3_452, out s5_453, out s6_454, out s7_455, out s9_456, out fflags_158, out frm_159);
			s4_171 = a0_143;
			s5_172 = a1_144;
			goto l2309D9DC;
		}
		word32 a5_457;
		*__errno(out a5_457) = 0x0022;
		word32 a1_458;
		word32 a4_459;
		word32 a5_460;
		word32 a7_461;
		if (__ledf2(s2_45, s3_46, 0, 0, fflags_158, frm_159, out a1_458, out a4_459, out a5_460, out a7_461) >= 0x00)
		{
l2309DAE8:
			s4_171 = g_t4200ED38;
			s5_172 = g_t4200ED3C;
			goto l2309D9DC;
		}
		Eq_2 a1_202;
		word32 a1_462;
		word32 a4_463;
		word32 a5_464;
		if (__eqdf2(rint(ra, a2, a3, fflags_158, frm_159, out a1_202), a1_202, a2, a3, fflags_158, frm_159, out a1_462, out a4_463, out a5_464) == 0x00)
			goto l2309DAE8;
		s4_171 = g_t4200ED30;
		s5_172 = g_t4200ED34;
	}
l2309D9DC:
	a1Out = s5_172;
	fflagsOut = fflags_158;
	frmOut = frm_159;
	return s4_171;
}

