pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309DB78: Register Eq_2 __ieee754_pow(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      pow
Eq_2 __ieee754_pow(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 a1_100;
	Eq_2 a0_102;
	if ((a3 & 0x7FFFFFFF | a2) != 0x00)
	{
		int32 s0_270 = a1 & 0x7FFFFFFF;
		Eq_2 s5_275 = a1;
		if ((a1 & 0x7FFFFFFF) > 0x7FF00000)
		{
l2309DBD8:
			a1_100.u0 = 0x3FF00000;
			a0_102.u0 = 0;
			if (((a1 & 0x7FFFFFFF) + 0xC0100000 | a0) == 0x00)
				goto l2309DBF0;
			goto l2309DCD4;
		}
		if ((a1 & 0x7FFFFFFF) != 0x7FF00000)
		{
			if ((a3 & 0x7FFFFFFF) > 0x7FF00000)
				goto l2309DBD8;
		}
		else if (a0 != 0x00 || (a1 & 0x7FFFFFFF) < (a3 & 0x7FFFFFFF))
		{
l2309DCD4:
			Eq_2 a1_3260;
			Eq_2 a0_3259 = nan(out a1_3260);
			a1Out = a1_3260;
			s2Out = s2;
			s3Out = s3;
			fflagsOut = fflags;
			frmOut = frm;
			return a0_3259;
		}
		if ((a3 & 0x7FFFFFFF) == 0x7FF00000 && a2 != 0x00)
			goto l2309DBD8;
		Eq_2 s10_290 = 0;
		if (a1 < 0x00)
		{
			if ((a3 & 0x7FFFFFFF) < 0x43400000)
			{
				if ((a3 & 0x7FFFFFFF) >= 0x3FF00000)
				{
					int32 a3_63 = (a3 & 0x7FFFFFFF) >> 0x14;
					if (a3_63 <= -0x0413)
					{
						if (a2 != 0x00)
						{
							a1_100 = fabs(a1);
							if (a0 != 0x00)
							{
l2309DEA4:
								Eq_2 a1_366;
								Eq_2 a0_365 = __subdf3(ra, a0, a1, a0, a1, fflags, frm, out a1_366);
								word32 s2_4061;
								word32 s1_4059;
								word32 a3_4060;
								word32 s0_4058;
								word32 s3_4062;
								word32 s5_4063;
								word32 s6_4064;
								word32 s9_4066;
								word32 s7_4065;
								__divdf3(ra, a0_365, a1_366, a0_365, a1_366, fflags, frm, out s0_4058, out s1_4059, out a0_102, out a1_100, out a3_4060, out s2_4061, out s3_4062, out s5_4063, out s6_4064, out s7_4065, out s9_4066, out fflags, out frm);
								goto l2309DBF0;
							}
l2309DDC0:
							a0_102 = a0;
							if ((a1 & 0x7FFFFFFF) == 0x00 || (word32) ((word30) a1) == 0x3FF00000)
							{
								if (a3 < 0x00)
								{
									word32 s2_4080;
									word32 s3_4081;
									word32 s1_4078;
									word32 a3_4079;
									word32 s6_4082;
									word32 s9_4084;
									word32 s7_4083;
									ra = __divdf3(ra, g_t4200ED20, g_t4200ED24, a0, a1_100, fflags, frm, out s0_270, out s1_4078, out a0_102, out a1_100, out a3_4079, out s2_4080, out s3_4081, out s5_275, out s6_4082, out s7_4083, out s9_4084, out fflags, out frm);
								}
								if (s5_275 < 0x00)
								{
									if ((s0_270 + 0xC0100000 | s10_290) == 0x00)
									{
										Eq_2 a1_307;
										Eq_2 a0_306 = __subdf3(ra, a0_102, a1_100, a0_102, a1_100, fflags, frm, out a1_307);
										word32 s9_4093;
										word32 s2_4088;
										word32 a3_4087;
										word32 s0_4085;
										word32 s1_4086;
										word32 s3_4089;
										word32 s7_4092;
										word32 s6_4091;
										word32 s5_4090;
										__divdf3(ra, a0_306, a1_307, a0_306, a1_307, fflags, frm, out s0_4085, out s1_4086, out a0_102, out a1_100, out a3_4087, out s2_4088, out s3_4089, out s5_4090, out s6_4091, out s7_4092, out s9_4093, out fflags, out frm);
									}
									else if (s10_290 == 1)
										a1_100 = a1_100 ^ 0x80000000;
								}
l2309DBF0:
								a1Out = a1_100;
								s2Out = s2;
								s3Out = s3;
								fflagsOut = fflags;
								frmOut = frm;
								return a0_102;
							}
l2309DD6C:
							uint32 t3_348 = (a1 >> 0x1F) + -1;
							Eq_2 a0_426 = a0;
							if ((s10_290 | t3_348) != 0x00)
							{
								Eq_2 s1_1615;
								ptr32 fflags_1529;
								ptr32 frm_1530;
								Eq_2 ra_1531;
								Eq_2 s9_1541;
								struct Eq_563741 * s5_1537;
								if ((a3 & 0x7FFFFFFF) > 0x41E00000)
								{
									if ((a3 & 0x7FFFFFFF) > 0x43F00000)
									{
										if ((a1 & 0x7FFFFFFF) < 0x3FF00000)
										{
l2309DD94:
											if (a3 < 0x00)
											{
l2309DD98:
												Eq_2 a2_3150 = g_t4200ED28;
												Eq_2 a3_3151 = g_t4200ED2C;
												word32 s3_4071;
												word32 s0_4067;
												word32 s1_4068;
												word32 a3_4069;
												word32 s2_4070;
												word32 s4_4072;
												word32 s5_4073;
												word32 s7_4075;
												word32 s6_4074;
												word32 s8_4076;
												word32 s9_4077;
												__muldf3(ra, a2_3150, a3_3151, a2_3150, a3_3151, fflags, frm, out s0_4067, out s1_4068, out a0_102, out a1_100, out a3_4069, out s2_4070, out s3_4071, out s4_4072, out s5_4073, out s6_4074, out s7_4075, out s8_4076, out s9_4077, out fflags, out frm);
												goto l2309DBF0;
											}
											goto l2309DE2C;
										}
										goto l2309DE64;
									}
									if ((a1 & 0x7FFFFFFF) <= 0x3FEFFFFE)
										goto l2309DD94;
									if ((a1 & 0x7FFFFFFF) > 0x3FF00000)
									{
l2309DE64:
										if (a3 > 0x00)
											goto l2309DD98;
										goto l2309DE2C;
									}
									Eq_2 a1_1677;
									ptr32 fflags_1707;
									ptr32 frm_1708;
									Eq_2 s0_1710;
									Eq_2 s1_1711;
									Eq_2 a0_1728;
									Eq_2 a1_1729;
									ptr32 fflags_1743;
									ptr32 frm_1744;
									Eq_2 s0_1746;
									Eq_2 s1_1747;
									Eq_2 a0_1764;
									Eq_2 a1_1765;
									ptr32 fflags_1779;
									ptr32 frm_1780;
									Eq_2 s0_1782;
									Eq_2 s1_1783;
									word32 a0_4094;
									word32 s7_4111;
									word32 a1_4095;
									word32 s2_4097;
									word32 a3_4096;
									word32 s4_4099;
									word32 s3_4098;
									word32 s2_4106;
									word32 s3_4107;
									word32 s4_4108;
									word32 s5_4109;
									word32 s6_4101;
									word32 s8_4103;
									word32 s9_4104;
									word32 s7_4102;
									word32 s5_4100;
									word32 s8_4112;
									word32 a3_4105;
									word32 s6_4110;
									word32 s2_4115;
									word32 s9_4113;
									word32 a3_4114;
									word32 s3_4116;
									word32 s4_4117;
									word32 s6_4119;
									word32 s7_4120;
									word32 s8_4121;
									word32 s5_4118;
									word32 s9_4122;
									Eq_2 ra_1781 = __muldf3(__muldf3(__muldf3(ra, __subdf3(ra, a0, a1_100, g_t4200ED20, g_t4200ED24, fflags, frm, out a1_1677), a1_1677, g_t4200ED60, g_t4200ED64, fflags, frm, out s0_1710, out s1_1711, out a0_4094, out a1_4095, out a3_4096, out s2_4097, out s3_4098, out s4_4099, out s5_4100, out s6_4101, out s7_4102, out s8_4103, out s9_4104, out fflags_1707, out frm_1708), s0_1710, s1_1711, g_t4200ED68, g_t4200ED6C, fflags_1707, frm_1708, out s0_1746, out s1_1747, out a0_1728, out a1_1729, out a3_4105, out s2_4106, out s3_4107, out s4_4108, out s5_4109, out s6_4110, out s7_4111, out s8_4112, out s9_4113, out fflags_1743, out frm_1744), s0_1746, s1_1747, g_t4200ED70, g_t4200ED74, fflags_1743, frm_1744, out s0_1782, out s1_1783, out a0_1764, out a1_1765, out a3_4114, out s2_4115, out s3_4116, out s4_4117, out s5_4118, out s6_4119, out s7_4120, out s8_4121, out s9_4122, out fflags_1779, out frm_1780);
									Eq_2 a1_1799;
									Eq_2 a0_1810;
									Eq_2 a1_1811;
									ptr32 fflags_1825;
									ptr32 frm_1826;
									Eq_2 s0_1828;
									Eq_2 s1_1829;
									word32 a3_4123;
									word32 s2_4124;
									word32 s3_4125;
									word32 s5_4127;
									word32 s4_4126;
									word32 s6_4128;
									word32 s8_4130;
									word32 s9_4131;
									word32 s7_4129;
									Eq_2 ra_1827 = __muldf3(ra_1781, __subdf3(ra_1781, g_t4200ED78, g_t4200ED7C, a0_1764, a1_1765, fflags_1779, frm_1780, out a1_1799), a1_1799, s0_1782, s1_1783, fflags_1779, frm_1780, out s0_1828, out s1_1829, out a0_1810, out a1_1811, out a3_4123, out s2_4124, out s3_4125, out s4_4126, out s5_4127, out s6_4128, out s7_4129, out s8_4130, out s9_4131, out fflags_1825, out frm_1826);
									word32 a1_4132;
									__subdf3(ra_1827, g_t4200ED80, g_t4200ED84, a0_1810, a1_1811, fflags_1825, frm_1826, out a1_4132);
									Eq_2 a0_1860;
									Eq_2 a1_1861;
									ptr32 fflags_1875;
									ptr32 frm_1876;
									Eq_2 s6_1884;
									Eq_2 s7_1885;
									Eq_2 a0_1892;
									Eq_2 a1_1893;
									ptr32 fflags_1907;
									ptr32 frm_1908;
									Eq_2 a0_1924;
									Eq_2 a1_1925;
									Eq_2 s2_1944;
									Eq_2 s3_1945;
									word32 s0_4133;
									word32 s3_4137;
									word32 s4_4138;
									word32 s1_4134;
									word32 s2_4136;
									word32 a3_4135;
									word32 s5_4148;
									word32 s5_4139;
									word32 s8_4140;
									word32 s9_4141;
									word32 s4_4147;
									word32 s3_4146;
									word32 s2_4145;
									word32 a3_4144;
									word32 s1_4143;
									word32 s0_4142;
									word32 s7_4150;
									word32 s6_4149;
									word32 s8_4151;
									word32 s4_4156;
									word32 s8_4159;
									word32 s9_4152;
									word32 s0_4153;
									word32 a3_4155;
									word32 s1_4154;
									word32 s6_4157;
									word32 s7_4158;
									ra_1531 = __muldf3(__muldf3(__muldf3(ra_1827, s0_1828, s1_1829, s0_1828, s1_1829, fflags_1825, frm_1826, out s0_4133, out s1_4134, out a0_1860, out a1_1861, out a3_4135, out s2_4136, out s3_4137, out s4_4138, out s5_4139, out s6_1884, out s7_1885, out s8_4140, out s9_4141, out fflags_1875, out frm_1876), s6_1884, s7_1885, a0_1860, a1_1861, fflags_1875, frm_1876, out s0_4142, out s1_4143, out a0_1892, out a1_1893, out a3_4144, out s2_4145, out s3_4146, out s4_4147, out s5_4148, out s6_4149, out s7_4150, out s8_4151, out s9_4152, out fflags_1907, out frm_1908), a0_1892, a1_1893, g_t4200ED88, g_t4200ED8C, fflags_1907, frm_1908, out s0_4153, out s1_4154, out a0_1924, out a1_1925, out a3_4155, out s2_1944, out s3_1945, out s4_4156, out s5_1537, out s6_4157, out s7_4158, out s8_4159, out s9_1541, out fflags_1529, out frm_1530);
									Eq_2 a1_1959;
									Eq_2 a0_1958 = __subdf3(ra_1531, a0_1728, a1_1729, a0_1924, a1_1925, fflags_1529, frm_1530, out a1_1959);
									Eq_2 a1_1975;
									__adddf3(ra_1531, s2_1944, s3_1945, a0_1958, a1_1959, fflags_1529, frm_1530, out a1_1975);
									Eq_2 a1_1990;
									word32 a1_4160;
									__subdf3(ra_1531, a0_1958, a1_1959, __subdf3(ra_1531, 0, a1_1975, s2_1944, s3_1945, fflags_1529, frm_1530, out a1_1990), a1_1990, fflags_1529, frm_1530, out a1_4160);
									s1_1615 = a1_1975;
l2309E414:
									Eq_2 dwLoc78_3341;
									Eq_2 dwLoc74_3342;
									if (((word32) s10_290 - 1 | t3_348) == 0x00)
									{
										dwLoc78_3341 = g_t4200ED58;
										dwLoc74_3342 = g_t4200ED5C;
									}
									else
									{
										dwLoc78_3341 = s5_1537->t0000;
										dwLoc74_3342 = s5_1537->t0004;
									}
									int32 s11_2204;
									int32 a5_2206;
									struct Eq_564238 * s0_2237;
									Eq_2 a1_2056;
									ptr32 fflags_2086;
									ptr32 frm_2087;
									Eq_2 s2_2091;
									Eq_2 s3_2092;
									Eq_2 s9_2098;
									Eq_2 a0_2105;
									Eq_2 a1_2106;
									ptr32 fflags_2120;
									ptr32 frm_2121;
									Eq_2 s0_2123;
									Eq_2 s1_2124;
									Eq_2 s6_2129;
									Eq_2 s7_2130;
									Eq_2 s8_2131;
									word32 s3_4187;
									word32 s1_4176;
									word32 a0_4177;
									word32 a1_4178;
									word32 s0_4175;
									word32 s7_4183;
									word32 s8_4184;
									word32 a3_4185;
									word32 a3_4179;
									word32 s4_4180;
									word32 s6_4182;
									word32 s5_4181;
									word32 s2_4186;
									word32 s4_4188;
									word32 s9_4190;
									word32 s5_4189;
									Eq_2 ra_2122 = __muldf3(__muldf3(ra_1531, __subdf3(ra_1531, s9_1541, a3, 0, a3, fflags_1529, frm_1530, out a1_2056), a1_2056, 0, s1_1615, fflags_1529, frm_1530, out s0_4175, out s1_4176, out a0_4177, out a1_4178, out a3_4179, out s2_2091, out s3_2092, out s4_4180, out s5_4181, out s6_4182, out s7_4183, out s8_4184, out s9_2098, out fflags_2086, out frm_2087), s2_2091, s3_2092, s9_2098, a3, fflags_2086, frm_2087, out s0_2123, out s1_2124, out a0_2105, out a1_2106, out a3_4185, out s2_4186, out s3_4187, out s4_4188, out s5_4189, out s6_2129, out s7_2130, out s8_2131, out s9_4190, out fflags_2120, out frm_2121);
									word32 a1_4191;
									__adddf3(ra_2122, s6_2129, s7_2130, a0_2105, a1_2106, fflags_2120, frm_2121, out a1_4191);
									Eq_2 a0_2152;
									Eq_2 a1_2153;
									ptr32 fflags_2167;
									ptr32 frm_2168;
									Eq_2 s2_2172;
									Eq_2 s3_2173;
									word32 s0_4192;
									word32 s4_4195;
									word32 a3_4194;
									word32 s1_4193;
									word32 s7_4198;
									word32 s5_4196;
									word32 s6_4197;
									word32 s8_4199;
									word32 s9_4200;
									Eq_2 ra_2169 = __muldf3(ra_2122, s0_2123, s1_2124, s8_2131, a3, fflags_2120, frm_2121, out s0_4192, out s1_4193, out a0_2152, out a1_2153, out a3_4194, out s2_2172, out s3_2173, out s4_4195, out s5_4196, out s6_4197, out s7_4198, out s8_4199, out s9_4200, out fflags_2167, out frm_2168);
									Eq_2 a1_2187;
									Eq_2 a0_2186 = __adddf3(ra_2169, s2_2172, s3_2173, a0_2152, a1_2153, fflags_2167, frm_2168, out a1_2187);
									Eq_2 s6_2197 = a1_2187;
									if (a1_2187 >= 0x40900000)
									{
										if ((a1_2187 - 0x40900000 | a0_2186) == 0x00)
										{
											Eq_2 a1_2248;
											Eq_2 a1_2263;
											word32 a5_4174;
											word32 a4_4173;
											word32 a1_4172;
											if (__gedf2(__adddf3(ra_2169, s2_2172, s3_2173, g_t4200EDE8, g_t4200EDEC, fflags_2167, frm_2168, out a1_2248), a1_2248, __subdf3(ra_2169, a0_2186, a1_2187, a0_2152, a1_2153, fflags_2167, frm_2168, out a1_2263), a1_2263, fflags_2167, frm_2168, out a1_4172, out a4_4173, out a5_4174) <= 0x00)
												goto l2309E534;
										}
										s0_2237 = (struct Eq_564238 *) &g_t4200ED28;
									}
									else
									{
										int32 a5_2201 = (word32) (word31) a1_2187;
										if (a5_2201 <= 1083231231)
										{
											s11_2204 = 0;
											if (a5_2201 <= 0x3FE00000)
												goto l2309E5BC;
											a5_2206 = a5_2201 >> 0x14;
l2309E53C:
											int32 a5_2376 = (word32) a1_2187 + (0x00100000 >> a5_2206 + -1022);
											ui32 a4_2378 = a5_2376 >> 0x14 & 0x07FF;
											Eq_2 a1_2383 = ~(0x000FFFFF >> a4_2378 + -0x03FF) & a5_2376;
											int32 s4_2390 = (a5_2376 & 0x000FFFFF | 0x00100000) >> 20 - (a4_2378 + -0x03FF);
											if (a1_2187 < 0x00)
												s4_2390 = 0x00 - s4_2390;
											Eq_2 a1_2412;
											Eq_2 a1_2434;
											__adddf3(ra_2169, s2_2172, s3_2173, __subdf3(ra_2169, a0_2152, a1_2153, 0, a1_2383, fflags_2167, frm_2168, out a1_2412), a1_2412, fflags_2167, frm_2168, out a1_2434);
											s6_2197 = a1_2434;
											s11_2204 = s4_2390 << 0x14;
l2309E5BC:
											Eq_2 a1_3073;
											ptr32 fflags_2475;
											ptr32 frm_2476;
											Eq_2 s0_2478;
											Eq_2 s1_2479;
											Eq_2 s2_2480;
											Eq_2 s3_2481;
											Eq_2 s6_2484;
											Eq_2 s8_2486;
											word32 a0_4415;
											word32 a1_4416;
											word32 a3_4417;
											word32 s4_4418;
											word32 s5_4419;
											word32 s7_4420;
											word32 s9_4421;
											Eq_2 ra_2477 = __muldf3(ra_2169, 0, s6_2197, g_t4200EDF8, g_t4200EDFC, fflags_2167, frm_2168, out s0_2478, out s1_2479, out a0_4415, out a1_4416, out a3_4417, out s2_2480, out s3_2481, out s4_4418, out s5_4419, out s6_2484, out s7_4420, out s8_2486, out s9_4421, out fflags_2475, out frm_2476);
											Eq_2 a1_2496;
											Eq_2 a1_2510;
											ptr32 fflags_2538;
											ptr32 frm_2539;
											Eq_2 s8_2549;
											Eq_2 a0_2559;
											Eq_2 a1_2560;
											ptr32 fflags_2574;
											ptr32 frm_2575;
											Eq_2 s0_2577;
											Eq_2 s1_2578;
											Eq_2 s6_2583;
											Eq_2 s7_2584;
											word32 s0_4422;
											word32 s1_4423;
											word32 a0_4424;
											word32 a1_4425;
											word32 a3_4426;
											word32 s2_4427;
											word32 s3_4428;
											word32 s4_4429;
											word32 s5_4430;
											word32 s6_4431;
											word32 s7_4432;
											word32 s9_4433;
											word32 a3_4434;
											word32 s2_4435;
											word32 s3_4436;
											word32 s4_4437;
											word32 s5_4438;
											word32 s8_4439;
											word32 s9_4440;
											Eq_2 ra_2576 = __muldf3(__muldf3(ra_2477, __subdf3(ra_2477, s2_2480, s3_2481, __subdf3(ra_2477, s8_2486, s6_2484, s0_2478, s1_2479, fflags_2475, frm_2476, out a1_2496), a1_2496, fflags_2475, frm_2476, out a1_2510), a1_2510, g_t4200EE00, g_t4200EE04, fflags_2475, frm_2476, out s0_4422, out s1_4423, out a0_4424, out a1_4425, out a3_4426, out s2_4427, out s3_4428, out s4_4429, out s5_4430, out s6_4431, out s7_4432, out s8_2549, out s9_4433, out fflags_2538, out frm_2539), s8_2549, s6_2484, g_t4200EE08, g_t4200EE0C, fflags_2538, frm_2539, out s0_2577, out s1_2578, out a0_2559, out a1_2560, out a3_4434, out s2_4435, out s3_4436, out s4_4437, out s5_4438, out s6_2583, out s7_2584, out s8_4439, out s9_4440, out fflags_2574, out frm_2575);
											Eq_2 a1_2592;
											Eq_2 a0_2591 = __adddf3(ra_2576, s0_2577, s1_2578, a0_2559, a1_2560, fflags_2574, frm_2575, out a1_2592);
											Eq_2 a1_2607;
											Eq_2 a0_2606 = __adddf3(ra_2576, s6_2583, s7_2584, a0_2591, a1_2592, fflags_2574, frm_2575, out a1_2607);
											Eq_2 a1_2620;
											word32 a1_4441;
											__subdf3(ra_2576, a0_2591, a1_2592, __subdf3(ra_2576, a0_2606, a1_2607, s6_2583, s7_2584, fflags_2574, frm_2575, out a1_2620), a1_2620, fflags_2574, frm_2575, out a1_4441);
											Eq_2 a0_2649;
											Eq_2 a1_2650;
											ptr32 fflags_2664;
											ptr32 frm_2665;
											Eq_2 a0_2683;
											Eq_2 a1_2684;
											ptr32 fflags_2698;
											ptr32 frm_2699;
											Eq_2 s2_2703;
											Eq_2 s3_2704;
											word32 s0_4442;
											word32 s1_4443;
											word32 a3_4444;
											word32 s2_4445;
											word32 s3_4446;
											word32 s4_4447;
											word32 s5_4448;
											word32 s6_4449;
											word32 s7_4450;
											word32 s8_4451;
											word32 s9_4452;
											word32 s0_4453;
											word32 s1_4454;
											word32 a3_4455;
											word32 s4_4456;
											word32 s5_4457;
											word32 s6_4458;
											word32 s7_4459;
											word32 s8_4460;
											word32 s9_4461;
											Eq_2 ra_2700 = __muldf3(__muldf3(ra_2576, a0_2606, a1_2607, a0_2606, a1_2607, fflags_2574, frm_2575, out s0_4442, out s1_4443, out a0_2649, out a1_2650, out a3_4444, out s2_4445, out s3_4446, out s4_4447, out s5_4448, out s6_4449, out s7_4450, out s8_4451, out s9_4452, out fflags_2664, out frm_2665), a0_2649, a1_2650, g_t4200EE10, g_t4200EE14, fflags_2664, frm_2665, out s0_4453, out s1_4454, out a0_2683, out a1_2684, out a3_4455, out s2_2703, out s3_2704, out s4_4456, out s5_4457, out s6_4458, out s7_4459, out s8_4460, out s9_4461, out fflags_2698, out frm_2699);
											Eq_2 a1_2716;
											Eq_2 a0_2727;
											Eq_2 a1_2728;
											ptr32 fflags_2742;
											ptr32 frm_2743;
											Eq_2 s2_2747;
											Eq_2 s3_2748;
											word32 s0_4462;
											word32 s1_4463;
											word32 a3_4464;
											word32 s4_4465;
											word32 s5_4466;
											word32 s6_4467;
											word32 s7_4468;
											word32 s8_4469;
											word32 s9_4470;
											Eq_2 ra_2744 = __muldf3(ra_2700, __subdf3(ra_2700, a0_2683, a1_2684, g_t4200EE18, g_t4200EE1C, fflags_2698, frm_2699, out a1_2716), a1_2716, s2_2703, s3_2704, fflags_2698, frm_2699, out s0_4462, out s1_4463, out a0_2727, out a1_2728, out a3_4464, out s2_2747, out s3_2748, out s4_4465, out s5_4466, out s6_4467, out s7_4468, out s8_4469, out s9_4470, out fflags_2742, out frm_2743);
											Eq_2 a1_2760;
											Eq_2 a0_2770;
											Eq_2 a1_2771;
											ptr32 fflags_2785;
											ptr32 frm_2786;
											Eq_2 s2_2790;
											Eq_2 s3_2791;
											word32 s0_4471;
											word32 s1_4472;
											word32 a3_4473;
											word32 s4_4474;
											word32 s5_4475;
											word32 s6_4476;
											word32 s7_4477;
											word32 s8_4478;
											word32 s9_4479;
											Eq_2 ra_2787 = __muldf3(ra_2744, __adddf3(ra_2744, a0_2727, a1_2728, g_t4200EE20, g_t4200EE24, fflags_2742, frm_2743, out a1_2760), a1_2760, s2_2747, s3_2748, fflags_2742, frm_2743, out s0_4471, out s1_4472, out a0_2770, out a1_2771, out a3_4473, out s2_2790, out s3_2791, out s4_4474, out s5_4475, out s6_4476, out s7_4477, out s8_4478, out s9_4479, out fflags_2785, out frm_2786);
											Eq_2 a1_2803;
											Eq_2 a0_2814;
											Eq_2 a1_2815;
											ptr32 fflags_2829;
											ptr32 frm_2830;
											Eq_2 s2_2834;
											Eq_2 s3_2835;
											word32 s0_4480;
											word32 s1_4481;
											word32 a3_4482;
											word32 s4_4483;
											word32 s5_4484;
											word32 s6_4485;
											word32 s7_4486;
											word32 s8_4487;
											word32 s9_4488;
											Eq_2 ra_2831 = __muldf3(ra_2787, __subdf3(ra_2787, a0_2770, a1_2771, g_t4200EE28, g_t4200EE2C, fflags_2785, frm_2786, out a1_2803), a1_2803, s2_2790, s3_2791, fflags_2785, frm_2786, out s0_4480, out s1_4481, out a0_2814, out a1_2815, out a3_4482, out s2_2834, out s3_2835, out s4_4483, out s5_4484, out s6_4485, out s7_4486, out s8_4487, out s9_4488, out fflags_2829, out frm_2830);
											Eq_2 a1_2847;
											Eq_2 a0_2857;
											Eq_2 a1_2858;
											ptr32 fflags_2872;
											ptr32 frm_2873;
											Eq_2 s0_2875;
											Eq_2 s1_2876;
											word32 a3_4489;
											word32 s2_4490;
											word32 s3_4491;
											word32 s4_4492;
											word32 s5_4493;
											word32 s6_4494;
											word32 s7_4495;
											word32 s8_4496;
											word32 s9_4497;
											Eq_2 ra_2874 = __muldf3(ra_2831, __adddf3(ra_2831, a0_2814, a1_2815, g_t4200EE30, g_t4200EE34, fflags_2829, frm_2830, out a1_2847), a1_2847, s2_2834, s3_2835, fflags_2829, frm_2830, out s0_2875, out s1_2876, out a0_2857, out a1_2858, out a3_4489, out s2_4490, out s3_4491, out s4_4492, out s5_4493, out s6_4494, out s7_4495, out s8_4496, out s9_4497, out fflags_2872, out frm_2873);
											Eq_2 a1_2890;
											Eq_2 a0_2905;
											Eq_2 a1_2906;
											ptr32 fflags_2920;
											ptr32 frm_2921;
											Eq_2 s8_2931;
											Eq_2 s9_2932;
											word32 s0_4498;
											word32 s1_4499;
											word32 a3_4500;
											word32 s2_4501;
											word32 s3_4502;
											word32 s4_4503;
											word32 s5_4504;
											word32 s6_4505;
											word32 s7_4506;
											Eq_2 ra_2922 = __muldf3(ra_2874, s0_2875, s1_2876, __subdf3(ra_2874, s0_2875, s1_2876, a0_2857, a1_2858, fflags_2872, frm_2873, out a1_2890), a1_2890, fflags_2872, frm_2873, out s0_4498, out s1_4499, out a0_2905, out a1_2906, out a3_4500, out s2_4501, out s3_4502, out s4_4503, out s5_4504, out s6_4505, out s7_4506, out s8_2931, out s9_2932, out fflags_2920, out frm_2921);
											Eq_2 a1_2942;
											ptr32 fflags_2970;
											ptr32 frm_2971;
											Eq_2 s0_2973;
											Eq_2 s1_2974;
											Eq_2 s6_2979;
											Eq_2 s7_2980;
											Eq_2 a0_2989;
											Eq_2 a1_2990;
