pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
											Eq_2 s0_3007;
											Eq_2 s1_3008;
											Eq_2 s2_3009;
											Eq_2 s3_3010;
											int32 s4_3011;
											struct Eq_565859 * s5_3012;
											Eq_2 s6_3013;
											Eq_2 s7_3014;
											word32 a0_4507;
											word32 a1_4508;
											word32 a3_4509;
											word32 s2_4510;
											word32 s3_4511;
											word32 s5_4512;
											word32 s9_4513;
											word32 a3_4514;
											word32 s8_4515;
											word32 s9_4516;
											ptr32 frm_3005;
											ptr32 fflags_3004;
											Eq_2 ra_3006 = __muldf3(__divdf3(ra_2922, a0_2905, a1_2906, __subdf3(ra_2922, s8_2931, s9_2932, g_t4200EE38, g_t4200EE3C, fflags_2920, frm_2921, out a1_2942), a1_2942, fflags_2920, frm_2921, out s0_2973, out s1_2974, out a0_4507, out a1_4508, out a3_4509, out s2_4510, out s3_4511, out s5_4512, out s6_2979, out s7_2980, out s9_4513, out fflags_2970, out frm_2971), s0_2973, s1_2974, s6_2979, s7_2980, fflags_2970, frm_2971, out s0_3007, out s1_3008, out a0_2989, out a1_2990, out a3_4514, out s2_3009, out s3_3010, out s4_3011, out s5_3012, out s6_3013, out s7_3014, out s8_4515, out s9_4516, out fflags_3004, out frm_3005);
											Eq_2 a1_3020;
											Eq_2 a1_3033;
											Eq_2 a1_3045;
											Eq_2 a1_3059;
											Eq_2 a0_3058 = __subdf3(ra_3006, s5_3012->t0000, s5_3012->t0004, __subdf3(ra_3006, __subdf3(ra_3006, s2_3009, s3_3010, __adddf3(ra_3006, a0_2989, a1_2990, s6_3013, s7_3014, fflags_3004, frm_3005, out a1_3020), a1_3020, fflags_3004, frm_3005, out a1_3033), a1_3033, s0_3007, s1_3008, fflags_3004, frm_3005, out a1_3045), a1_3045, fflags_3004, frm_3005, out a1_3059);
											Eq_2 a5_3069 = (word32) a1_3059 + s11_2204;
											if (a5_3069 >> 0x14 > 0x00)
												a1_3073 = a5_3069;
											else
												a0_3058 = scalbn(ra_3006, a0_3058, a1_3059, s4_3011, fflags_3004, frm_3005, out a1_3073, out fflags_3004, out frm_3005);
											word32 s0_4380;
											word32 s1_4381;
											word32 a3_4382;
											word32 s2_4383;
											word32 s3_4384;
											word32 s4_4385;
											word32 s5_4386;
											word32 s6_4387;
											word32 s7_4388;
											word32 s8_4389;
											word32 s9_4390;
											__muldf3(ra_3006, a0_3058, a1_3073, dwLoc78_3341, dwLoc74_3342, fflags_3004, frm_3005, out s0_4380, out s1_4381, out a0_102, out a1_100, out a3_4382, out s2_4383, out s3_4384, out s4_4385, out s5_4386, out s6_4387, out s7_4388, out s8_4389, out s9_4390, out fflags, out frm);
											goto l2309DBF0;
										}
										if (((word32) a1_2187 + 0x3F6F3400 | a0_2186) == 0x00)
										{
											Eq_2 a1_2214;
											word32 a1_4412;
											word32 a4_4413;
											word32 a5_4414;
											if (__gedf2(__subdf3(ra_2169, a0_2186, a1_2187, a0_2152, a1_2153, fflags_2167, frm_2168, out a1_2214), a1_2214, s2_2172, s3_2173, fflags_2167, frm_2168, out a1_4412, out a4_4413, out a5_4414) < 0x00)
											{
l2309E534:
												a5_2206 = a1_2187 >> 0x14 & 0x07FF;
												goto l2309E53C;
											}
										}
										s0_2237 = (struct Eq_564238 *) &g_t4200EDF0;
									}
									Eq_2 a0_2310;
									Eq_2 a1_2311;
									ptr32 fflags_2325;
									ptr32 frm_2326;
									struct Eq_565348 * s0_2328;
									word32 s1_4391;
									word32 a3_4392;
									word32 s2_4393;
									word32 s3_4394;
									word32 s4_4395;
									word32 s5_4396;
									word32 s6_4397;
									word32 s7_4398;
									word32 s8_4399;
									word32 s9_4400;
									word32 s0_4401;
									word32 s1_4402;
									word32 a3_4403;
									word32 s2_4404;
									word32 s3_4405;
									word32 s4_4406;
									word32 s5_4407;
									word32 s6_4408;
									word32 s7_4409;
									word32 s8_4410;
									word32 s9_4411;
									__muldf3(__muldf3(ra_2169, dwLoc78_3341, dwLoc74_3342, s0_2237->t0000, s0_2237->t0004, fflags_2167, frm_2168, out s0_2328, out s1_4391, out a0_2310, out a1_2311, out a3_4392, out s2_4393, out s3_4394, out s4_4395, out s5_4396, out s6_4397, out s7_4398, out s8_4399, out s9_4400, out fflags_2325, out frm_2326), a0_2310, a1_2311, s0_2328->t0000, s0_2328->t0004, fflags_2325, frm_2326, out s0_4401, out s1_4402, out a0_102, out a1_100, out a3_4403, out s2_4404, out s3_4405, out s4_4406, out s5_4407, out s6_4408, out s7_4409, out s8_4410, out s9_4411, out fflags, out frm);
									goto l2309DBF0;
								}
								int32 a2_411 = 0;
								if ((a1 & 0x7FF00000) == 0x00)
								{
									int32 a1_429;
									word32 s0_4161;
									word32 s7_4169;
									word32 s8_4170;
									word32 s1_4162;
									word32 s2_4164;
									word32 s3_4165;
									word32 a3_4163;
									word32 s4_4166;
									word32 s6_4168;
									word32 s5_4167;
									word32 s9_4171;
									ra = __muldf3(ra, a0, a1_100, g_t4200ED90, g_t4200ED94, fflags, frm, out s0_4161, out s1_4162, out a0_426, out a1_429, out a3_4163, out s2_4164, out s3_4165, out s4_4166, out s5_4167, out s6_4168, out s7_4169, out s8_4170, out s9_4171, out fflags, out frm);
									s0_270 = a1_429;
									a2_411 = -53;
								}
								Eq_2 dwLoc78_3308;
								Eq_2 dwLoc74_3309;
								Eq_2 dwLoc70_3304;
								Eq_2 dwLoc44_3307;
								Eq_2 dwLoc48_3306;
								Eq_2 dwLoc6C_3305;
								int32 a6_466 = s0_270 & 0x000FFFFF;
								Eq_8806 t4_470 = (s0_270 >> 0x14) + -0x03FF + a2_411;
								Eq_2 s8_471 = a6_466 | 0x3FF00000;
								if (a6_466 > 235662)
								{
									if (a6_466 <= 767609)
									{
										dwLoc70_3304 = g_t4200ED40;
										dwLoc6C_3305 = g_t4200ED44;
										dwLoc48_3306 = g_t4200ED48;
										dwLoc44_3307 = g_t4200ED4C;
										dwLoc78_3308 = g_t4200ED50;
										dwLoc74_3309 = g_t4200ED54;
										goto l2309DF68;
									}
									t4_470 = (word32) t4_470.u0 + 1;
									s8_471 = (a6_466 | 0x3FF00000) - 0x00100000;
								}
								dwLoc70_3304.u0 = 0x00;
								dwLoc6C_3305.u0 = 0x00;
								dwLoc48_3306.u0 = 0x00;
								dwLoc44_3307.u0 = 0x00;
								dwLoc78_3308 = g_t4200ED20;
								dwLoc74_3309 = g_t4200ED24;
l2309DF68:
								word32 a1_4201;
								__subdf3(ra, a0_426, s8_471, dwLoc78_3308, dwLoc74_3309, fflags, frm, out a1_4201);
								word32 s2_4205;
								word32 s3_4206;
								word32 s5_4207;
								word32 s9_4208;
								word32 s4_4213;
								word32 a0_4210;
								word32 s5_4214;
								word32 a3_4211;
								word32 s2_4212;
								word32 s0_4209;
								word32 s6_4215;
								word32 s9_4217;
								word32 s4_4219;
								word32 a3_4218;
								word32 s9_4221;
								word32 s5_4220;
								word32 s7_4216;
								Eq_2 a1_563;
								Eq_2 a0_577;
								Eq_2 a1_578;
								ptr32 fflags_592;
								ptr32 frm_593;
								Eq_2 s6_601;
								Eq_2 s7_602;
								Eq_2 a1_612;
								ptr32 fflags_626;
								ptr32 frm_627;
								Eq_2 s1_630;
								word32 s3_632;
								int32 s8_637;
								Eq_2 a0_650;
								Eq_2 a1_651;
								ptr32 fflags_665;
								ptr32 frm_666;
								Eq_2 s0_668;
								Eq_2 s1_669;
								Eq_2 s2_670;
								Eq_2 s3_671;
								Eq_2 s6_674;
								Eq_2 s7_675;
								Eq_2 s8_676;
								word32 a3_4204;
								word32 s1_4203;
								word32 s0_4202;
								Eq_2 ra_667 = __muldf3(__muldf3(__divdf3(ra, g_t4200ED20, g_t4200ED24, __adddf3(ra, a0_426, s8_471, dwLoc78_3308, dwLoc74_3309, fflags, frm, out a1_563), a1_563, fflags, frm, out s0_4202, out s1_4203, out a0_577, out a1_578, out a3_4204, out s2_4205, out s3_4206, out s5_4207, out s6_601, out s7_602, out s9_4208, out fflags_592, out frm_593), s6_601, s7_602, a0_577, a1_578, fflags_592, frm_593, out s0_4209, out s1_630, out a0_4210, out a1_612, out a3_4211, out s2_4212, out s3_632, out s4_4213, out s5_4214, out s6_4215, out s7_4216, out s8_637, out s9_4217, out fflags_626, out frm_627), s1_630, a1_612, 0, (s8_637 >> 0x01 | 0x20000000) + 0x00080000 + s3_632, fflags_626, frm_627, out s0_668, out s1_669, out a0_650, out a1_651, out a3_4218, out s2_670, out s3_671, out s4_4219, out s5_4220, out s6_674, out s7_675, out s8_676, out s9_4221, out fflags_665, out frm_666);
								word32 a1_4222;
								__subdf3(ra_667, s6_674, s7_675, a0_650, a1_651, fflags_665, frm_666, out a1_4222);
								word32 s4_4228;
								word32 s5_4229;
								word32 s2_4226;
								word32 s3_4227;
								word32 s1_4224;
								word32 a3_4225;
								word32 s0_4223;
								word32 s8_4230;
								word32 s9_4231;
								Eq_2 a1_699;
								Eq_2 a1_713;
								Eq_2 a0_724;
								Eq_2 a1_725;
								ptr32 fflags_739;
								ptr32 frm_740;
								Eq_2 s6_748;
								Eq_2 s7_749;
								Eq_2 ra_741 = __muldf3(ra_667, __subdf3(ra_667, s2_670, s8_676, __subdf3(ra_667, 0, s3_671, dwLoc78_3308, dwLoc74_3309, fflags_665, frm_666, out a1_699), a1_699, fflags_665, frm_666, out a1_713), a1_713, s1_669, s0_668, fflags_665, frm_666, out s0_4223, out s1_4224, out a0_724, out a1_725, out a3_4225, out s2_4226, out s3_4227, out s4_4228, out s5_4229, out s6_748, out s7_749, out s8_4230, out s9_4231, out fflags_739, out frm_740);
								word32 s7_4238;
								word32 s1_4232;
								word32 a3_4233;
								word32 s3_4235;
								word32 s9_4240;
								word32 s5_4236;
								word32 s6_4237;
								word32 s8_4239;
								word32 s2_4234;
								word32 s1_4253;
								word32 s2_4244;
								word32 a3_4243;
								word32 s1_4242;
								word32 s7_4249;
								word32 s9_4251;
								word32 s0_4252;
								word32 a3_4254;
								word32 s8_4250;
								word32 s4_4246;
								word32 s6_4248;
								word32 s5_4247;
								word32 s3_4245;
								word32 s4_4255;
								word32 s9_4260;
								word32 s5_4256;
								word32 s6_4257;
								word32 s7_4258;
								word32 s8_4259;
								word32 s0_4241;
								Eq_2 a1_757;
								Eq_2 a0_772;
								Eq_2 a1_773;
								ptr32 fflags_787;
								ptr32 frm_788;
								Eq_2 s0_790;
								Eq_2 s4_794;
								Eq_2 a0_806;
								Eq_2 a1_807;
								ptr32 fflags_821;
								ptr32 frm_822;
								Eq_2 a0_840;
								Eq_2 a1_841;
								ptr32 fflags_855;
								ptr32 frm_856;
								Eq_2 s2_860;
								Eq_2 s3_861;
								Eq_2 ra_857 = __muldf3(__muldf3(__muldf3(ra_741, __subdf3(ra_741, s6_748, s7_749, a0_724, a1_725, fflags_739, frm_740, out a1_757), a1_757, a0_577, a1_578, fflags_739, frm_740, out s0_790, out s1_4232, out a0_772, out a1_773, out a3_4233, out s2_4234, out s3_4235, out s4_794, out s5_4236, out s6_4237, out s7_4238, out s8_4239, out s9_4240, out fflags_787, out frm_788), s4_794, s0_790, s4_794, s0_790, fflags_787, frm_788, out s0_4241, out s1_4242, out a0_806, out a1_807, out a3_4243, out s2_4244, out s3_4245, out s4_4246, out s5_4247, out s6_4248, out s7_4249, out s8_4250, out s9_4251, out fflags_821, out frm_822), a0_806, a1_807, g_t4200ED98, g_t4200ED9C, fflags_821, frm_822, out s0_4252, out s1_4253, out a0_840, out a1_841, out a3_4254, out s2_860, out s3_861, out s4_4255, out s5_4256, out s6_4257, out s7_4258, out s8_4259, out s9_4260, out fflags_855, out frm_856);
								word32 s0_4261;
								word32 s1_4262;
								word32 s4_4264;
								word32 a3_4263;
								word32 s7_4267;
								word32 s5_4265;
								word32 s6_4266;
								word32 s9_4269;
								word32 s8_4268;
								Eq_2 a1_875;
								Eq_2 a0_885;
								Eq_2 a1_886;
								ptr32 fflags_900;
								ptr32 frm_901;
								Eq_2 s2_905;
								Eq_2 s3_906;
								Eq_2 ra_902 = __muldf3(ra_857, __adddf3(ra_857, a0_840, a1_841, g_t4200EDA0, g_t4200EDA4, fflags_855, frm_856, out a1_875), a1_875, s2_860, s3_861, fflags_855, frm_856, out s0_4261, out s1_4262, out a0_885, out a1_886, out a3_4263, out s2_905, out s3_906, out s4_4264, out s5_4265, out s6_4266, out s7_4267, out s8_4268, out s9_4269, out fflags_900, out frm_901);
								word32 s0_4270;
								word32 s1_4271;
								word32 s6_4275;
								word32 a3_4272;
								word32 s4_4273;
								word32 s7_4276;
								word32 s8_4277;
								word32 s5_4274;
								word32 s9_4278;
								Eq_2 a1_918;
								Eq_2 a0_928;
								Eq_2 a1_929;
								ptr32 fflags_943;
								ptr32 frm_944;
								Eq_2 s2_948;
								Eq_2 s3_949;
								Eq_2 ra_945 = __muldf3(ra_902, __adddf3(ra_902, a0_885, a1_886, g_t4200EDA8, g_t4200EDAC, fflags_900, frm_901, out a1_918), a1_918, s2_905, s3_906, fflags_900, frm_901, out s0_4270, out s1_4271, out a0_928, out a1_929, out a3_4272, out s2_948, out s3_949, out s4_4273, out s5_4274, out s6_4275, out s7_4276, out s8_4277, out s9_4278, out fflags_943, out frm_944);
								word32 a3_4281;
								word32 s0_4279;
								word32 s4_4282;
								word32 s5_4283;
								word32 s1_4280;
								word32 s7_4285;
								word32 s9_4287;
								word32 s6_4284;
								word32 s8_4286;
								Eq_2 a1_961;
								Eq_2 a0_971;
								Eq_2 a1_972;
								ptr32 fflags_986;
								ptr32 frm_987;
								Eq_2 s2_991;
								Eq_2 s3_992;
								Eq_2 ra_988 = __muldf3(ra_945, __adddf3(ra_945, a0_928, a1_929, g_t4200EDB0, g_t4200EDB4, fflags_943, frm_944, out a1_961), a1_961, s2_948, s3_949, fflags_943, frm_944, out s0_4279, out s1_4280, out a0_971, out a1_972, out a3_4281, out s2_991, out s3_992, out s4_4282, out s5_4283, out s6_4284, out s7_4285, out s8_4286, out s9_4287, out fflags_986, out frm_987);
								word32 s4_4291;
								word32 s0_4288;
								word32 s1_4289;
								word32 a3_4290;
								word32 s9_4296;
								word32 s6_4293;
								word32 s7_4294;
								word32 s8_4295;
								word32 s5_4292;
								Eq_2 a1_1004;
								Eq_2 a0_1014;
								Eq_2 a1_1015;
								ptr32 fflags_1029;
								ptr32 frm_1030;
								Eq_2 s2_1034;
								Eq_2 s3_1035;
								Eq_2 ra_1031 = __muldf3(ra_988, __adddf3(ra_988, a0_971, a1_972, g_t4200EDB8, g_t4200EDBC, fflags_986, frm_987, out a1_1004), a1_1004, s2_991, s3_992, fflags_986, frm_987, out s0_4288, out s1_4289, out a0_1014, out a1_1015, out a3_4290, out s2_1034, out s3_1035, out s4_4291, out s5_4292, out s6_4293, out s7_4294, out s8_4295, out s9_4296, out fflags_1029, out frm_1030);
								word32 s1_4298;
								word32 a3_4299;
								word32 s3_4301;
								word32 s2_4300;
								word32 s0_4297;
								word32 a3_4310;
								word32 a0_4308;
								word32 s7_4305;
								word32 s8_4306;
								word32 s5_4303;
								word32 s4_4302;
								word32 s6_4304;
								word32 s2_4311;
								word32 a1_4309;
								word32 s9_4307;
								word32 s5_4313;
								word32 s8_4316;
								word32 s7_4315;
								word32 s3_4312;
								word32 s6_4314;
								word32 s9_4317;
								Eq_2 a1_1047;
								Eq_2 a0_1061;
								Eq_2 a1_1062;
								ptr32 fflags_1076;
								ptr32 frm_1077;
								ptr32 fflags_1110;
								ptr32 frm_1111;
								Eq_2 s0_1113;
								Eq_2 s1_1114;
								Eq_2 s4_1117;
								Eq_2 ra_1112 = __muldf3(__muldf3(ra_1031, s2_1034, s3_1035, s2_1034, s3_1035, fflags_1029, frm_1030, out s0_4297, out s1_4298, out a0_1061, out a1_1062, out a3_4299, out s2_4300, out s3_4301, out s4_4302, out s5_4303, out s6_4304, out s7_4305, out s8_4306, out s9_4307, out fflags_1076, out frm_1077), __adddf3(ra_1031, a0_1014, a1_1015, g_t4200EDC0, g_t4200EDC4, fflags_1029, frm_1030, out a1_1047), a1_1047, a0_1061, a1_1062, fflags_1076, frm_1077, out s0_1113, out s1_1114, out a0_4308, out a1_4309, out a3_4310, out s2_4311, out s3_4312, out s4_1117, out s5_4313, out s6_4314, out s7_4315, out s8_4316, out s9_4317, out fflags_1110, out frm_1111);
								word32 s6_4321;
								word32 a3_4318;
								word32 s4_4319;
								word32 s5_4320;
								word32 s8_4323;
								Eq_2 a1_1130;
								Eq_2 a0_1140;
								Eq_2 a1_1141;
								ptr32 fflags_1155;
								ptr32 frm_1156;
								Eq_2 s0_1158;
								Eq_2 s1_1159;
								Eq_2 s2_1160;
								Eq_2 s3_1161;
								word32 s9_4324;
								word32 s7_4322;
								Eq_2 ra_1157 = __muldf3(ra_1112, __adddf3(ra_1112, s4_1117, s0_1113, s1_1114, s0_1113, fflags_1110, frm_1111, out a1_1130), a1_1130, a0_772, a1_773, fflags_1110, frm_1111, out s0_1158, out s1_1159, out a0_1140, out a1_1141, out a3_4318, out s2_1160, out s3_1161, out s4_4319, out s5_4320, out s6_4321, out s7_4322, out s8_4323, out s9_4324, out fflags_1155, out frm_1156);
								word32 a1_4325;
								__adddf3(ra_1157, a0_1140, a1_1141, s2_1160, s3_1161, fflags_1155, frm_1156, out a1_4325);
								word32 a3_4326;
								Eq_2 a0_1185;
								Eq_2 a1_1186;
								ptr32 fflags_1200;
								ptr32 frm_1201;
								Eq_2 s0_1203;
								Eq_2 s1_1204;
								Eq_2 s2_1205;
								Eq_2 s3_1206;
								Eq_2 s6_1209;
								struct Eq_564991 * s7_1210;
								word32 s5_4328;
								word32 s9_4330;
								word32 s8_4329;
								word32 s4_4327;
								Eq_2 ra_1202 = __muldf3(ra_1157, s1_1159, s0_1158, s1_1159, s0_1158, fflags_1155, frm_1156, out s0_1203, out s1_1204, out a0_1185, out a1_1186, out a3_4326, out s2_1205, out s3_1206, out s4_4327, out s5_4328, out s6_1209, out s7_1210, out s8_4329, out s9_4330, out fflags_1200, out frm_1201);
								Eq_2 a1_1218;
								Eq_2 a1_1231;
								__adddf3(ra_1202, __adddf3(ra_1202, a0_1185, a1_1186, s7_1210->t0000, s7_1210->t0004, fflags_1200, frm_1201, out a1_1218), a1_1218, s2_1205, s3_1206, fflags_1200, frm_1201, out a1_1231);
								Eq_2 a0_1244;
								Eq_2 a1_1245;
								ptr32 fflags_1259;
								ptr32 frm_1260;
								Eq_2 s0_1262;
								Eq_2 s2_1264;
								Eq_2 s4_1266;
								Eq_2 s6_1268;
								struct Eq_565036 * s7_1269;
								word32 s1_4331;
								word32 s5_4334;
								word32 s8_4335;
								word32 s9_4336;
								word32 s3_4333;
								word32 a3_4332;
								Eq_2 ra_1261 = __muldf3(ra_1202, s1_1204, s0_1203, s6_1209, a1_1231, fflags_1200, frm_1201, out s0_1262, out s1_4331, out a0_1244, out a1_1245, out a3_4332, out s2_1264, out s3_4333, out s4_1266, out s5_4334, out s6_1268, out s7_1269, out s8_4335, out s9_4336, out fflags_1259, out frm_1260);
								Eq_2 a1_1279;
								Eq_2 a1_1293;
								Eq_2 a1_1307;
								ptr32 fflags_1333;
								ptr32 frm_1334;
								Eq_2 s2_1338;
								Eq_2 s6_1342;
								Eq_2 a0_1352;
								Eq_2 a1_1353;
								ptr32 fflags_1367;
								ptr32 frm_1368;
								Eq_2 s0_1370;
								Eq_2 s1_1371;
								Eq_2 s8_1378;
								word32 s1_4338;
								word32 a3_4341;
								word32 a1_4340;
								word32 a0_4339;
								word32 s0_4337;
								word32 s7_4345;
								word32 s4_4343;
								word32 s8_4346;
								word32 s4_4351;
								word32 s3_4342;
								word32 s5_4344;
								word32 a3_4348;
								word32 s9_4347;
								word32 s3_4350;
								word32 s2_4349;
								word32 s9_4355;
								word32 s6_4353;
								word32 s7_4354;
								word32 s5_4352;
								Eq_2 ra_1369 = __muldf3(__muldf3(ra_1261, __subdf3(ra_1261, s2_1205, s3_1206, __subdf3(ra_1261, __subdf3(ra_1261, s6_1268, s2_1264, s7_1269->t0000, s7_1269->t0004, fflags_1259, frm_1260, out a1_1279), a1_1279, a0_1185, a1_1186, fflags_1259, frm_1260, out a1_1293), a1_1293, fflags_1259, frm_1260, out a1_1307), a1_1307, s4_1266, s0_1262, fflags_1259, frm_1260, out s0_4337, out s1_4338, out a0_4339, out a1_4340, out a3_4341, out s2_1338, out s3_4342, out s4_4343, out s5_4344, out s6_1342, out s7_4345, out s8_4346, out s9_4347, out fflags_1333, out frm_1334), a0_772, a1_773, s6_1342, s2_1338, fflags_1333, frm_1334, out s0_1370, out s1_1371, out a0_1352, out a1_1353, out a3_4348, out s2_4349, out s3_4350, out s4_4351, out s5_4352, out s6_4353, out s7_4354, out s8_1378, out s9_4355, out fflags_1367, out frm_1368);
								Eq_2 a1_1385;
								Eq_2 a1_1402;
								__adddf3(ra_1369, a0_1244, a1_1245, __adddf3(ra_1369, s0_1370, s1_1371, a0_1352, a1_1353, fflags_1367, frm_1368, out a1_1385), a1_1385, fflags_1367, frm_1368, out a1_1402);
								ptr32 fflags_1431;
								ptr32 frm_1432;
								Eq_2 s0_1434;
								Eq_2 s1_1435;
								Eq_2 s4_1438;
								Eq_2 s6_1440;
								Eq_2 s7_1441;
								Eq_2 s8_1442;
								word32 a0_4356;
								word32 s5_4361;
								word32 s3_4360;
								word32 s2_4359;
								word32 a1_4357;
								word32 a3_4358;
								word32 s9_4362;
								Eq_2 ra_1433 = __muldf3(ra_1369, s8_1378, a1_1402, g_t4200EDD0, g_t4200EDD4, fflags_1367, frm_1368, out s0_1434, out s1_1435, out a0_4356, out a1_4357, out a3_4358, out s2_4359, out s3_4360, out s4_1438, out s5_4361, out s6_1440, out s7_1441, out s8_1442, out s9_4362, out fflags_1431, out frm_1432);
								Eq_2 a1_1451;
								Eq_2 a1_1465;
								ptr32 fflags_1493;
								ptr32 frm_1494;
								Eq_2 s4_1500;
								Eq_2 s8_1504;
								Eq_2 a0_1514;
								Eq_2 a1_1515;
								Eq_2 s0_1532;
								Eq_2 s1_1533;
								Eq_2 s2_1534;
								Eq_2 s3_1535;
								word32 a1_4366;
								word32 s0_4363;
								word32 s1_4364;
								word32 a0_4365;
								word32 s2_4368;
								word32 s6_4371;
								word32 a3_4367;
								word32 s3_4369;
								word32 s7_4372;
								word32 s5_4370;
								word32 s9_4373;
								word32 a3_4374;
								word32 s4_4375;
								word32 s6_4376;
								word32 s7_4377;
								word32 s8_4378;
								ra_1531 = __muldf3(__muldf3(ra_1433, __subdf3(ra_1433, s0_1434, s1_1435, __subdf3(ra_1433, s8_1442, s4_1438, s6_1440, s7_1441, fflags_1431, frm_1432, out a1_1451), a1_1451, fflags_1431, frm_1432, out a1_1465), a1_1465, g_t4200EDD8, g_t4200EDDC, fflags_1431, frm_1432, out s0_4363, out s1_4364, out a0_4365, out a1_4366, out a3_4367, out s2_4368, out s3_4369, out s4_1500, out s5_4370, out s6_4371, out s7_4372, out s8_1504, out s9_4373, out fflags_1493, out frm_1494), s8_1504, s4_1500, g_t4200EDE0, g_t4200EDE4, fflags_1493, frm_1494, out s0_1532, out s1_1533, out a0_1514, out a1_1515, out a3_4374, out s2_1534, out s3_1535, out s4_4375, out s5_1537, out s6_4376, out s7_4377, out s8_4378, out s9_1541, out fflags_1529, out frm_1530);
								Eq_2 a1_1547;
								Eq_2 a1_1558;
								Eq_2 a0_1557 = __adddf3(ra_1531, __adddf3(ra_1531, s0_1532, s1_1533, a0_1514, a1_1515, fflags_1529, frm_1530, out a1_1547), a1_1547, dwLoc48_3306, dwLoc44_3307, fflags_1529, frm_1530, out a1_1558);
								Eq_2 a1_1571;
								Eq_2 a0_1570 = __floatsidf(t4_470, out a1_1571);
								Eq_2 a1_1581;
								Eq_2 a1_1592;
								Eq_2 a1_1603;
								__adddf3(ra_1531, __adddf3(ra_1531, __adddf3(ra_1531, s2_1534, s3_1535, a0_1557, a1_1558, fflags_1529, frm_1530, out a1_1581), a1_1581, dwLoc70_3304, dwLoc6C_3305, fflags_1529, frm_1530, out a1_1592), a1_1592, a0_1570, a1_1571, fflags_1529, frm_1530, out a1_1603);
								Eq_2 a1_1618;
								Eq_2 a1_1630;
								Eq_2 a1_1642;
								word32 a1_4379;
								__subdf3(ra_1531, a0_1557, a1_1558, __subdf3(ra_1531, __subdf3(ra_1531, __subdf3(ra_1531, 0, a1_1603, a0_1570, a1_1571, fflags_1529, frm_1530, out a1_1618), a1_1618, dwLoc70_3304, dwLoc6C_3305, fflags_1529, frm_1530, out a1_1630), a1_1630, s2_1534, s3_1535, fflags_1529, frm_1530, out a1_1642), a1_1642, fflags_1529, frm_1530, out a1_4379);
								s1_1615 = a1_1603;
								goto l2309E414;
							}
							goto l2309DEA4;
						}
						int32 a3_69 = 20 - (a3_63 + -0x03FF);
						int32 a2_70 = (a3 & 0x7FFFFFFF) >> a3_69;
						s10_290 = a2;
						if (a2_70 << a3_69 == (a3 & 0x7FFFFFFF))
							s10_290 = 2 - (a2_70 & 1);
						goto l2309DC60;
					}
					int32 a3_77 = 52 - (a3_63 + -0x03FF);
					uint32 a2_78 = a2 >> a3_77;
					if (a2_78 << a3_77 == a2)
						s10_290 = 2 - (a2_78 & 1);
				}
				if (a2 != 0x00)
					goto l2309DD5C;
				goto l2309DC60;
			}
			s10_290.u0 = 2;
		}
		if (a2 != 0x00)
			goto l2309DD5C;
		if ((a3 & 0x7FFFFFFF) != 0x7FF00000)
		{
