pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
l2309DC60:
			if ((a3 & 0x7FFFFFFF) == 0x3FF00000)
			{
				a0_102 = a0;
				a1_100 = a1;
				if (a3 < 0x00)
				{
					word32 s0_4517;
					word32 s1_4518;
					word32 a3_4519;
					word32 s2_4520;
					word32 s3_4521;
					word32 s5_4522;
					word32 s6_4523;
					word32 s7_4524;
					word32 s9_4525;
					__divdf3(ra, g_t4200ED20, g_t4200ED24, a0, a1, fflags, frm, out s0_4517, out s1_4518, out a0_102, out a1_100, out a3_4519, out s2_4520, out s3_4521, out s5_4522, out s6_4523, out s7_4524, out s9_4525, out fflags, out frm);
				}
				goto l2309DBF0;
			}
			if (a3 == 0x40000000)
			{
				word32 s3_4051;
				word32 a3_4049;
				word32 s2_4050;
				word32 s1_4048;
				word32 s5_4053;
				word32 s6_4054;
				word32 s0_4047;
				word32 s4_4052;
				word32 s9_4057;
				word32 s7_4055;
				word32 s8_4056;
				__muldf3(ra, a0, a1, a0, a1, fflags, frm, out s0_4047, out s1_4048, out a0_102, out a1_100, out a3_4049, out s2_4050, out s3_4051, out s4_4052, out s5_4053, out s6_4054, out s7_4055, out s8_4056, out s9_4057, out fflags, out frm);
				goto l2309DBF0;
			}
			if (a3 == 0x3FE00000 && a1 >= 0x00)
			{
				ptr32 fflags_3213;
				ptr32 frm_3214;
				ptr32 s2_3215;
				ptr32 s3_3216;
				Eq_2 a1_3231;
				Eq_2 a0_3230 = __ieee754_sqrt(ra, a0, a1, fflags, frm, out a1_3231, out s2_3215, out s3_3216, out fflags_3213, out frm_3214);
				a1Out = a1_3231;
				s2Out = s2_3215;
				s3Out = s3_3216;
				fflagsOut = fflags_3213;
				frmOut = frm_3214;
				return a0_3230;
			}
l2309DD5C:
			a1_100 = fabs(a1);
			if (a0 != 0x00)
				goto l2309DD6C;
			goto l2309DDC0;
		}
		if (((a1 & 0x7FFFFFFF) + 0xC0100000 | a0) != 0x00)
		{
			if ((a1 & 0x7FFFFFFF) >= 0x3FF00000)
			{
				a1_100 = a3;
				a0_102.u0 = 0;
				if (a3 >= 0x00)
					goto l2309DBF0;
			}
			else if (a3 < 0x00)
			{
				a0_102.u0 = 0;
				a1_100 = a3 ^ 0x80000000;
				goto l2309DBF0;
			}
l2309DE2C:
			a0_102.u0 = 0;
			a1_100.u0 = 0;
			goto l2309DBF0;
		}
	}
	a0_102.u0 = 0;
	a1_100.u0 = 0x3FF00000;
	goto l2309DBF0;
}

// 2309EB50: Register Eq_2 __ieee754_sqrt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      __ieee754_pow
Eq_2 __ieee754_sqrt(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 s0_115 = a0;
	if ((a1 & 0x7FF00000) == 0x7FF00000)
	{
		Eq_2 a0_20;
		Eq_2 a1_21;
		ptr32 fflags_35;
		ptr32 frm_36;
		Eq_2 s0_38;
		Eq_2 s1_39;
		ptr32 s2_40;
		ptr32 s3_41;
		Eq_2 a1_51;
		word32 s6_728;
		word32 s7_729;
		word32 s8_730;
		word32 s9_731;
		word32 a3_725;
		word32 s4_726;
		word32 s5_727;
		Eq_2 a0_60 = __adddf3(__muldf3(ra, a0, a1, a0, a1, fflags, frm, out s0_38, out s1_39, out a0_20, out a1_21, out a3_725, out s2_40, out s3_41, out s4_726, out s5_727, out s6_728, out s7_729, out s8_730, out s9_731, out fflags_35, out frm_36), a0_20, a1_21, s0_38, s1_39, fflags_35, frm_36, out a1_51);
		a1Out = a1_51;
		s2Out = s2_40;
		s3Out = s3_41;
		fflagsOut = fflags_35;
		frmOut = frm_36;
		return a0_60;
	}
	Eq_2 a4_121;
	Eq_2 a4_116;
	int32 t3_127;
	Eq_2 a1_118;
	int32 a2_126;
	int32 a7_125;
	Eq_2 a6_124;
	Eq_2 a5_119 = a1;
	Eq_2 a3_117 = a0;
	if (a1 > 0x00)
	{
		t3_127 = a1 >> 0x14;
		if (a1 >> 0x14 != 0x00)
			goto l2309EB88;
		a4_121 = a1;
		a5_119.u0 = 0;
	}
	else
	{
		a4_116 = a1;
		if (((word32) (word31) a1 | a0) == 0x00)
			goto l2309ECB4;
		if (a1 != 0x00)
		{
			Eq_2 a1_76;
			Eq_2 a0_75 = __subdf3(ra, a0, a1, a0, a1, fflags, frm, out a1_76);
			Eq_2 a0_87;
			Eq_2 a1_88;
			word32 s6_736;
			word32 s7_737;
			word32 s9_738;
			word32 s0_732;
			word32 s1_733;
			word32 a3_734;
			word32 s5_735;
			__divdf3(ra, a0_75, a1_76, a0_75, a1_76, fflags, frm, out s0_732, out s1_733, out a0_87, out a1_88, out a3_734, out s2, out s3, out s5_735, out s6_736, out s7_737, out s9_738, out fflags, out frm);
			s0_115 = a0_87;
			a4_116 = a1_88;
			goto l2309ECB4;
		}
		do
		{
			a1_118 = a3_117 >> 11;
			a5_119 = (byte) a5_119.u0 - 21;
			a4_121 = a1_118;
			a3_117 <<= 0x15;
		} while (a1_118 == 0x00);
		if (a1_118 >> 0x14 != 0x00)
		{
			a6_124 = a3_117;
			a7_125 = 32;
			a2_126 = -1;
			goto l2309ED34;
		}
	}
	a2_126 = 0;
	while (true)
	{
		a4_121 <<= 0x01;
		int32 a0_135 = a2_126 + 1;
		if (a4_121 << 11 < 0x00)
			break;
		a2_126 = a0_135;
	}
	a6_124 = a3_117;
	a7_125 = 32 - a0_135;
	a1_118 = a4_121;
	a3_117 <<= a0_135;
l2309ED34:
	t3_127 = a5_119 - a2_126;
	a5_119 = a6_124 >> a7_125 | a1_118;
l2309EB88:
	int32 t3_160 = t3_127 + -0x03FF;
	Eq_566117 a5_166 = ((a5_119 & 0x000FFFFF | 0x00100000) << 0x01) + (a3_117 >> 0x1F);
	Eq_566127 a4_167 = a3_117 << 0x01;
	if ((t3_160 & 1) != 0x00)
	{
		a5_166 = (a5_166 << 0x01) + (a4_167 >> 0x1F);
		a4_167 = a3_117 << 0x02;
	}
	Eq_566134 a1_174 = 22;
	Eq_566136 t4_175 = 0;
	Eq_566117 a3_176 = 0;
	Eq_566140 a2_177 = 0x00200000;
	do
	{
		word32 a0_180 = a3_176 + a2_177;
		uint32 a6_182 = a4_167 >> 0x1F;
		a1_174 = (word32) a1_174 - 1;
		if (a5_166 >= a0_180)
		{
			a5_166 -= a0_180;
			a3_176 = a0_180 + a2_177;
			t4_175 += a2_177;
		}
		a5_166 = a6_182 + (a5_166 << 0x01);
		a4_167 <<= 0x01;
		a2_177 >>= 0x01;
	} while (a1_174 != 0x00);
	Eq_566170 t1_199 = 0;
	Eq_2 a6_200 = 32;
	Eq_566174 a2_201 = 0x80000000;
	do
	{
		Eq_566117 a7_209;
		Eq_566177 a5_210;
		word32 a0_204 = a2_201 + a1_174;
		if (a3_176 < a5_166)
		{
			a1_174 = a0_204 + a2_201;
			a7_209 = a3_176;
			if (a0_204 >= 0x00)
				goto l2309EC4C;
			goto l2309ED44;
		}
		if (a5_166 == a3_176 && a4_167 >= a0_204)
		{
			a1_174 = a0_204 + a2_201;
			if (a0_204 >= 0x00)
			{
				a7_209 = a5_166;
				a5_210.u0 = 0;
			}
			else
			{
l2309ED44:
				a7_209 = a3_176 + (~a1_174 >>u 0x1F);
l2309EC4C:
				a5_210 = a5_166 - a3_176 - (word32) (a4_167 < a0_204);
			}
			uint32 a4_241 = a4_167 - a0_204;
			a6_200 = (word32) a6_200 - 1;
			t1_199 += a2_201;
			a3_176 = a7_209;
			a5_166 = (a5_210 << 0x01) + (a4_241 >> 0x1F);
			a4_167 = a4_241 << 0x01;
			a2_201 >>= 0x01;
			if (a6_200 == 0x00)
				break;
			continue;
		}
		a6_200 = (word32) a6_200 - 1;
		a5_166 = (a5_166 << 0x01) + (a4_167 >> 0x1F);
		a4_167 <<= 0x01;
		a2_201 >>= 0x01;
	} while (a6_200 != 0x00);
	if ((a5_166 | a4_167) == 0x00)
		a6_200 = t1_199 >> 0x01;
	else if (t1_199 != -1)
		a6_200 = (word32) t1_199 + 1 >> 0x01;
	else
		t4_175 = (word32) t4_175 + 1;
	int32 a4_281 = t4_175 >> 0x01;
	if ((t4_175 & 1) != 0x00)
		a6_200 |= 0x80000000;
	s0_115 = a6_200;
	a4_116 = (t3_160 >> 0x01 << 0x14) + (a4_281 + 0x3FE00000);
l2309ECB4:
	a1Out = a4_116;
	s2Out = s2;
	s3Out = s3;
	fflagsOut = fflags;
	frmOut = frm;
	return s0_115;
}

// 2309EE04: Register uint32 finite(Register Eq_2 a1)
// Called from:
//      pow
uint32 finite(Eq_2 a1)
{
	return (word32) (word31) a1 + 0x80100000 >> 0x1F;
}

// 2309EE1C: Register int32 nan(Register out Eq_563594 a1Out)
// Called from:
//      __ieee754_pow
int32 nan(union Eq_563594 & a1Out)
{
	int32 a0_6 = g_dw4200EE40;
	a1Out = g_t4200EE44;
	return a0_6;
}

// 2309EE30: Register Eq_2 rint(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out)
// Called from:
//      pow
Eq_2 rint(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out)
{
	Eq_2 t1_111;
	Eq_2 a7_112;
	Eq_2 a6_122;
	Eq_566334 a4_6 = a1 >> 0x14 & 0x07FF;
	Eq_2 t3_132 = a1;
	if (a4_6 <= -0x0412)
	{
		if (a4_6 < ~0x03FE)
		{
			a7_112 = a0;
			t1_111 = a1;
			if ((a1 & 0x7FFFFFFF | a0) != 0x00)
			{
				struct Eq_566429 * a3_71 = 588035048 + ((a1 >> 0x1F) << 0x03);
				ui32 a4_65 = (word32) (word20) a1 | a0;
				Eq_2 s2_73 = a3_71->t0000;
				Eq_2 s3_74 = a3_71->t0004;
				t1_111 = a1_100 & 0x7FFFFFFF | (a1 >> 0x1F) << 0x1F;
				Eq_2 a1_85;
				ui32 a1_100;
				a7_112 = __subdf3(ra, __adddf3(ra, s2_73, s3_74, a0, (0x00 - a4_65 | a4_65) >> 0x0C & 0x00080000 | a1 & 0xFFFE0000, fflags, frm, out a1_85), a1_85, s2_73, s3_74, fflags, frm, out a1_100);
			}
			goto l2309EF18;
		}
		Eq_566351 a1_115 = 0x000FFFFF >> (word32) a4_6 - 0x03FF;
		a7_112 = a0;
		t1_111 = a1;
		if ((a1_115 & a1 | a0) != 0x00)
		{
			a6_122 = a1_115 >> 0x01 & a1 | a0;
			if (a6_122 != 0x00)
			{
				a6_122 = 0x00 - (word32) (a4_6 < -0x0413) & 0x80000000;
				t3_132 = ~(a1_115 >> 0x01) & a1 | 0x00040000 >> (word32) a4_6 - 0x03FF;
			}
			goto l2309EEC8;
		}
	}
	else if (a4_6 > -0x0432)
	{
		a7_112 = a0;
		t1_111 = a1;
		if (a4_6 == -0x07FF)
		{
			Eq_2 a1_47;
			a7_112 = __adddf3(ra, a0, a1, a0, a1, fflags, frm, out a1_47);
			t1_111 = a1_47;
		}
	}
	else
	{
		uint32 a2_27 = -1 >> (word32) a4_6 - 0x0413;
		a7_112 = a0;
		t1_111 = a1;
		if ((a2_27 & a0) != 0x00)
		{
			a6_122 = a0;
			if ((a2_27 >> 0x01 & a0) != 0x00)
				a6_122 = ~(a2_27 >> 0x01) & a0 | 0x40000000 >> (word32) a4_6 - 0x0413;
l2309EEC8:
			struct Eq_566366 * t1_137 = 588035048 + ((a1 >> 0x1F) << 0x03);
			Eq_2 s0_139 = t1_137->t0000;
			Eq_2 s1_140 = t1_137->t0004;
			Eq_2 a1_151;
			Eq_2 a1_167;
			a7_112 = __subdf3(ra, __adddf3(ra, s0_139, s1_140, a6_122, t3_132, fflags, frm, out a1_151), a1_151, s0_139, s1_140, fflags, frm, out a1_167);
			t1_111 = a1_167;
			goto l2309EF18;
		}
	}
l2309EF18:
	a1Out = t1_111;
	return a7_112;
}

