pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 2309F054: Register Eq_2 scalbn(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register int32 a2, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      __ieee754_pow
Eq_2 scalbn(Eq_2 ra, Eq_2 a0, Eq_2 a1, int32 a2, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 a4_118;
	int32 a5_10 = a1 >> 0x14 & 0x07FF;
	int32 s0_108 = a2;
	if (a5_10 == 0x00)
	{
		if (((word32) (word31) a1 | a0) == 0x00)
			goto l2309F0FC;
		word32 s1_379;
		word32 a3_380;
		word32 s2_381;
		word32 s3_382;
		word32 s4_383;
		word32 s5_384;
		word32 s6_385;
		word32 s7_386;
		word32 s8_387;
		word32 s9_388;
		ra = __muldf3(ra, a0, a1, g_t4200EE48, g_t4200EE4C, fflags, frm, out s0_108, out s1_379, out a0, out a1, out a3_380, out s2_381, out s3_382, out s4_383, out s5_384, out s6_385, out s7_386, out s8_387, out s9_388, out fflags, out frm);
		a4_118 = a1;
		if (s0_108 < ~0xC34F)
		{
			Eq_2 a0_74;
			Eq_2 a1_75;
			ptr32 fflags_89;
			ptr32 frm_90;
			word32 s0_389;
			word32 s1_390;
			word32 a3_391;
			word32 s2_392;
			word32 s3_393;
			word32 s4_394;
			word32 s5_395;
			word32 s6_396;
			word32 s7_397;
			word32 s8_398;
			word32 s9_399;
			__muldf3(ra, a0, a1, g_t4200EDF0, g_t4200EDF4, fflags, frm, out s0_389, out s1_390, out a0_74, out a1_75, out a3_391, out s2_392, out s3_393, out s4_394, out s5_395, out s6_396, out s7_397, out s8_398, out s9_399, out fflags_89, out frm_90);
			a1Out = a1_75;
			fflagsOut = fflags_89;
			frmOut = frm_90;
			return a0_74;
		}
		a5_10 = (a1 >> 0x14 & 0x07FF) + -54;
	}
	else
	{
		a4_118 = a1;
		if (a5_10 == 0x07FF)
		{
			Eq_2 a1_21;
			Eq_2 a0_20 = __adddf3(ra, a0, a1, a0, a1, fflags, frm, out a1_21);
			a1Out = a1_21;
			fflagsOut = fflags;
			frmOut = frm;
			return a0_20;
		}
	}
	Eq_2 a7_176;
	Eq_2 a6_175;
	struct Eq_566562 * a5_173;
	int32 a5_110 = s0_108 + a5_10;
	if (a5_110 <= 0x07FE)
	{
		if (a5_110 > 0x00)
		{
			a1Out = a4_118 & ~0x7FF00000 | a5_110 << 0x14;
			fflagsOut = fflags;
			frmOut = frm;
			return a0;
		}
		if (a5_110 >= -53)
		{
			Eq_2 a0_139;
			Eq_2 a1_140;
			ptr32 fflags_154;
			ptr32 frm_155;
			word32 s0_400;
			word32 s1_401;
			word32 a3_402;
			word32 s2_403;
			word32 s3_404;
			word32 s4_405;
			word32 s5_406;
			word32 s6_407;
			word32 s7_408;
			word32 s8_409;
			word32 s9_410;
			__muldf3(ra, a0, a5_110 + 54 << 0x14 | a4_118 & ~0x7FF00000, g_t4200EE60, g_t4200EE64, fflags, frm, out s0_400, out s1_401, out a0_139, out a1_140, out a3_402, out s2_403, out s3_404, out s4_405, out s5_406, out s6_407, out s7_408, out s8_409, out s9_410, out fflags_154, out frm_155);
			a1Out = a1_140;
			fflagsOut = fflags_154;
			frmOut = frm_155;
			return a0_139;
		}
		if (s0_108 <= 50000)
		{
			a5_173 = (struct Eq_566562 *) &g_t4200EDF0;
			a6_175 = g_t4200EDF0;
			a7_176 = g_t4200EDF4;
			if (a1 < 0x00)
			{
				a6_175 = g_t4200EE58;
				a7_176 = g_t4200EE5C;
			}
l2309F0E8:
			word32 s0_411;
			word32 s1_412;
			word32 a3_413;
			word32 s2_414;
			word32 s3_415;
			word32 s4_416;
			word32 s5_417;
			word32 s6_418;
			word32 s7_419;
			word32 s8_420;
			word32 s9_421;
			__muldf3(ra, a6_175, a7_176, a5_173->t0000, a5_173->t0004, fflags, frm, out s0_411, out s1_412, out a0, out a1, out a3_413, out s2_414, out s3_415, out s4_416, out s5_417, out s6_418, out s7_419, out s8_420, out s9_421, out fflags, out frm);
			goto l2309F0FC;
		}
	}
	a5_173 = (struct Eq_566562 *) &g_t4200ED28;
	a6_175 = g_t4200ED28;
	a7_176 = g_t4200ED2C;
	if (a1 < 0x00)
	{
		word32 s0_422;
		word32 s1_423;
		word32 a3_424;
		word32 s2_425;
		word32 s3_426;
		word32 s4_427;
		word32 s5_428;
		word32 s6_429;
		word32 s7_430;
		word32 s8_431;
		word32 s9_432;
		__muldf3(ra, g_t4200EE50, g_t4200EE54, g_t4200ED28, g_t4200ED2C, fflags, frm, out s0_422, out s1_423, out a0, out a1, out a3_424, out s2_425, out s3_426, out s4_427, out s5_428, out s6_429, out s7_430, out s8_431, out s9_432, out fflags, out frm);
l2309F0FC:
		a1Out = a1;
		fflagsOut = fflags;
		frmOut = frm;
		return a0;
	}
	goto l2309F0E8;
}

// 2309F20C: Register Eq_479350 __lshrdi3(Register Eq_479350 a0, Register uint32 a1, Register int32 a2)
// Called from:
//      EF_Ctrl_Read_PowerOffset_Opt
Eq_479350 __lshrdi3(Eq_479350 a0, uint32 a1, int32 a2)
{
	if (a2 != 0x00)
	{
		int32 a5_5 = 32 - a2;
		if (a5_5 <= 0x00)
			a0 = a1 >> a2 + -32;
		else
			a0 = a0 >> a2 | a1 << a5_5;
	}
	return a0;
}

// 2309F244: Register Eq_237971 __ashldi3(Register Eq_237971 a0, Register Eq_237972 a1, Register Eq_237973 a2, Register out Eq_237972 a1Out, Register out Eq_237971 a4Out, Register out Eq_237976 a5Out)
// Called from:
//      seg_rx_reset
//      bt_mesh_trans_recv
Eq_237971 __ashldi3(Eq_237971 a0, Eq_237972 a1, Eq_237973 a2, union Eq_237972 & a1Out, union Eq_237971 & a4Out, union Eq_237976 & a5Out)
{
	if (a2 != 0x00)
	{
		a5 = 32 - a2;
		if (a5 <= 0x00)
		{
			a4.u0 = 0;
			a1 = a0 << (word32) a2.u0 - 32;
		}
		else
		{
			a4 = a0 << a2;
			a1 = a1 << a2 | a0 >> a5;
		}
		a0 = a4;
	}
	a1Out = a1;
	a4Out = a4;
	a5Out = a5;
	return a0;
}

// 2309F27C: Register Eq_2 __clzsi2(Register Eq_2 a0, Register out Eq_32714 a4Out, Register out (ptr32 byte) a5Out)
// Called from:
//      txl_payload_handle
//      txl_transmit_trigger
//      rc_get_initial_rate_config
//      ke_evt_schedule
//      rxu_mgt_ind_handler
//      apm_start_req_handler
//      heartbeat_pub_set
//      hb_sub_send_status.constprop.14
//      vTaskSwitchContext
//      bloop_run
//      __adddf3
//      __divdf3
//      __muldf3
//      __subdf3
//      __floatsidf
//      __floatunsidf
//      __extendsfdf2
Eq_2 __clzsi2(Eq_2 a0, union Eq_32714 & a4Out, byte & a5Out)
{
	int32 a5_10;
	if (a0 < 0x00010000)
		a5_10 = (word32) (a0 > 0x00FF) << 0x03;
	else
	{
		a5_10 = 16;
		if (a0 >= 0x01000000)
			a5_10 = 24;
	}
	byte * a5_18 = (word32) (a0 >> a5_10) + 588035184;
	Eq_32714 a4_13 = 32 - a5_10;
	Eq_2 a0_22 = a4_13 - (word32) (*a5_18);
	a4Out = a4_13;
	a5Out = a5_18;
	return a0_22;
}

// 2309F2C8: Register Eq_2 __popcountsi2(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      sub_update
//      ack_timeout
Eq_2 __popcountsi2(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	uint32 a0_10 = a0 - (a0 >> 0x01 & 0x55555555);
	a4Out = 0x33333333;
	a5Out = 0x01010101;
	uint32 a5_14 = (a0_10 & 0x33333333) + (a0_10 >> 0x02 & 0x33333333);
	return ((a5_14 >> 0x04) + a5_14 & 0x0F0F0F0F) + 0x01010101 >> 0x18;
}

