pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0009.c
// 230A00A4: Register Eq_2 __umoddi3(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_2 a5Out)
// Called from:
//      format_int
Eq_2 __umoddi3(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, union Eq_2 & a5Out)
{
	Eq_2 a7_167 = a2;
	Eq_2 a4_171 = a3;
	Eq_2 a5_141 = a0;
	Eq_2 a6_10 = a1;
	if (a3 == 0x00)
	{
		int32 t1_187;
		if (a1 < a2)
		{
			if (a2 < 0x00010000)
			{
				if (a2 > 0x00FF)
					a4_171.u0 = 8;
			}
			else
			{
				a4_171.u0 = 16;
				if (a2 >= 0x01000000)
					a4_171.u0 = 24;
			}
			word32 t3_281 = CONVERT(Mem0[0x230CB470<p32> + (a2 >>u a4_171):byte], byte, word32) + a4_171;
			t1_187 = 32 - t3_281;
			if (t1_187 != 0x00)
			{
				a7_167 = a2 << t1_187;
				a6_10 = a0 >> t3_281 | a1 << t1_187;
				a5_141 = a0 << t1_187;
			}
			uint32 a2_292 = a7_167 >> 0x10;
			uint32 a0_296 = a7_167 << 0x10;
			Eq_2 a3_303 = (a6_10 & a2_292) << 0x10 | a5_141 >> 0x10;
			Eq_2 a6_304 = (a0_296 >> 0x10) + (a6_10 >> a2_292);
			if (a3_303 < a6_304)
			{
				a3_303 += a7_167;
				if (a3_303 >= a7_167 && a3_303 < a6_304)
					a3_303 += a7_167;
			}
			uint32 a3_309 = a3_303 - a6_304;
			Eq_2 a3_317 = (a0_296 >> 0x10) + (a3_309 >> a2_292);
			Eq_2 a5_319 = (a3_309 & a2_292) << 0x10 | (word32) ((word16) a5_141);
			if (a5_319 < a3_317)
			{
				a5_319 += a7_167;
				if (a5_319 >= a7_167 && a5_319 < a3_317)
					a5_319 += a7_167;
			}
			a5_141 = a5_319 - a3_317;
		}
		else
		{
			if (a2 == 0x00)
				a7_167 = 1 >> a2;
			if (a7_167 < 0x00010000)
			{
				if (a7_167 > 0x00FF)
					a4_171.u0 = 8;
			}
			else
			{
				a4_171.u0 = 16;
				if (a7_167 >= 0x01000000)
					a4_171.u0 = 24;
			}
			uint32 a1_227;
			word32 t3_186 = CONVERT(Mem0[0x230CB470<p32> + (a7_167 >>u a4_171):byte], byte, word32) + a4_171;
			t1_187 = 32 - t3_186;
			if (t1_187 == 0x00)
				a1_227 = a1 - a7_167;
			else
			{
				a7_167 <<= t1_187;
				uint32 a4_191 = a1 >> t3_186;
				uint32 t3_199 = a0 >> t3_186 | a1 << t1_187;
				word32 a1_201 = (word32) (word16) a7_167;
				a5_141 = a0 << t1_187;
				Eq_2 a3_205 = (a4_191 & a7_167 >> 0x10) << 0x10 | t3_199 >> 0x10;
				Eq_2 a4_206 = a1_201 + (a4_191 >> (a7_167 >> 0x10));
				if (a3_205 < a4_206)
				{
					a3_205 += a7_167;
					if (a3_205 >= a7_167 && a3_205 < a4_206)
						a3_205 += a7_167;
				}
				uint32 a2_211 = a3_205 - a4_206;
				Eq_2 a2_220 = a1_201 + (a2_211 >> (a7_167 >> 0x10));
				Eq_2 a1_221 = (a2_211 & a7_167 >> 0x10) << 0x10 | (word32) ((word16) t3_199);
				if (a1_221 < a2_220)
				{
					a1_221 += a7_167;
					if (a1_221 >= a7_167 && a1_221 < a2_220)
						a1_221 += a7_167;
				}
				a1_227 = a1_221 - a2_220;
			}
			uint32 a4_231 = a7_167 >> 0x10;
			uint32 a0_232 = a7_167 << 0x10;
			Eq_2 a3_244 = (a1_227 & a4_231) << 0x10 | a5_141 >> 0x10;
			Eq_2 a1_245 = (a0_232 >> 0x10) + (a1_227 >> a4_231);
			if (a3_244 < a1_245)
			{
				a3_244 += a7_167;
				if (a3_244 >= a7_167 && a3_244 < a1_245)
					a3_244 += a7_167;
			}
			uint32 a1_250 = a3_244 - a1_245;
			Eq_2 a1_258 = (a0_232 >> 0x10) + (a1_250 >> a4_231);
			Eq_2 a5_260 = (a1_250 & a4_231) << 0x10 | (word32) ((word16) a5_141);
			if (a5_260 < a1_258)
			{
				a5_260 += a7_167;
				if (a5_260 >= a7_167 && a5_260 < a1_258)
					a5_260 += a7_167;
			}
			a5_141 = a5_260 - a1_258;
		}
		a0 = a5_141 >> t1_187;
	}
	else if (a1 >= a3)
	{
		int32 a4_13;
		if (a3 < 0x00010000)
			a4_13 = (word32) (a3 > 0x00FF) << 0x03;
		else
		{
			a4_13 = 16;
			if (a3 >= 0x01000000)
				a4_13 = 24;
		}
		word32 t4_28 = CONVERT(Mem0[0x230CB470<p32> + (a3 >>u a4_13):byte], byte, word32) + a4_13;
		int32 t3_29 = 32 - t4_28;
		if (t3_29 == 0x00)
		{
			if (a3 < a1 || a0 >= a2)
				a5_141 = a0 - a2;
			a0 = a5_141;
		}
		else
		{
			uint32 a3_33 = a2 >> t4_28 | a3 << t3_29;
			uint32 a4_36 = a1 >> t4_28;
			uint32 a5_41 = a0 >> t4_28 | a1 << t3_29;
			word32 a1_43 = (word32) (word16) a3_33;
			uint32 a4_47 = a4_36 >> (a3_33 >> 0x10);
			uint32 a2_45 = a2 << t3_29;
			uint32 a0_46 = a0 << t3_29;
			uint32 a7_49 = (a4_36 & a3_33 >> 0x10) << 0x10 | a5_41 >> 0x10;
			uint32 t5_50 = a1_43 + a4_47;
			uint32 t1_51 = a4_47;
			if (a7_49 < t5_50)
			{
				a7_49 += a3_33;
				t1_51 = a4_47 + -1;
				if (a7_49 >= a3_33 && a7_49 < t5_50)
				{
					t1_51 = a4_47 + -2;
					a7_49 += a3_33;
				}
			}
			uint32 a7_58 = a7_49 - t5_50;
			uint32 a7_61 = a7_58 >> (a3_33 >> 0x10);
			uint32 a6_64 = a1_43 + a7_61;
			uint32 a1_68 = (a7_58 & a3_33 >> 0x10) << 0x10 | (word32) ((word16) a5_41);
			uint32 a5_69 = a7_61;
			if (a1_68 < a6_64)
			{
				a1_68 += a3_33;
				a5_69 = a7_61 + -1;
				if (a1_68 >= a3_33 && a1_68 < a6_64)
				{
					a5_69 = a7_61 + -2;
					a1_68 += a3_33;
				}
			}
			uint32 t1_80 = t1_51 << 0x10 | a5_69;
			uint32 a5_92 = (t1_80 >> 0x10) + (a2_45 & 0xFFFF);
			uint32 a4_91 = (t1_80 & 0xFFFF) + (a2_45 & 0xFFFF);
			uint32 a1_85 = a1_68 - a6_64;
			uint32 t1_101 = (t1_80 >> 0x10) + (a2_45 >> 0x10);
			uint32 a6_97 = (a4_91 >> 0x10) + (((t1_80 & 0xFFFF) + (a2_45 >> 0x10)) + a5_92);
			if (a6_97 < a5_92)
				t1_101 += 0x00010000;
			uint32 t1_102 = (a6_97 >> 0x10) + t1_101;
			uint32 a4_109 = ((a6_97 & 0xFFFF) << 0x10) + (a4_91 & 0xFFFF);
			if (a1_85 < t1_102 || a1_85 == t1_102 && a0_46 < a4_109)
			{
				uint32 a2_117 = a4_109 - a2_45;
				t1_102 -= (word32) (a4_109 < a2_117) + a3_33;
				a4_109 = a2_117;
			}
			uint32 a4_129 = a0_46 - a4_109;
			a5_141 = a1_85 - t1_102 - (word32) (a0_46 < a4_129) << t4_28;
			a0 = a5_141 | a4_129 >> t3_29;
		}
	}
	a5Out = a5_141;
	return a0;
}

